[
  {
    "index": 87,
    "sura": 87,
    "verse": 1,
    "tafsirs": [
      {
        "resource_id": 168,
        "text": "<p>Commentary</p><p>Ruling [ 1]</p><p>Scholars have ruled that when anyone recites the verse: سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى (Pronounce the purity of the name of your most exalted Lord...87:1) it is commendable to say:</p><p>سُبحانَ رَبِِّیَ الْأَعْلَى</p><p>'I pronounce the purity of my most exalted Lord.'</p><p>This was the practice of all the noble Companions, like Sayyidna ` Abdullah Ibn ` Abbaa, Ibn ` Umar, Ibn Zubair, Abu Musa and ` Abdullah Ibn Masud ؓ Whenever they started reciting the Surah, they would recite:</p><p>سُبحانَ رَبِِّیَ الْأَعْلَى</p><p>'I pronounce the purity of my most exalted Lord.' [ Qurtubi ].</p><p>It should be noted that the desirability of reciting this is outside of the prayer.</p><p>Ruling [ 2]</p><p>Sayyidna 'Uqbah Ibn ` Amir Al-Juhani ؓ narrates that when the Surah Al-A` la was revealed, the Holy Prophet ﷺ instructed:</p><p>اجعلوا فی سجودکم</p><p>'Say this (SubhanaRabbiyal-A` 1a) in your sujud [ prostrations ] '</p><p>سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى (Pronounce the purity of the name of your Most exalted Lord.) The word tasbih means 'to pronounce the purity' and سَبِّحِ اسْمَ رَبِّكَ signifies to 'honour the name of your Lord'. When the name of Allah is pronounced, it should be done with utmost humility and respect.</p><p>His name should be kept pure and free from anything that is unbecoming to His sublime status. Allah should be called by the names He Himself has stated or taught the Holy Prophet ﷺ . It is not permitted to call Him by any other name.</p><p>Ruling [ 3]</p><p>Besides, it is also included in the above imperative that there are some names exclusively meant for Allah; calling human beings or any other creation by those specific names is contrary to declaring the purity of Allah. Therefore, it is not permissible. [ Qurtubi ]. Nowadays, people are not particular about names like ` Abdur Rahman, ` Abdur Razzaq, ` Abdul Ghaffar and ` Abdul Quddus. They call the persons bearing these names 'Rahman', 'Razzaq', 'Ghaffar', 'Quddus' and so on, for short. People have got into the habit of shortening such names without realising that the speakers as well as the listeners are committing a sin. People commit this joyless sin day and night without any reason.</p><p>Some commentators interpret the word 'ism' does not mean 'name' in this verse. Instead, they say, it is referring to the Dhat or the 'Being' of Allah. According to the Arabic expressions, this interpretation is not unlikely, and the Qur'an has used the word 'ism' in that sense also. The Hadith that instructs us to recite the tasbih in sajdah [ prostration ] is not \"I pronounce the purity of the name of my most exalted Lord, but \"I pronounce the purity of my most exalted Lord\". This indicates that in this context 'ism' is not used in the sense of 'name' but it refers to the Being of Allah Himself. [ Qurtubi ]</p>"
      },
      {
        "resource_id": 92,
        "text": "سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى (1) الافتتاح بأمر النبي صلى الله عليه وسلم بأن يسبح اسمَ ربه بالقول ، يؤذن بأنه سيُلقي إليه عقبه بشارة وخيراً له وذلك قوله : { سنقرئك فلا تنسى } [ الأعلى : 6 ] الآيات كما سيأتي ففيه براعة استهلال .والخطاب للنبيء صلى الله عليه وسلموالتسبيح : التنزيه عن النقائص وهو من الأسماء التي لا تضاف لغير اسم الله تعالى وكذلك الأفعال المشتقة منه لا ترفع ولا تنصب على المفعولية إلا ما هو اسم لله ، وكذلك أسماء المصدر منه نحو : سبحان الله ، وهو من المعاني الدينية ، فالأشبه أنه منقول إلى العربية من العبرانية وقد تقدم عند قوله تعالى : { ونحن نسبح بحمدك } في سورة البقرة ( 30 ) .وإذْ عُدِّي فعلُ الأمر بالتسبيح هنا إلى اسْم فقد تعين أن المأمور به قول دال على تنزيه الله بطريقة إجراء الأخبار الطيبة أو التوصيف بالأوصاف المقدسة لإِثباتها إلى ما يدل على ذاته تعالى من الأسماء والمعاني ، ولما كان أقوالاً كانت متعلقة باسم الله باعتبار دلالته على الذات ، فالمأمور به إجراء الأخبار الشريفة والصفات الرفيعة على الأسماء الدالة على الله تعالى من أعلام وصفات ونحوها ، وذلك آيل إلى تنزيه المسمَّى بتلك الأسماء . ولهذا يكثر في القرآن إناطة التسبيح بلفظ اسم الله نحو قوله : { فسبح باسم ربك العظيم } [ الواقعة : 74 ] وقد تقدم ذلك في مبحث الكلام على البسملة في أول هذا التفسير .فتسبيح اسم الله النطقُ بتنزيهه في الخُوَيصَّة وبينَ الناس بذكر يليق بجلاله من العقائد والأعمال كالسجود والحمد . ويشمل ذلك استحضارَ الناطق بألفاظ التسبيح معانيَ تلك الألفاظ إذ المقصود من الكلام معناه . وبتظاهُرِ النطق مع استحضار المعنى يتكرر المعنى على ذهن المتكلم ويتجدد ما في نفسه من تعظيم لله تعالى .وأما تفكر العبد في عظمة الله تعالى وترديد تنزيهه في ذهنه فهو تسبيح لذات الله ومسمَّى اسمه ولا يسمى تسبيح اسممِ الله ، لأن ذلك لا يجري على لفظ من أسماء الله تعالى ، فهذا تسبيح ذات الله وليس تسبيحاً لاسمه .وهذا ملاك التفرقة بين تعلق لفظ التسبيح بلفظ اسم الله نحو { سبح اسم ربك } ، وبين تعلقه بدون اسم نحو { ومن الليل فاسجُد له وسبحه } [ الإنسان : 26 ] ونحو { ويسبحونه وله يسجدون } [ الأعراف : 206 ] فإذا قلنا : { اللَّه أحد } [ الإخلاص : 1 ] أو قلنا : { هو الله الذي لا إله إلا هو الملك القدوس السلام } [ الحشر : 23 ] إلى آخر السورة كان ذلك تسبيحاً لاسمه تعالى ، وإذا نفينا الإِلاهية عن الأصنام لأنها لا تخلق كما في قوله تعالى : { إن الذين تدعون من دون اللَّه لن يخلقوا ذباباً ولو اجتمعوا له } [ الحج : 73 ] كان ذلك تسبيحاً لذات الله لا لاسمه لأن اسمه لم يجر عليه في هذا الكلام إخبار ولا توصيف .فهذا مناط الفرق بين استعمال { سبح اسم ربك } واستعمال { وسبحه } ومَآل الإطلاقين في المعنى واحد لأن كلا الإِطلاقين مراد به الإِرشاد إلى معرفة أن الله منزه عن النقائص .واعلم أن مما يدل على إرادة التسبيح بالقول وجودَ قرينة في الكلام تقتضيه مثللِ التوقيت بالوقت في قوله تعالى : { وسبحوه بكرة وأصيلاً } [ الأحزاب : 42 ] فإن الذي يكلف بتوقيته هو الأقوال والأفعال دون العقائد ، ومثل تعدية الفعل بالباء مثل قوله تعالى : { وسبحوا بحمد ربهم } [ السجدة : 15 ] فإن الحمد قول فلا يصاحب إلا قولاً مثله .وتعريف : { اسم } بطريق الإضافة إلى { ربك } دون تعريفه بالإضافة إلى عَلَم الجلالة نحو : سبح اسمَ الله ، لما يُشعر به وصف رب من أنه الخالق المدبر . وأما إضافة ( رب ) إلى ضمير الرسول صلى الله عليه وسلم فلتشريفه بهذه الإضافة وأن يكون له حظ زائد على التكليف بالتسبيح .ثم أجري على لفظ { ربك } صفة { الأعلى } وما بعدها من الصلات الدالة على تصرفات قدرته ، فهو مستحق للتنزيه لصفات ذاته ولِصفات إنعامه على الناس بخلقهم في أحسن تقويم ، وهدايتهم ، ورزقهم ، ورزق أنعامهم ، للإِيماء إلى موجب الأمر بتسبيح اسمه بأنه حقيق بالتنزيه استحقاقاً لذاته ولوصفه بصفة أنه خالق المخلوقات خلقاً يدل على العلم والحكمة وإتقان الصنع ، وبأنه أنعم بالهدى والرزق الذين بهما استقامة حال البشر في النفس والجسد وأوثرت الصفات الثلاث الأول لما لها من المناسبة لغرض السورة كما سنبينه .فلفظ { الأعلى } اسم يفيد الزيادة في صفة العلو ، أي الارتفاع . والارتفاع معدود في عرف الناس من الكمال فلا ينْسب العلوّ بدون تقييد إلا إلى شيء غير مذموم في العرف ، ولذلك إذا لم يذكر مع وصف الأعلى مفضل عليه أفاد التفضيل المطلق كما في وصفه تعالى هنا . ولهذا حكَى عن فرعون أنه قال : { أنا ربكم الأعلى } [ النازعات : 24 ] .والعلوّ المشتقُّ منه وصفه تعالى : { الأعلى } علوّ مجازي ، وهو الكمال التام الدائم .ولم يعدَّ وصفه تعالى : { الأعلى } في عداد الأسماء الحسنى استغناء عن اسمه { العليُّ } لأن أسماء الله توقيفية فلا يعد من صفات الله تعالى بمنزلة الاسم إلا ما كثر إطلاقه إطلاقَ الأسماء ، وهو أوغل من الصفات ، قال الغزالي : والعلوّ في الرتبة العقلية مثل العلوّ في التدريجات الحسية ، ومثال الدرجة العقلية ، كالتفاوت بين السبب والمسبب والعلة والمعلول والفاعل والقابل والكامل والناقص اه .وإيثار هذا الوصف في هذه السورة لأنها تضمنت التنويه بالقرآن والتثبيت على تلقيه وما تضمنه من التذكير وذلك لعلو شأنه فهو من متعلقات وصف العلوّ الإلهي إذ هو كلامه .وهذا الوصف هو ملاك القانون في تفسير صفات الله تعالى ومحاملها على ما يليق بوصف الأعلى فلذلك وجب تأويل المتشابهات من الصفات .وقد جُعل من قوله تعالى : { سبح اسم ربك الأعلى } دعاء السجود في الصلاة إذ ورد أن يقول الساجد : سبحان ربي الأعلى ، ليقرن أثر التنزيه الفعلي بأثر التنزيه القولي ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "سورة الأعلىمكية في قول الجمهور .وقال الضحاك : مدنية . وهي تسع عشرة آية .بسم الله الرحمن الرحيمسبح اسم ربك الأعلى يستحب للقارئ إذا قرأ سبح اسم ربك الأعلى أن يقول عقبه : سبحان ربي الأعلى ; قاله النبي - صلى الله عليه وسلم - وقاله جماعة من الصحابة والتابعين على ما يأتي .وروى جعفر بن محمد عن أبيه عن جده قال : \" إن لله تعالى ملكا يقال له حزقائيل ، له ثمانية عشر ألف جناح ، ما بين الجناح إلى الجناح مسيرة خمسمائة عام ، فخطر له خاطر هل تقدر أن تبصر العرش جميعه ؟ فزاده الله أجنحة مثلها ، فكان له ستة وثلاثون ألف جناح ، ما بين الجناح إلى الجناح خمسمائة عام . ثم أوحى الله إليه : أيها الملك ، أن طر ، فطار مقدار عشرين ألف سنة فلم يبلغ رأس قائمة من قوائم العرش . ثم ضاعف الله له في الأجنحة والقوة ، وأمره أن يطير ، فطار مقدار ثلاثين ألف سنة أخرى ، فلم يصل أيضا فأوحى الله إليه أيها الملك ، لو طرت إلى نفخ الصور مع أجنحتك وقوتك لم تبلغ ساق عرشي . فقال الملك : سبحان ربي الأعلى \" فأنزل الله تعالى : سبح اسم ربك الأعلى . فقال النبي - صلى الله عليه وسلم - : \" اجعلوها في سجودكم \" . ذكره الثعلبي في ( كتاب العرائس ) له . وقال ابن عباس والسدي : معنى سبح اسم ربك الأعلى أي عظم ربك الأعلى . والاسم صلة ، قصد بها تعظيم المسمى كما قال لبيد :إلى الحول ثم اسم السلام عليكما [ ومن يبك حولا كاملا فقد اعتذر ][ ص: 14 ] وقيل : نزه ربك عن السوء ، وعما يقول فيه الملحدون . وذكر الطبري أن المعنى نزه اسم ربك عن أن تسمي به أحدا سواه . وقيل : نزه تسمية ربك وذكرك إياه ، أن تذكره إلا وأنت خاشع معظم ، ولذكره محترم . وجعلوا الاسم بمعنى التسمية ، والأولى أن يكون الاسم هو المسمى .روى نافع عن ابن عمر قال : لا تقل علا اسم الله فإن اسم الله هو الأعلى . وروى أبو صالح عن ابن عباس : صل بأمر ربك الأعلى . قال : وهو أن تقول سبحان ربي الأعلى . وروي عن علي - رضي الله عنه - وابن عباس وابن عمرو وابن الزبير وأبي موسى وعبد الله بن مسعود - رضي الله عنهم - أنهم كانوا إذا افتتحوا قراءة هذه السورة قالوا : سبحان ربي الأعلى امتثالا لأمره في ابتدائها . فيختار الاقتداء بهم في قراءتهم لا أن سبحان ربي الأعلى من القرآن كما قاله بعض أهل الزيغ . وقيل : إنها في قراءة أبي : سبحان ربي الأعلى . وكان ابن عمر يقرؤها كذلك . وفي الحديث : كان رسول الله - صلى الله عليه وسلم - إذا قرأها قال : \" سبحان ربي الأعلى \" .قال أبو بكر الأنباري : حدثني محمد بن شهريار ، قال : حدثنا حسين بن الأسود ، قال : حدثنا عبد الرحمن بن أبي حماد قال : حدثنا عيسى بن عمر ، عن أبيه ، قال : قرأ علي بن أبي طالب - عليه السلام - في الصلاة سبح اسم ربك الأعلى ، ثم قال : سبحان ربي الأعلى فلما انقضت الصلاة قيل له : يا أمير المؤمنين ، أتزيد هذا في القرآن ؟ قال : ما هو ؟ قالوا : سبحان ربي الأعلى . قال : لا ، إنما أمرنا بشيء فقلته ، وعن عقبة بن عامر الجهني قال : لما نزلت سبح اسم ربك الأعلى قال رسول الله - صلى الله عليه وسلم - : \" اجعلوها في سجودكم \" . وهذا كله يدل على أن الاسم هو المسمى ; لأنهم لم يقولوا : سبحان اسم ربك الأعلى . وقيل : إن أول من قال سبحان ربي الأعلى ميكائيل - عليه السلام - . وقال النبي - صلى الله عليه وسلم - لجبريل : \" يا جبريل أخبرني بثواب من قال : سبحان ربي الأعلى في صلاته أو في غير صلاته \" . فقال : \" يا محمد ، ما من مؤمن ولا مؤمنة يقولها في سجوده أو في غير سجوده ، إلا كانت له في ميزانه أثقل من العرش والكرسي وجبال الدنيا ، ويقول الله تعالى : صدق عبدي ، أنا فوق كل شيء ، وليس فوقي شيء ، اشهدوا يا ملائكتي أني قد غفرت له ، وأدخلته الجنة فإذا مات زاره ميكائيل كل [ ص: 15 ] يوم ، فإذا كان يوم القيامة حمله على جناحه ، فأوقفه بين يدي الله تعالى ، فيقول : يا رب شفعني فيه ، فيقول قد شفعتك فيه ، فاذهب به إلى الجنة \" . وقال الحسن : سبح اسم ربك الأعلى أي صل لربك الأعلى . وقل : أي صل بأسماء الله ، لا كما يصلي المشركون بالمكاء والتصدية . وقيل : ارفع صوتك بذكر ربك . قال جرير :قبح الإله وجوه تغلب كلما سبح الحجيج وكبروا تكبيرا"
      },
      {
        "resource_id": 157,
        "text": "<p>سبح اسم ..................... احوی</p><p>سورت کا آغاز نہایت ہی نرم اور نہایت لمبے آہنگ سے ہوتا ہے ، اس لمبے ٹون کے ذریعہ فضا میں تسبیح کی خوشگوار اور خوشبودار آواز بکھیر دی گئی ہے۔ اس کے بعد پھر تسبیح کا حکم اور پھر وہ صفات جن کو تسبیح کے بعد لایا گیا ہے۔</p><p>سبح اسم……………. احوی (1:87 تا 5) ”(اے نبی ! ) اپنے رب برتر کے نام کی تسبیح کرو جس نے پیدا کیا اور تناسب قائم کیا ، جس نے تقدیر بنائی پھر راہ دکھائی ، جس نے نباتات اگائیں پھر ان کو سیاہ کوڑا کرکٹ بنادیا “۔ تاکہ اس تسبیح کے ذریعہ اس پوری کائنات کے اطراف واکناف میں تسبیح کی یہ آوازگونجاٹھے اور پوری کائنات ایک معبد نظر آئے اور ایک عبادت گاہ کے ساتھ ساتھ پوری کائنات صانع قدرت کی مصنوعات کی نمائش گاہ بھی بن جائے۔</p><p>الذی…………فھدی (3:87) ” جس نے پیدا کیا اور تناسب قائم کیا ، جس نے تقدیر بناکر اسے ہدایت بخشی “۔</p><p>تسبیح کے کیا معنی ہیں ۔ اللہ کی برتری ذہن میں بسانا ، اللہ کو ہر عیب سے پاک سمجھنا اور ذہن میں اللہ کی صفات حسنی کا استحضار اور ان چیزوں کی روشنی ، چمک اور نورانیت سے اپنے ذوق ووجدان اور قلب و شعور کو روشن رکھا ، نام ہے تسبیح کا۔ محض زبان سے سبحان اللہ جپنے کو تسبیح نہیں کہتے۔</p><p>سبح……………. الاعلیٰ (1:87) ” اپنے رب برتر کے نام کی تسبیح کرو “۔ یہ الفاظ انسانی وجدان اور شعور پر ایک حالت طاری کردیتے ہیں۔ یہ وجدانی حالت ایسی ہوتی ہے جس کا اظہار الفاظ کے اندر ممکن نہیں ہے۔ یہ تو ایک وجدانی اور ذوقی چیز ہے اور ایک ایسی زندگی کی طرف اشارہ کرتی ہے جس کا تعلق کچھ معانی اور کچھ صفات کے استحضار سے ہے نہ کہ کچھ الفاظ رٹنے سے۔</p><p>یہ معانی وصفات کیا ہیں ؟ پہلی صفت ، صفت ربوبیت ہے۔ اور دوسری صفت اعلیٰ ہے ۔ رب کے معنی مربی ، نگران اور پالنے والے کے ہیں۔ ان صفات کے سائے اور پرتو اس سورت کی فضا اور اس کے اندر بیان کی جانے والی خوشخبریوں کے ساتھ ہم آہنگ ہیں ، خصوصاً اس کے نرم انداز کے ساتھ۔ صفت اعلیٰ پردہ شعور پر ایسی تصاویر لاتی ہے جن سے علو ، برتری اور غیر متناہی اور غیر محدود وآفاق کا اظہار ہوتا ہے۔ انسانی روح دور تک تسبیحات کرتی ہے اور اس تصور علو سے تسبیح میں پاکی اور عظمت کے ساتھ مناسبت پیدا ہوتی ہے اور تسبیح اپنے بنیادی عناصر کے اعتبار سے تصور علو رب کا نام ہے۔</p><p>ابتدائی خطاب ظاہر ہے کہ رسول اللہ ﷺ کو ہے ، اور یہ براہ راست اللہ کی طرف سے آپ کو خطاب ہے۔ حضور اکرم ﷺ جب اس حکم ربی کو پڑھتے تھے۔</p><p>سبح ” پاکی بیان کرو “ تو اگلی آیات پڑھنے سے پہلے آپ اس حکم پر عمل کرلیتے اور آپ فرماتے :</p><p>سبحان ربی الاعلیٰ ” میں اپنے رب اعلیٰ کی پاکی بیان کرتا ہوں “۔ یوں حکم اور جواب حکم یا تعمیل حکم ہوجاتا ۔ امر کی اطاعت ہوجاتی اور اللہ کے ساتھ مناجات اور سوال و جواب ہوجاتا۔ کیونکہ حضور رب کے سامنے کھڑے ہوتے۔ براہ راست یہ کلام رب تعالیٰ سے لے رہے ہوتے تھے اور اس اتصال اور قرب کی حالت میں جواب دے دیتے۔ جب یہ آیات نازل ہوئیں تو حضور اکرم ﷺ نے صحابہ کرام ؓ کو حکم دیا کہ یہ تسبیح سجدے میں پڑھا کرو۔</p><p>(اجعلوانی سجودکم) اور اس سے قبل جب یہ آیت نازل ہوئی تھی۔</p><p>فسبح……………. العظیم ” اپنے رب عظیم کے نام کا تسبیح کرو “۔ تو آپ نے حکم دیا کہ اس کو رکوع میں پڑھو چناچہ رکوع میں سبحان ربی العظیم پڑھنا شروع کیا گیا۔ پس رکوع و سجود کی یہ تسبیح ایک زندہ تسبیح ہے ، محض مردہ کلمات نہیں ، جس طرح ایک زندہ چیز کا جسم حیات اور زندگی سے گرم ہوتا ہے ایسی ہی تسبیح نماز میں مطلوب ہے تاکہ اس تسبیح سے براہ راست حکم خداوندی کی تعمیل ہوجائے یا بالفاظ دیگر اجازت خداوندی کی تعمیل ہو ، کیونکہ اللہ کا اپنے بندوں کو یہ اجازت دینا کہ اس کی حمدوثنا کرو ، یہ بھی اللہ کا فضل وکرم ہے۔ کیونکہ اس طرح انسان کو یہ اجازت ملتی ہے کہ وہ اپنے حد تصور کے مطابق اللہ کے قریب ہوجائے۔ کیونکہ انسان اللہ کی ثنا اللہ کی ذات وصفات میں اپنے محدود تصور کے مطابق ہی کرسکتا ہے۔ اور یہ اللہ کے فضل وکرم کی ایک شکل ہے کہ اللہ اپنی ذات کی معرفت اپنے بندوں کو اپنی صفات کے ذریعہ کرواتا ہے۔ ایسی حدود میں کہ جن کے اندر وہ اللہ کی معرفت کا تصور کرسکتے ہیں۔ اللہ اپنی ذات تک پہنچنے کے لئے اپنے بندوں کو جس شکل و صورت میں بھی اجازت دیتا ہے ، یہ ان پر فضل وکرم کی ایک صورت ہوتی ہے۔</p><p>سبح اسم……………. فھدی (1:87 تا 3) ” اپنے رب برتر کے نام کی تسبیح کرو ، جس نے پیدا کیا ، اور تناسب قائم کیا ، جس نے تقدیر بنائی ، پھر راہ دکھائی “۔ یعنی ہر چیز کو پیدا کیا اور نہایت مناسب شکل میں پیدا کیا اور اس تخلیق کے ہر پہلو کو کامل بنایا۔ اس حد تک کامل کہ کوئی اس میں یہ نہیں کہہ سکتا کہ اس کی فلاں چیز اس کے لئے مناسب نہیں ہے۔ اللہ نے تقدیریوں بنائی کہ ہر چیز کے لئے اس کا فرض منصبی مقرر کردیا اور اس کا مقصد تخلیق اور اس مقصد کو پورا کرنے کا طریقہ بھی اسے سمجھا دیا۔ ہر چیز کو عجیب الہامی انداز میں یہ تعلیم دی گئی۔ ہر چیز کو یہ شعور بھی بذریعہ الہام دے دیا کہ اس کی مقررہ زندگی کے لئے اس کو کس چیز کی ضرورت ہے۔</p><p>یہ ایک عظیم حقیقت ہے اور اس کائنات کی جس چیز کا تجزیہ کیا جائے اس کے اندر یہ حقیقت موجود ہے۔ اس وسیع و عریض کائنات کی ہر چیز میں ، خواہ بڑی ہو یا چھوٹی ہو ، اہم ہو یا حقیر ہو ، ہر چیز کی تخلیق میں تسویہ اور تناسب موجود ہے۔ ہر چیز کامل الخلقت ہے اور ہر چیز کی تخلیق کا ایک مقصد ہے اور وہ مقصد اس کی تقدیر ہے ، اور ہر چیز کو اللہ نے اپنا مقصد وجودپورا کرنے کے لئے نہایت ہی آسان طریقہ کار فراہم کردیا ہے۔ غرض اللہ کی ہر مخلوق مکمل اور متناسب ہے۔ اور ہر چیز اپنا انفرادی فریضہ ادا کرتی ہے۔</p><p>مثلاً ایٹم ایک اکیلا ایٹم ، پر ٹون اور الیکٹرون کی برقی رفتار کے اندر اسی قدر توازن رکھتا ہے جس طرح ایک کہکشاں اپنے سورج اور اس کے تابع ستاروں کے درمیان توازن رکھتی ہے۔ ایک ایٹم اپنے مقصد اور فریضے کو اسی طرح پورا کرتا ہے جس طرح ایک کہکشاں پورا کرتی ہے۔ دونوں کو انپا مقصد اور طریقہ حصول مقصد معلوم ہوتا ہے۔</p><p>ایک منفرد خلیہ ایک مکمل تخلیق ہے۔ اور اس کے اندر اپنا مقصد تخلیق پورا کرنے کی پوری استعداد ہوتی ہے اور وہ اپنا مقصد اسی طرح پورا کرتا ہے جس طرح کوئی اعلیٰ مرکب اور پیچیدہ مخلوق کرتی ہے۔</p><p>پھر ایک منفرد ایٹم اور کسی کہکشاں کے درمیانی درجات پر الگ الگ مخلوق ہے۔ جس طرح ایک منفرد خلیہ اور پیچیدہ ترین مخلوقات کے درمیان زندہ مخلوقات کے مختلف درجے اور ان کی تنظیم ہے۔ اور ہر درجے اور ہر تنظیم کی تخلیق میں کمال اور تسویہ ہے اور ہر ایک کے لئے انفرادی فرائض اور اجتماعی مقاصد ہیں۔ دست قدرت الہامی طریقے سے ان سے یہ کام کراتا ہے اور اس گہری حقیقت یعنی تخلیق وتسویہ کا یہ کام پوری کائنات پر شاہد عادل ہے۔</p><p>اس حقیقت کو انسانی قلب پاسکتا ہے بشرطیکہ وہ اس کائنات کے اشارات اخذ کرنے کے لئے تیار ہو اور کھلے دل سے وہ اس کائنات کی موجودات پر غور کرے۔ انسان کا اکتسابی علم جس درجے کا بھی ہو اور وہ ترقی یافتہ معاشرے کافرد ہو یا پسماندہ معاشرے کا فرد ہو وہ کائنات کی ان اشیاء سے یہ الہامی اشارات اخذ کرسکتا ہے بشرطیکہ اس کے دل و دماغ کے دریچے بھی ان اشارات کو پانے کے لئے تیار ہوں اور کھلے ہوں اور کسی عقل وخرد کے تار اس قابل ہوں کہ وہ مضراب حقیقت کے جواب میں نغمہ بار ہوسکیں۔</p><p>اس کے بعد کائنات کا مشاہدہ اور کسی علم آتے ہیں اور انسان مطالعہ فطرت میں پہلی نظر سے جو الہام پاتا ہے ، تمام مشاہدات اس کی تائید کرتے ہیں ، بعض لوگوں نے مشاہدہ کائنات کے ذریعہ ایسے اشارات جمع کیے ہیں جو اس کائنات کے اندر پوشیدہ مجموعی حقیقت کے چہرے سے پردہ اٹھاتے ہیں۔</p><p>نیویارک کی سائنسی علوم کی اکیڈمی کے صدر کریسی موریسن اپنی کتاب ” انسان اکیلا نہیں کھڑا “ میں اپنے مشاہدات یوں قلم بند کرتے ہیں۔</p><p>” پرندوں میں وطن لوٹنے کا ایک ملکہ ہوتا ہے ، ایک خاص چڑیا جو دروازوں پر گھونسلے بناتی ہے ، خزاں کے موسم میں جنوب کی طرف ہجرت کرجاتی ہے اور اگلے سال بہار میں اپنے اسی مقام کی طرف لوٹ آتی ہے۔ ستمبر کے مہینے میں امریکہ کے اکثر پرندے جنوب کی طرف جاتے ہیں اور وہ سمندروں اور صحراﺅں پر سے پرواز کرتے ہوئے ہزاروں میل سفر کرتے ہیں اور کبھی اپنا راستہ نہیں بھولتے۔ اور پیغام رساں کبوتر پنجرے میں طویل سفر کرتے ہیں اور جب ان کو پیغام کر چھوڑا جاتا ہے تو وہ کچھ دیر کے لئے حیران ہوکر چکر لگاتے ہیں اور اس کے بعد وہ سیدھے اپنے وطن کی طرف پرواز کرتے ہیں اور کبھی راہ نہیں بھٹکتے ۔ شہد کی مکھی اگر کسی طرف جائے اور اس کے پیچھے نشانات راہ کسی طوفان کی وجہ سے مٹ جائیں تو بھی وہ راہ نہیں بھولتی اور سیدھی چھتے پر آجاتی ہے۔ البتہ انسان کے اندر یہ جبلت کمزور ہے اور انسان اس کمی کو اپنے آلات اور عقل کے ذریعہ پوری کردیتا ہے۔ باریک کیڑے مکوڑے بھی نہایت ہی چھوٹی اور خوردبینی آنکھیں رکھتے ہیں اور یہ نہایت ہی مکمل آنکھیں ہوتی ہیں۔ باز اور عقاب وغیرہ کی آنکھیں دور بین کی طرح ہوتی ہیں ، انسانی آنکھ ان کا مقابلہ نہیں کرسکتی۔ اس کمی کو بھی انسانی عقل و تجربہ نے پورا کیا ہے۔ چناچہ ان دوربینوں کے ذریعہ انسانسحابیوں کو دیکھ لیتا ہے اور اس نے ان کو دیکھنے کے لئے انسانی نظر کو بیس لاکھ گنا تیز کیا۔ نیز انسان نے ایسی خورد بینیں ایجاد کیں جن کے ذریعے وہ بیکٹریا اور دوسرے نہ نظر آنے والے کیڑے مکوڑے دیکھتا ہے۔</p><p>اب ذرا تم اپنے بوڑھے گھوڑے کو راستہ پر چھوڑدو۔ جس قدر اندھیرا بھی ہو وہ راستہ نہ بھولے گا۔ وہ سخت تاریکی میں بھی دیکھ سکتا ہے اگرچہ بہت واضح نہ سہی۔ وہ راستہ میں اور اس کے دونوں جانب درجہ حرارت کو بھی دیکھ سکتا ہے۔ یہ درجہ حرارت اس کی آنکھیں انفراریڈ شعاعوں کے ذریعہ معلوم کرلیتی ہیں۔ الو ایک گرم چوہے کو سردگھاس کے نیچے چلتا پھرتا دیکھ لیتا ہے اگرچہ سخت اندھیرا ہو اور انسانوں نے تو بجلی کے قمقموں کے ذریعہ تاریک رات کو دن بنادیا ہے “۔</p><p>” شہد کی مکھیوں کی دنیا بھی عجیب ہے۔ کارکن مکھیاں چھتے میں مختلف قسم کے کمرے بناتی ہیں۔ یہ تربیت کے لئے استعمال ہوتے ہیں۔ چھوٹے کمرے کارکنوں کے لئے استعمال ہوتے ہیں اور بڑے کمرے مردوں کے لئے اور ملکہ کے لئے خاص کمرے تیار ہوتے ہیں۔ یہ ملکہ مجھی جب غیر بار آورانڈہ دیتی ہے تو اسے مردوں کے کمرے میں رکھ دیتی ہے اور جب بار آور انڈہ دیتی ہے تو اسے اس کمرے میں رکھ دیتی ہے جس میں مونث کارکن مکھیاں ہوتی ہیں جو آگے جاکر ملکہ مکھی بننے والی ہوتی ہیں اور وہ کارکن مکھیاں جو مزدور ہوتی ہیں جب وہ ایک طویل عرصہ تک نسل تیار کرنے کا کام کرلیتی ہی تو ان کو بدل دیا جاتا ہے۔ یہ کارکن مکھیاں بچوں کے لئے غذا تیار کرنے کا کام بھی کرتی ہیں۔ یہ شہد اور پھولوں کو چبا کر ہضم کے قابل بناتی ہیں اور بچوں کے اندر نر اور مادے کا ظہور ہوجاتا ہے تو پھر یہ مذکورہ بالا طریقے سے غذاہضم کے لئے تیار کرنے کا عمل ترک کردیتی ہیں۔ اس کے بعد ان کو شہد اور پھولوں کا بور دیا جاتا ہے اور بچوں میں سے جو مونث اس طریقے سے تربیت پاتی ہیں وہ بعد میں کارکن مکھیاں بن جاتی ہیں “۔</p><p>جو مونث مکھیاں ملکہ مکھیوں کے حجروں میں ہوتی ہیں ، تو ان کو شہد اور پھولوں کے بورے کو ابتدائی طور پر قابل ہضم بناکر غذا دینے کا سلسلہ جاری رکھا جاتا ہے ، اور جن مونث مکھیوں سے ایسا سلوک کیا جاتا ہے بعد میں وہ ملکہ مکھن بن جاتی ہیں۔ صرف یہ ملکہ ہی ایسے انڈے دیتی ہیں جو پار آور ہوتے ہیں۔ اس ٹیکنالوجی کے مطابق جو بچے پیدا ہوتے ہیں ان کے لئے خاص قسم کے حجروں ، ایک خاص قسم کے انڈوں اور ایک خاص قسم کی غذا کی ضرورت ہوتی ہے۔ اور غذا کے اندر تبدیلی کا اثر بھی عجیب ہوتا ہے۔ اس قسم ٹیکنالوجی کے لئے مکھیوں کو ایک طویل عرصہ تک انتظار کی ضرورت پڑی ہوگی جنہوں نے ان اصولوں کے اندرتمیز کرکے ان کو نافذ کیا ہوگا اور غذا کے اثرات معلوم کیے ہوں گے۔ اور ان اثرات معلوم کیے ہوں گے۔ اور ان اثرات کو اجتماعی طور پر نافذ کیا ہوگا جو ان کے وجود کے لئے ضروری ہوگا۔ مکھیوں نے جب اجتماعی زندگی کا آغاز کیا ہوگا تب ان کو یہ اصول معلوم ہوئے ہیں گے ، کیونکہ مکھی کے وجود اور زندگی کی بقا کے لئے ان اصولوں کی دریافت ضروری نہ تھی۔ لہٰذا معلوم ہوتا ہے کہ شہد کی مکھی نے غذا کے اثرات کے سلسلے میں انسان سے زیادہ تحقیق کی ہے “۔ (مغربی فکر میں ڈوبا ہوا مصنف یہ ماننے کے لئے تیار نہیں ہے کہ اللہ نے جب مکھی کو پیدا کیا تو یہ سب کچھ سکھا دیا۔ ان کے دماغوں پر ڈارون کا فلسفہ ارتقاء ہی بیٹھا ہوا ہے حالانکہ قرآن صاف کہتا ہے وعلم آدم الاسماء کلھا ” اللہ نے آدم کو تمام نام سکھادیئے “ اسی طرح اللہ نے مکھی کو بھی تمام بنیادی تعلیم دے دی تھی (مترجم) ۔</p><p>” کتے کو ایک اضافی ناک دی گئی ہے جس کے ذریعہ وہ تمام جانوروں کی بوسونگھ لیتا ہے جو کسی راستے سے گزرے ہوں ، انسان کی قوت شامہ کتوں کے مقابلے میں کمزور ہے اور آج تک انسان نے کوئی ایسا آلہ بھی ایجاد نہیں کیا جو اس کی قوت شامہ کو ترقی دے ، لیکن ہماری یہ کمزور قوت شامہ بھی اس قدر چھوٹے ذرات کو محسوس کرلیتی ہے جیسے مائیکروسکوپ کے ذریعہ ہی دیکھا جاسکتا ہے۔</p><p>اکثر حیوانات ایسی آوازیں سن لیتے ہیں جو ہمارے کانوں کے پردوں کے اندر ارتعاش پیدا نہیں کرسکتے ، کیونکہ یہ ہماری سماعت کی حد سے بہت ہی دقیق اور باریک ہوتے ہیں۔ انسان نے ایسے آلات ایجاد کرلیے ہیں کہ وہ کئی میل دور اڑنے والی مکھی کے پروں کی آواز بھی سن لے ، اس طرح کہ گویا وہ اس کے کان کے پردے کے اوپر بیٹھی ہے۔ ایسے ہی آلات کے ذریعہ سورج کی شعاعوں کی رفتار کی آواز بھی ریکارڈ کی جارہی ہے “۔</p><p>” پانی کی مکڑیوں کی ایک قسم ایسی ہے جو پانی کے اندر غبارے کی طرح ایک گھونسلہ تیار کرتی ہے ، یہ تار عنکبوت سے بنایا جاتا ہے اور اسے پانی کے نیچے کسی چیز سے باندھ دیا جاتا ہے۔ اس کے بعدیہ مکڑی اپنے جسم کے بالوں کے ساتھ پانی کا ایک بلبلہ باندھتی ہے اور اسے لے جاکر اس گھونسلے سے باندھ دیتی ہے یہاں تک کہ گھونسلے کے گرد ہوا کے بلبلوں کا حصار بن جاتا ہے ، اس کے بعد وہ گھونسلے کے اندر بچے دیتی ہے کہ وہ ہوا کے طوفان سے محفوظ رہیں۔ اس گھونسلے کی ساخت میں ایک تو باریک بننے کا عمل ہے ، اس کے بعد دقیق انجینئرنگ اور ہوا بازی کا گہرا ادراک ہے “۔</p><p>” سالمن مچھلی ، جو چھوٹی سی ہوتی ہے اور سمندر میں کئی سال تک گھومتی پھرتی ہے ، اس کے بعد وہ اس دریا کی طرف واپس ہوتی ہے جہاں اس کی پیدائش ہوئی تھی۔ آخر وہ کیا قوت ہے جو اسے اس کی جائے پیدائش تک رہنمائی کرتی ہے۔ یہ جب اپنی جائے پیدائش کی طرف بڑھتے ہوئے کسی غلط دریا کی طرف چلی جائے تو اسے فوراً معلوم ہوجاتا ہے کہ یہ دریا اس کی جائے پیدائش نہیں ہے۔ چناچہ وہ دریا میں چلتی ہے اور پانی کے بہاﺅ کے بالمقابل چل کر اپنی منزل تک پہنچ جاتی ہے۔</p><p>پانی کے سانپوں کا معاملہ تو بہت ہی عجیب ہے۔ ان کا قصہ سالمن مچھلی کے برعکس ہے۔ اس مخلوق خدا کی عمر جب پوری ہوتی ہے تو یہ مختلف تالابوں اور دریاﺅں سے سفر کرکے گہرے سمندروں کی طرف جاتے ہیں۔ اگر یورپ میں ہوں تو یہ ہزاروں میل کا سفر طے کرکے جنوبی برمودا کی گہرائیوں کی طرف چلے جاتے ہیں۔ وہاں پھر یہ انڈے دے کر مرجاتے ہیں ، اب ان کے جو بچے پیدا ہوجاتے ہیں تو وہ تو صرف یہ جانتے ہیں کہ وہ نہایت گہرے پانیوں میں ہیں ، لیکن یہ بچے اسی راستے سے ساحل کی طرف جاتے ہیں جس طرح ان کی ماں ساحل سے پانی کی طرف آئی تھی اور ساحل سے پھر یہ کسی دریا ، یا نہر یا حوض اور تالاب کی طرف چلے جاتے ہیں۔ چناچہ پانیوں کی ہر قسم بحری سانپوں کے لئے موزوں ہوتی ہے۔ کیونکہ انہوں نے بڑی بڑی موجیں ، طوفان اور سمندری تلاطم دیکھے ہوئے ہیں اور ان کا مقابلہ کیا ہوا ہوتا ہے ۔ یہ ساحلوں پر چلتے ہیں اور جب یہ مکمل ہوجاتے ہیں تو کوئی خفیہ قانون ان کو مجبور کرتا ہے کہ وہ پھر واپسی کا سفر کریں اور گہرے سمندروں میں چلے جائیں۔ سوال یہ ہے کہ یہ جذبہ ان کے اندر کہاں سے پیدا ہوتا ہے۔ کبھی ایسا نہیں ہوا کہ کسی شکاری یا مچھیرے نے یورپی سمندروں میں امریکی بحری سانپ پکڑا ہو ، یا کسی امریکی مچھیرے کے جال میں یورپی سانپ آگیا ہو ، یورپی بحری سانپ کو چونکہ گہرے سرندروں تک لمبا سفر کرنا پڑتا ہے اسی لئے قدرت نے اسے ایک سال کی لمبی عمر عطا کی۔ یا اس سے بھی زیادہ تاکہ وہ مرنے سے قبل اپنی منزل مقصود کو پہنچ سکے۔ کیونکہ یورپی بحری سانپ کو امریکی بحری سانپ سے زیادہ فاصلہ طے کرنا پڑتا ہے۔ ذرا دیکھو تو سہی کہ کون سے ایٹم اور کیا سالمے ہیں ؟ جب بحری سانپ مچھلیوں کی شکل میں جمع ہوئے تو ان کے اندر اس قسم کی قوت ارادی پیدا ہوجاتی ہے جو ایسے دور دراز سفر کراتی ہے ؟</p><p>” جب مادہ پروانہ ہوا کے دباﺅ میں تمہارے کسی روشن دان سے اندر آجاتا ہے تو وہ اپنے نر کو ایک سگنل بھیجتی ہے ، چاہے وہ جتنا بھی دور ہو۔ بعض اوقات وہ بہت دور ہوتا ہے۔ وہ اس اشارے کو وصول کرلیتا ہے اور اس کا جواب دیتا ہے۔ اس کو گمراہ کرنے کی انسان جس قدر کوشش بھی کرے ممکن نہیں ہوتا کہ وہ غلطی کرے۔ کیا ان کے پاس کوئی ریڈیو اسٹیشن ہے یا اس مرد کے پاس کوئی ریڈیو یا مشین ہے جو اس سے سگنل وصول کرتا ہے۔ ایریل کا ہونا تو بڑی بات ہے کیا اس کے پاس کوئی ایتھر ہے جس کے ذریعہ وہ ارتعاش پیدا کرتی ہے۔ ٹیلی فون اور ریڈیو ہمارے پاس سریع الحرکت مواصلاتی آلات ہیں لیکن یہ تاروں کے ذریعے ایک جگہ کو دوسری جگہ سے منسلک کرتے ہیں۔ اس طرح تو یہ پروانہ ہم پر فوقیت رکھتا ہے “۔</p><p>نباتات اپنے وجود کو برقرار رکھنے کے لئے کئی چیزوں سے خدمت لیتے ہیں ، بغیر ان کے علم و ارادہ کے۔ مثلاً حشرات پھولوں کا بورا ان کے لئے منتقل کرتے ہی ، ہوا یہی کام کرتی ہے ، وحوش وطیور بھی یہی کام کرتے اور ان کا بورا اور بیج بکھیرتے ہیں۔ سب سے آخر میں ان نباتات نے انسان کو بھی اپنے جال میں پھانس لیا۔ اس نے فطرت کو حسن بخشا اور فطرت نے اسے اس کا اجردیا۔ لیکن انسان بھی تو کسی حد پر رکنے والا نہیں۔</p><p>ھل من مزید کا قائل ہے۔ اس نے ہل چلایا ، بیج بویا ، فصل کاٹی ، انبار بھرے ، پھر اس نے فصلوں کو ترقی دی ، شاخ تراشی کی اور خوراک کا بندوبست کیا۔ اگر وہ یہ کام چھوڑ دے تو بھوک سے مرجائے اور دنیا سے تہذیب و تمدن کا خاتمہ ہوجائے اور انسانیت پتھر کے دور میں واپس چلی جائے۔ “</p><p>پانی کے بیشمار جانور مثلاً جھینگا مچھلی کا ایک بازو اگر کٹ جائے تو اسے معلوم ہوجاتا ہے کہ اس کے جسم کا ایک حصہ ضائع ہوگیا ہے ، اس کے خلیے اور جینز اس عضو کو دوبارہ بنانا شروع کردیتے ہیں اور جب وہ عضو مکمل ہوجاتا ہے تو خلیے یہ کام بند کردیتے ہیں اور ان کو معلوم ہوجاتا ہے کہ ان کی ڈیوٹی ختم ہے۔</p><p>پانی کے وہ کیڑے جن کے کئی پاﺅں ہوتے ہیں ، جب دوٹکڑے ہوجائے تو وہ ان میں سے ایک ٹکڑے کی مدد سے اپنے آپ کو مکمل کرلیتا ہے۔ اگر تم اس کیڑے کا سرکاٹ دو تو وہ دوسرا سر بنالیتا ہے۔</p><p>ہم زخموں کو مندمل کرسکتے ہیں لیکن ہمارے سرجن ابھی تک یہ بات نہیں جانتے کہ وہ خلیوں کو متحرک کریں اور وہ ایک نیا بازو بنا ڈالیں یا گوشت پوشت ، ناخن اور اعصاب بنادیں ، اگر ایسا ممکن ہو۔</p><p>اور ایک عجوبہ تو یہ ہے کہ اگر کوئی خلیہ ابتدائی ایام ہی میں دو مکمل حصوں میں تقسیم ہوجائے تو اس سے دو مکمل حیوان تیارہوجاتے ہیں۔ ہم دیکھتے ہیں کہ توام ہم شکل ہوتے ہیں ، اس کی تشریح اس طرح کی جاسکتی ہے کہ حمل کے ابتدائی مرحلہ میں خلیہ منقسم ہوگیا اور اس سے یہ بھی معلوم ہوتا ہے کہ ابتدائی مرحلے میں خلیہ کمل فرد ہوتا ہے۔ اور اسی طرح ایک فرد بھی ہر خلیہ میں ہوتا ہے۔</p><p>ایک دوسری فصل میں یہی مصنف لکھتا ہے :</p><p>شاہ بلوط کا بھورا بیج زمین پر گراتا ہے ، اس کا بھورا چھلکا اسے محفوظ رکھتا ہے ، اور یہ گرتا پڑتا زمین میں کسی دراڑ میں اٹک جاتا ہے۔ موسم بہاں میں اس کے اندر کا جرثومہ جاگتا ہے۔ وہ اس چھلکے کو پھاڑ دیتا ہے اور یہ اس مغز سے خوراک حاصل کرتا ہے جو اس چھلکے کے اندر جمع کردی گئی ہوتی ہے۔ جس کے اندر اس کے موروثی جینز ہوتے ہیں۔ اس کی جڑیں زمین میں جاتی ہیں۔ آپ دیکھتے ہیں کہ یہ پودا نمودار ہوتا ہے ، چھوٹا درخت اور پھر کامل درخت بن جاتا ہے۔ اس کے اندر کئی ملین جینز ہوتے ہیں۔ یہاں تک کہ یہ اپنی جڑوں ، چھلکے ، پھل اور تنوں اور شاخوں میں بھی اس درخت کے مماثل ہوتا ہے جس سے وہ بیج نکلا۔ کروڑوں سال پہلے جو بلوط کا درخت پیدا ہوا تھا ، اس کے پھل آج تک اپنے ذرات کی ترتیب اس طرح رکھتے ہیں جس طرح پہلے بلوط کے پھل نے رکھا تھا۔</p><p>یہی مصنف تیسری فصل میں لکھتا ہے : ” ہر خلیہ جو کسی زندہ مخلوق میں پیدا ہوتا ہے ، اس پر لازم ہے کہ وہ اپنے آپ کو اس طرح ڈھالے کہ گوشت کا حصہ ہو یا چمڑے کا حصہ ہو اور فنا ہوجائے ، یا دانت کی چمک بن جائے یا آنکھ کا سیال مادہ بن جائے یا ناک اور کان بن جائے۔ ہر خلیہ اپنے آپ کو ایسی شکل میں ڈھالتا ہے کہ وہ اپنا فرض منصبی پوری طرح ادا کرے۔ یہ بات نہایت ہی مشکل ہے کہ کوئی تعین کرے کہ کون سا خلیہ دائیں ہاتھ ہے یا بائیں ہاتھ کا۔ لیکن ازروئے فطرت یہ بات متعین ہے کہ یہ خلیہ دائیں کان کا ہے اور یہ بائیں کان کا ہے۔ غرض ہزار ہا خلیات چلائے جاتے ہیں کہ وہ ایک صحیح کام کریں ، صحیح وقت پر کریں اور صحیح جگہ پر کریں “۔</p><p>چوتھی فصل میں یہ شخص کہتا ہے : ” مختلف قسم کی مخلوقات میں بعض مخلوقات ایسے کام کرتی ہیں جو دانش مندی کے اعلیٰ مرتبہ کے ہیں۔ جن کی کوئی تشریح ہم نہیں کرسکتے۔ مثلاً بھڑ ، ٹڈے کو شکار کرتی ہے ، زمین میں ایک گڑھا کھودتی ہے اور ایک مناسب جگہ اسے دفن کردیتی ہے۔ یہ شکار کرتے وقت اس کے ایسے مخصوص مقام پر ڈنگ مارتی ہے کہ وہ بےہوش ہوجاتا ہے لیکن اس کا گوشت صحیح وسالم زندہ رہتا ہے۔ اب مادہ بھڑ اس کے قریب ایک متعین مقام پر انڈے دیتی ہے۔ اسے شاید یہ بھی معلوم نہ ہو کہ جب اس کے بچے پیدا ہوں گے تو اس ٹڈے کا گوشت کھائیں گے۔ لیکن اسے قتل نہ کریں گے کیونکہ یہ گوشت ان کی غذا ہے اور گوشت خراب ہوکر زہریلا بن جائے ۔ لازماً بھڑ نے ابتدا سے یہ کام شروع کیا ہوگا اور ہمیشہ وہ اسے دہراتی ہوگی ورنہ دنیا میں سے بھڑوں کا وجود ہی ختم ہوجاتا۔ سائنس کے پاس ایسی کوئی تشریح نہیں ہے کہ وہ بھڑوں کے اس مسلسل فعل کا سبب بیان کرے اور یہ بھی ممکن نہیں ہے کہ یہ کام بھڑیں محض اتفاق سے کرتی ہیں ، کیونکہ مادہ بھڑ تو زمین کے اندر کھودے ہوئے گڑھے کو بھر کر چلی جاتی ہے اور مرجاتی ہے ، نہ وہ اس کے اسلاف یہ جانتے تھے کہ وہ ایسا کیوں کررہی ہے۔ نہ اسے اس کا علم اور مشاہدہ ہوتا ہے کہ اس کے بعد اس کے بچوں کو کیا پیش آنا ہے بلکہ بھڑ کو تو یہ علم بھی نہیں ہوتا کہ اس کے بعد کوئی چیز آنے والی ایسی ہے جسے وہ اپنا بچہ کہتی ہو ، بلکہ اسے یہ تک علم نہیں ہے کہ وہ یہ کام نوع کی حفاظت کے لئے کرتی ہے۔</p><p>چیونٹیوں میں سے بعض کی یہ ڈیوٹی ہوتی ہے کہ وہ سردیوں کے موسم میں اپنی کالونی کو خوراک مہیا کرنے کے لئے حیوانات جمع کریں۔ پھر وہ ایک سٹور قائم کرتی ہیں جہاں یہ خوراک پیس کر رکھی جاتی ہے۔ پھر بعض چیونٹیاں ایسی ہوتی ہیں جن کو قدرت نے پیسنے کی جبڑے دیئے ہوتے ہیں۔ ان کا کام صرف خوراک کو پیسنا ہوتا ہے۔ جب سردیوں کا موسم آتا ہے اور تمام غلہ پیسا جاچکا ہوتا ہے تو اس کی سپلائی یوں ہوتی ہے کہ زیادہ سے زیادہ تعداد کو فائدہ پہنچایا جاسکے تاکہ سپلائی جاری رہ سکے۔ اب چونکہ اگلی نسل میں مزید پیسنے والی چیونٹیاں پیدا ہوں گی۔ اس لئے چیونٹیوں کی فوج ان پیسنے والیوں پر حملہ آور ہوتی ہے اور ان کو قتل کردیتی ہے۔ شاید ان کا ضمیر مطمئن ہوتا ہے کہ انہوں نے اپنے حصے کی خوراک پیسنے کے دوران کھالی ہے کیونکہ انہوں نے اس موپعہ سے ضرور فائدہ اٹھایا ہوگا۔</p><p>بعض چیونٹیاں ایسی ہوتی ہیں کہ ان کی جبلت یا ان کی عقل ان کو کھانوں کے باغ بنانے پر آمادہ کرتی ہیں اور یہ چیونٹیاں ابتدائی کیڑوں کو اور پودوں کے چھلکوں پر پائے جانے والے کیڑوں کو گرفتار کرلیتی ہیں۔ یہ گویا ان کے لئے گائے اور بکریوں کا کام دیتے ہیں۔ ان کیڑوں سے یہ چیونٹیاں ایسا محلول لیتی ہیں جو شہد کی طرح ہوتا ہے اور یہ چیونٹیوں کی خوراک کا کام دیتا ہے۔</p><p>چیونٹیاں بعض دوسری چیونٹیوں کو غلام بھی بنالیتی ہیں ، اور جب یہ اپنے گھونسلے بناتی ہیں تو یہ پتوں کو مناسب حجم میں کاٹتی ہیں۔ جب کارکن چیونٹیاں ان پتوں کو ایک طرف سے پکڑ کر اپنے مقام پر رکھتی ہیں تو اس وقت یہ ان بچوں سے بھی کام لیتی ہیں جو ابھی ارتفائی دور میں ہوتے ہیں لیکن ان کے ریشمی مواد سے یہ پتوں کو جوڑتی ہیں ، یوں یہ بچہ اپنے لئے گھونسلا بنانے سے محروم رہتا ہے لیکن اپنے بنی نوع کے لئے ایک مفید کام کرچکا ہوتا ہے۔ سوال یہ ہے کہ جس ذروں سے چیونٹی بنتی ہے ان ذروں میں یہ کام کرنے کی صلاحیت کس طرح پیدا ہوجاتی ہے۔ اس میں شک نہیں ہے کہ ان کا ایک خالق ہے جس نے ان کو اس طرح کرنے کی ہدایت کی “۔ (اقتباسات ختم ہوئے)</p><p>اس میں شک نہیں ہے کہ ایک خالق ہے جس نے اپنی تمام مخلوقات کو ہدایات دیں ، خواہ وہ بڑی مخلوق ہو یا چھوٹی ہو ، اور یہ وہی خالق ہے جو الاعلیٰ…………فھدی (1:87 تا 3) ” جو برتر ہے ، جس نے پیدا کیا اور تناسب قائم کیا ، جس نے تقدیر بنائی پھر راہ دکھائی “۔</p><p>ہم نے اوپر جو اقتباسات دیئے ہیں ، یہ تو اصل حقیقت کے ایک معمولی حصے کے مشاہدات ہیں ، جو انسانوں نے نباتات ، حشرات الارض ، پرندوں اور دوسرے حیوانات کے سلسلے میں ریکارڈ کیے ہیں۔ لیکن اس سے آگے علم ومشاہدہ اور بھی جہاں ہیں اور جو کچھ ہمارے علم میں ہے وہ اس قول باری کے مدلول اور مفہوم کا ایک نہایت ہی مختصر حصہ ہے۔</p><p>الذی خلق…………فھدی (2:87 تا 3) ” جس نے پیدا کیا اور تناسب قائم کیا ، جس نے تقدیر بنائی پھر راہ دکھائی “۔ یہ قابل مشاہدہ کائنات جس کے ایک معمولی حصے کو ہم جانتے ہیں ، اس سے آگے عالم غیب کے جہاں پوشیدہ ہیں۔ ہمیں تو اپنی بشری قوتوں کے مطابق بہت تھوڑا علم دیا گیا ہے۔ یہ چند اشارات ہیں جو اللہ نے ہماری محدود قوت ادراک کے لئے کردیئے ہیں۔</p><p>اس عظیم کائنات کا ایک وسیع صفحہ پیش کرنے اور اس کی وادیوں میں اللہ کی تسبیح وثنا کی گونج پیدا کرنے کے بعد ، اللہ کی اس عظیم تسبیح کو مکمل کرنے کے لئے یہاں نباتات کی دنیا کی طرف اشارہ کردیا جاتا ہے اور یہاں اس اشارے کے اندر جہان معانی ہے۔</p><p>والذی اخرج…………احوی (5:87) ” جس نے نباتات اگائیں اور پھر ان کو سیاہ کوڑا کرکٹ بنادیا “ المرعی ، ہر اس چیزکو کہا جاتا ہے جو زمین سے اگتی ہے ، اس لئے کہ ہر اگنے والی چیز کسی نہ کسی مخلوق کے لئے خوراک ہے۔ لہٰذا مرعی کا مفہوم یہاں اس سے کہیں وسیع ہے کہ کوئی چیز ہمارے مویشیوں کے چرنے کی ہے تو مرعی ہے۔ کیونکہ اللہ نے زمین کو پیدا کیا اور اس زمین کے اوپر چلنے والی ہر مخلوق کے لئے اس کے اندر اس کی خوراک پیدا کی ، چاہے یہ مخلوق زمین کے اوپر چلتی ہو ، یا اندر چھپی رہتی ہو یا اس کی فضاﺅں میں اڑتی ہو۔</p><p>نباتات ابتداء میں سبز ہوتے ہیں ، پھر یژمردہ ہوکر سیاہ ہوجاتے ہیں۔ بعض اوقات تو وہ سبزی کی حالت ہی میں خوراک کے قابل ہوتے ہیں اور بعض اوقات وہ پک کر سیاہ ہوتے ہیں تو خوراک کا کام دیتے ہیں۔ درمیانی حالت میں بھی وہ کسی نہ کسی خوراک کا کام دیتے ہیں۔ بہرحال نباتات کی ہر حالت ، اللہ کی تخلیق اور تسویہ کے مطابق کسی مخلوق کے لئے خوراک بنتی ہے۔</p><p>یہاں نباتاتی زندگی کے منظر کو پیش کرکے ایک اشارہ یہ کیا گیا ہے کہ جس طرح ہر نبات کوڑا کرکٹ بن کر انجام تک پہنچتا ہے۔ اس طرح ہر زندہ مخلوق بھی اس دنیا میں اپنے انجام کو پہنچتی ہے۔ اور یہ اشارہ ہے اس حیات ودنیا اور حیات اخروی کی طرف کہ حیات دنیا تو نباتات کی طرح ختم ہونے والی ہے اور حیات اخروی باقی اور لازوال ہے۔ بعد میں آتا ہے۔</p><p>بل توثرون…………وابقی (17:87) ” مگر تم لوگ دنیا کی زندگی کو ترجیح دیتے ہو حالانکہ آخرت سے بہتر اور باقی رہنے والی ہے “۔ دنیا کی زندگی اس کھیت کی طرح ہے جو ختم ہوکر کوڑا کرکٹ بن جاتی ہے اور آخرت باقی و لازوال ہوتی ہے۔</p><p>اس مقطع کے ذریعے اس عظیم کائنات کے صفحات کو دور تک پھیلا دیا جاتا ہے اور جن امور کا ذکر ہوتا ہے وہ سورت کے آنے والے حقائق کے ساتھ مناسب ہیں۔ یہ کائنات ان سے ہم آہنگ ہوتی ہے اور یہ حقائق کائنات سے پیوست ہوتے ہیں۔ ایک نہایت ہی وسیع و عریض فریم ورک ہیں۔ اگر گہرا مطالعہ کیا جائے کہ اس سیپارے کے مضامین کو وسیع کائناتی دائرے میں پیش کیا گیا ہے۔ یہ کائناتی دائرہ اس پارے کی فضا اور اس کے اشارات اور مضامین کے ساتھ ہم آہنگ ہوتا ہے۔</p>"
      },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 93,
        "text": "افتتحت السورة الكريمة ، بأمر النبى صلى الله عليه وسلم بالمداومة على تنزيه الله - تعالى - عن كل نقص ، ويدخل فى هذا الأمر ، كل من يصلح للخطاب . والاسم لمراد به الجنس ، فيشمل جميع أسمائه - تعالى - .أى : نزه - أيها الرسول الكريم - أسماء ربك الأعلى عن كل ما لا يليق بها ، فلا تطلقها على غيره - تعالى - إذا كان خاصة به ، كلفظ الجلالة ، وكلفظ الرحمن ، ولا تذكرها فى موضع لا يتناسب مع جلالها وعظمتها ، ولا تحرفها عن المعانى التى وضعت لها كما يفعل الزائغون . فقد قال - تعالى - : ( وَللَّهِ الأسمآء الحسنى فادعوه بِهَا وَذَرُواْ الذين يُلْحِدُونَ في أَسْمَآئِهِ سَيُجْزَوْنَ مَا كَانُواْ يَعْمَلُونَ ) ونزه ربك الأعلى ، عن الشريك ، وعن الوالد ، وعن الولد ، وعن الشبيه . . وعن كل ما لا يليق به .قال الجمل : أى : نزه ربك عن كل ما لا يليق به ، فى ذاته ، وصفاته ، وأسمائه ، وأفعاله ، وأحكامه . أما فى ذاته : فأن تعتقد أنها ليست من الجواهر والأعراض . وأما فى صفاته : فإن تعتقد أنها لسيت محدثة ولا متناهية ولا ناقصة . وأما فى أفعاله : فأن تعتقد أنه - سبحانه - مطلق لا اعتراض لأحد عليه فى أمر من الأمور . وأما فى أسمائه : فأن لا تذكره - سبحانه - إلا بالأسماء التى لا توهم نقصا بوجه من الوجوه . . وأما فى أحكامه : فإن تعلم أنه ما كلفنا لنفع يعود عليه ، بل لمحض المالكية . .أخرج الإِمام أحمد عن عامر بن عقبة الجهنى قال : \" لما نزلت : ( فَسَبِّحْ باسم رَبِّكَ العظيم ) قال لنا رسول الله صلى الله عليه وسلم : \" اجعلوها فى ركوعكم \" فلما نزلت : ( سَبِّحِ اسم رَبِّكَ الأعلى ) قال : \" اجعلوها فى سجودكم \" \" ."
      },
      {
        "resource_id": 16,
        "text": "نَزِّه اسم ربك الأعلى عن الشريك والنقائص تنزيهًا يليق بعظمته سبحانه، الذي خلق المخلوقات، فأتقن خلقها، وأحسنه، والذي قدَّر جميع المقدرات، فهدى كل خلق إلى ما يناسبه، والذي أنبت الكلأ الأخضر، فجعله بعد ذلك هشيمًا جافًا متغيرًا."
      },
      {
        "resource_id": 169,
        "text": "<h2>Which was revealed in Makkah</h2><h2>The Virtues of Surat Al-A`la</h2><p>This Surah was revealed in Makkah before the migration to Al-Madinah. The proof of this is what Al-Bukhari recorded from Al-Bara' bin `Azib, that he said, \"The first people to come to us (in Al-Madinah) from the Companions of the Prophet were Mus`ab bin `Umayr and Ibn Umm Maktum, who taught us the Qur'an; then `Ammar, Bilal and Sa`d came. Then `Umar bin Al-Khattab came with a group of twenty people, after which the Prophet came. I have not seen the people of Al-Madinah happier with anything more than their happiness with his coming (to Al-Madinah). This was reached to such an extent that I saw the children and little ones saying, `This is the Messenger of Allah who has come.' Thus, he came, but he did not come until after I had already recited (i.e., learned how to recite)</p><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><p>(Glorify the Name of your Lord, the Most High.) (87:1) as well as other Surahs similar to it.\" It has been confirmed in the Two Sahihs that the Messenger of Allah said to Mu`adh,</p><div class=\"arabic uthmani\">«هَلَّا صَلَّيْتَ بِــ</div><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><div class=\"arabic uthmani\">وَالشَّمْسِ وَضُحَـهَا </div><div class=\"arabic uthmani\">وَالَّيْلِ إِذَا يَغْشَى »</div><p>(Why didn't you recite \"Glorify the Name of your Lord, the Most High,\"; \"By the sun and its brightness,\" and \"By the night when it envelopes.\") Imam Ahmad recorded from An-Nu`man bin Bashir that the Messenger of Allah recited</p><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><div class=\"arabic uthmani\">هَلْ أَتَاكَ حَدِيثُ الْغَـشِيَةِ </div><p>Surat Al-A`la (chapter 87) and Surat Al-Ghashiyh (chapter 88) in the two `Id prayers. If the `Id prayer fell on Friday, he would recite them in both prayers (`Id and Salat Al-Jumu`ah). Muslim also recorded this in his Sahih, as well as Abu Dawud, At-Tirmidhi, An-Nasa'i and Ibn Majah. The wording of Muslim and the Sunan compilers says, \"He used to recite</p><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><div class=\"arabic uthmani\">هَلْ أَتَاكَ حَدِيثُ الْغَـشِيَةِ </div><p>Surat Al-A`la (chapter 87) and Surat Al-Ghashiyh (chapter 88) for the two `Ids and Jumu`ah. If they occurred on the same day, he would recite them in both of them.\" In his Musnad, Imam Ahmad recorded on the authority of Ubayy bin Ka`b, Abdullah bin `Abbas, `Abdur-Rahman bin Abza, and the Mother of the believers, `A'ishah, that the Messenger of Allah used to recite</p><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><div class=\"arabic uthmani\">قُلْ يأَيُّهَا الْكَـفِرُونَ </div><div class=\"arabic uthmani\">قُلْ هُوَ اللَّهُ أَحَدٌ </div><p>(Glorify the Name of your Lord, the Most High.) and (Say: `O you who disbelieve.') and (Say: `He is Allah, the One.') `A'ishah added in her version that he would also recite the Mu`awwidhatayn (Al-Falaq and An-Nas).</p><div class=\"arabic uthmani\">بِسْمِ اللَّهِ الرَّحْمَـنِ الرَّحِيم</div><p>In the Name of Allah, the Most Gracious, the Most Merciful.</p><h2>The Command to pronounce Tasbih and its Response</h2><p>Imam Ahmad recorded from Ibn `Abbas that whenever the Messenger of Allah would recite</p><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><p>(Glorify the Name of your Lord, the Most High.) he would say,</p><div class=\"arabic uthmani\">«سُبْحَانَ رَبِّيَ الْأَعْلَى»</div><p>(Glory to my Lord, the Most High.) Ibn Jarir recorded from Ibn Ishaq Al-Hamdani that whenever Ibn `Abbas would recite</p><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><p>(Glorify the Name of your Lord, the Most High.) he would say, \"Glory to my Lord, the Most High,\" and whenever he would recite</p><div class=\"arabic uthmani\">لاَ أُقْسِمُ بِيَوْمِ الْقِيَـمَةِ </div><p>(I swear by the Day of Resurrection.) (75:1) and then reach the end of it</p><div class=\"arabic uthmani\">أَلَيْسَ ذَلِكَ بِقَـدِرٍ عَلَى أَن يُحْيِىَ الْمَوْتَى </div><p>(Is not He able to give life to the dead) (75:40) he would say, \"Glory to You, of course.\" Qatadah said,</p><div class=\"arabic uthmani\">سَبِّحِ اسْمَ رَبِّكَ الاّعْلَى </div><p>(Glorify the Name of your Lord, the Most High.) \"It has been mentioned to us that whenever the Prophet of Allah used to recite it he would say,</p><div class=\"arabic uthmani\">«سُبْحَانَ رَبِّيَ الْأَعْلَى»</div><p>(Glory to my Lord, the Most High.)\"</p><h2>The Creation, the Decree, and the bringing forth of Vegetation</h2><p>Allah says,</p><div class=\"arabic uthmani\">الَّذِى خَلَقَ فَسَوَّى </div><p>(Who has created, and then proportioned it.) meaning, He created that which has been created, and He fashioned every creation in the best of forms. Then Allah says,</p><div class=\"arabic uthmani\">وَالَّذِى قَدَّرَ فَهَدَى </div><p>(And Who has measured; and then guided.) Mujahid said, \"He guided man to distress and happiness, and he guided the cattle to their pastures.\" This Ayah is similar to what Allah has said about Musa's statement to Fir`awn,</p><div class=\"arabic uthmani\">رَبُّنَا الَّذِى أَعْطَى كُلَّ شَىءٍ خَلْقَهُ ثُمَّ هَدَى</div><p>(Our Lord is He Who gave to each thing its form and nature, then guided it aright.) (20:50) meaning, He decreed a set measure and guided the creation to it. This is just as is confirmed in Sahih Muslim on the authority of `Abdullah bin `Amr that the Messenger of Allah said,</p><div class=\"arabic uthmani\">«إِنَّ اللهَ قَدَّرَ مَقَادِيرَ الْخَلَائِقِ قَبْلَ أَنْ يَخْلُقَ السَّمَواتِ وَالْأَرْضَ بِخَمْسِينَ أَلْفَ سَنَةٍ وَكَانَ عَرْشُهُ عَلَى الْمَاء»</div><p>(Verily, Allah ordained the measure of all creation fifty thousand years before He created the heavens and the earth, and His Throne was over the water.) Concerning Allah's statement,</p><div class=\"arabic uthmani\">وَالَّذِى أَخْرَجَ الْمَرْعَى </div><p>(And Who brings out the pasturage,) meaning, all types of vegetation and crops.</p><div class=\"arabic uthmani\">فَجَعَلَهُ غُثَآءً أَحْوَى </div><p>(And then makes it dark stubble.) Ibn `Abbas said, \"Dried up and altered.\" It has been narrated that Mujahid, Qatadah and Ibn Zayd, all made similar statements.</p><h2>The Prophet does not forget the Revelation</h2><p>Allah says,</p><div class=\"arabic uthmani\">سَنُقْرِئُكَ</div><p>(We shall make you to recite,) meaning, `O Muhammad.'</p><div class=\"arabic uthmani\">فَلاَ تَنسَى</div><p>(so you shall not forget (it),) This is Allah informing and promising him (the Prophet ) that He will teach him a recitation that he will not forget.</p><div class=\"arabic uthmani\">إِلاَّ مَا شَآءَ اللَّهُ</div><p>(Except what Allah may will.) Qatadah said, \"The Prophet did not forget anything except what Allah willed.\" It has been said that the meaning of Allah's statement,</p><div class=\"arabic uthmani\">فَلاَ تَنسَى</div><p>(so you shall not forget,) is, \"do not forget\" and that which would be abrogated, is merely an exception to this. Meaning, `do not forget what We teach you to recite, except what Allah wills, which He removes and there is no sin on your leaving it off (not retaining it).' Concerning Allah's statement,</p><div class=\"arabic uthmani\">إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَى</div><p>(He knows what is apparent and what is hidden.) meaning, He knows what the creatures do openly and what they hide, whether it be statements or deeds. None of that is hidden from Him. Then Allah says,</p><div class=\"arabic uthmani\">وَنُيَسِّرُكَ لِلْيُسْرَى </div><p>(And We shall make easy for you the easy.) meaning, `We will make good deeds and statements easy for you, and We will legislate such Law for you that is easy, tolerant, straight and just, with no crookedness, difficulty or hardship in it.'</p><h2>The Command to remind</h2><p>Allah then says,</p><div class=\"arabic uthmani\">فَذَكِّرْ إِن نَّفَعَتِ الذِّكْرَى </div><p>(Therefore remind in case the reminder profits.) meaning, remind where reminding is beneficial. From here we get the etiquette of spreading knowledge, that it should not be wasted upon those who are not suitable or worthy of it. The Commander of the believers, `Ali said, \"You do not tell people any statement that their intellects do not grasp except that it will be a Fitnah (trial) for some of them.\" He also said, \"Tell people that which they know. Would you like for Allah and His Messenger to be rejected\" Allah said:</p><div class=\"arabic uthmani\">سَيَذَّكَّرُ مَن يَخْشَى </div><p>(The reminder will be received by him who fears,) meaning, `he whose heart fears Allah and who knows that he is going to meet Him, will receive admonition from what you convey to him, O Muhammad.'</p><div class=\"arabic uthmani\">وَيَتَجَنَّبُهَا الاٌّشْقَى - الَّذِى يَصْلَى النَّارَ الْكُبْرَى - ثُمَّ لاَ يَمُوتُ فِيهَا وَلاَ يَحْيَا </div><p>(But it will be avoided by the wretched, who will enter the great Fire. There he will neither die nor live.) meaning, he will not die and thus be allowed to rest, nor will he live a life that is beneficial to him. Instead, his life will be harmful to him, because it will be the cause of his feeling of the pain of torment and various types of punishments what he is being punished with. Imam Ahmad recorded from Abu Sa`id that the Messenger of Allah said,</p><div class=\"arabic uthmani\">«أَمَّا أَهْلُ النَّارِ الَّذِينَ هُمْ أَهْلُهَا لَا يَمُوتُونَ وَلَا يَحْيَوْنَ، وَأَمَّا أُنَاسٌ يُرِيدُ اللهُ بِهِمُ الرَّحْمَةَ فَيُمِيتُهُمْ فِي النَّارِ فَيَدْخُلُ عَلَيْهِمُ الشُّفَعَاءُ فَيَأْخُذُ الرَّجُلُ الضِّبَارَةَ فَيُنْبِتُهُمْ أو قال: يَنْبُتُونَ فِي نَهْرِ الْحَيَا، أو قال: الْحَيَاةِ، أو قال: الْحَيَوَانِ أو قال: نَهْرِ الْجَنَّةِ فَيَنْبُتُونَ نَبَاتَ الْحِبَّةِ فِي حَمِيلِ السَّيْل»</div><p>(Concerning the people of the Fire who are deserving of it, they will not die nor will they live. Regarding the people that Allah wants mercy for, He will cause them to die in the Fire. Then He will allow the intercessors to come to them, and a man will take his groups of supporters and plant them (or he said (they will be planted) in the River of Al-Haya (or he said (Al-Hayah, or Al-Hayawan, or Nahr Al-Jannah). Then they will sprout up like the sprouting of the seed on the moist bank of a flowing stream.) Then the Prophet said,</p><div class=\"arabic uthmani\">«أَمَا تَرَوْنَ الشَّجَرَةَ تَكُونُ خَضْرَاءَ، ثُمَّ تَكُونُ صَفْرَاءَ، ثُمَّ تَكُونُ خَضْرَاءَ؟»</div><p>(Haven't you all seen the tree that is green, then it turns yellow, then it turns green (again)) Abu Sa`id then said that some of those present said, \"It is as if the Prophet used to live in the desert wilderness (i.e., due to his parables of nature).\" Ahmad also recorded from Abu Sa`id that the Messenger of Allah said,</p><div class=\"arabic uthmani\">«أَمَّا أَهْلُ النَّارِ الَّذِينَ هُمْ أَهْلُهَا فَإِنَّهُمْ لَا يَمُوتُونَ فِيهَا وَلَا يَحْيَوْنَ، وَلَــكِنْ أُنَاسٌ أو كما قال تُصِيبُهُمُ النَّارُ بِذُنُوبِهِمْ أو قال: بِخَطَايَاهُمْ فَيُمِيتُهُمْ إِمَاتَةً حَتْى إِذَا صَارُوا فَحْمًا أُذِنَ فِي الشَّفَاعَةِ، فَجِيءَ بِهِمْ ضَبَائِرَ ضَبَائِرَ فَبُثُّوا عَلى أَنْهَارِ الْجَنَّةِ فَيُقَالُ:يَا أَهْلَ الْجَنَّةِ أَفِيضُوا عَلَيْهِمْ، فَيَنْبُتُونَ نَبَاتَ الْحِبَّةِ تَكُونُ فِي حَمِيلِ السَّيْل»</div><p>(Concerning the people of the Fire who will be dwellers of it, they will not die in it nor will they live. However, there will be a group of people - or as he said -( whom the Fire will burn due to their sins - or he said - (their wrongdoings. So, He will cause them to die until they become burnt coal. Then the intercession will be allowed and they will be brought group after group, and they will be scattered over the rivers of Paradise. Then it will be said: \"O people of Paradise! Pour down upon them.\" Then they will sprout like the growing of the seed that is upon the moist bank of the flowing stream.\" Then, a man from among the people present said, \"It is as if the Messenger of Allah used to live in the desert wilderness.\" Muslim also recorded this Hadith.</p>"
      },
      {
        "resource_id": 160,
        "text": "<p>مسند احمد میں ہے عقبہ بن عامر جہنی ؓ فرماتے ہیں کہ جب آیت (فَسَبِّحْ باسْمِ رَبِّكَ الْعَظِيْمِ 74ۧ) 56۔ الواقعة :74) اتری تو رسول اللہ ﷺ نے فرمایا اسے تم اپنے رکوع میں کرلو جب آیت (سَبِّحِ اسْمَ رَبِّكَ الْاَعْلَى ۙ) 87۔ الأعلی :1) اتری تو آپ نے فرمایا اسے اپنے سجدے میں کرلو ابو داؤد وغیرہ کی حدیث میں ہے کہ جب رسول اللہ ﷺ آیت (سَبِّحِ اسْمَ رَبِّكَ الْاَعْلَى ۙ) 87۔ الأعلی :1) پڑھتے تو کہتے سبحان ربی الاعلی حضرت علی سے بھی یہ مروی ہے حضرت ابن عباس ؓ سے بھی یہ مروی ہے اور آپ جب آیت (لا اقسم بیوم القیامۃ) پڑھتے اور آخری آیت (اَلَيْسَ ذٰلِكَ بِقٰدِرٍ عَلٰٓي اَنْ يُّـحْيِۦ الْمَوْتٰى 40؀) 75۔ القیامة :40) پر پہنچتے تو فرماتے سبحانک و بلی اللہ تعالیٰ یہاں ارشاد فرماتا ہے اپنے بلندیوں والے پرورش کرنے والے اللہ کے پاک نام کی پاکیزگی اور تسبیح بیان کرو جس نے تمام مخلوق کو پیدا کیا اور سب کو اچھی ہیئت بخشی انسان کو سعادت شقاوت کے چہرے دکھا دئیے اور جانور کو چرنے چگنے وغیرہ کے سامان مہیا کیے جیسے اور جگہ ہے آیت (رَبُّنَا الَّذِيْٓ اَعْطٰي كُلَّ شَيْءٍ خَلْقَهٗ ثُمَّ هَدٰى 50؀) 20۔ طه :50) یعنی ہمارا رب وہ ہے جس نے ہر چیز کو اس کی پیدائش عطا فرمائی پھر رہبری کی صحیح مسلم شریف کی حدیث میں ہے کہ زمین آسمان کی پیدائش سے پچاس ہزار سال پہلے اللہ تعالیٰ نے اپنی مخلوق کی تقدیر لکھی اس کا عرش پانی پر تھا جس نے ہر قسم کے نباتات اور کھیت نکالے پھر ان سرسبز چاروں کو خشک اور سیاہ رنگ کردیا بعض عارفان کلام عرب نے کہا ہے کہ یہاں بعض الفاظ جو ذکر میں موخر ہیں معنی کے لحاظ سے مقدم ہیں یعنی مطلب یہ ہے کہ جس نے گھاس چارہ سبز رنگ سیاہی مائل پیدا کیا پھر اسے خشک کردیا گویہ معنی بھی بن سکتے ہیں لیکن کچھ زیادہ ٹھیک نظر نہیں آتے کیونکہ مفسرین کے اقوال کے خلاف ہیں پھر فرماتا ہے کہ تجھے ہم اے محمد ﷺ ایسا پڑھائیں گے جسے تو بھولے نہیں ہاں اگر خود اللہ کوئی آیت بھلا دینا چاہے تو اور بات ہے امام ابن جریر تو اسی مطلب کو پسند کرتے ہیں اور مطلب اس آیت کا یہ ہے کہ جو قرآن ہم تجھے پڑھاتے ہیں اسے نہ بھول ہاں جسے ہم خود منسوخ کردیں اس کی اور بات ہے اللہ پر بندوں کے چھپے کھلے اعمال احوال عقائد سب ظاہر ہیں ہم تجھ پر بھلائی کے کام اچھی باتیں شرعی امر آسان کردیں گے نہ اس میں کجی ہوگی نہ سختی نہ جرم ہوگا تو نصیحت کر اگر نصیحت فائدے دے۔ اس سے معلوم ہوا کہ نالائقوں کو نہ سکھانا چاہیے جیسے کہ امیر المومنین حضرت علی کرم اللہ وجہہ فرماتے ہیں کہ اگر تم دوسروں کے ساتھ وہ باتیں کرو گے جو ان کی عقل میں نہ آسکیں تو نتیجہ یہ ہوگا کہ تمہاری بھلی باتیں ان کے لیے بری بن جائیں گی اور باعث فتنہ ہوجائیں گی بلکہ لوگوں سے ان کی سمجھ کے مطابق بات چیت کرو تاکہ لوگ اللہ اور رسول کو نہ جھٹلائیں۔ پھر فرمایا کہ اس سے نصیحت وہ حاصل کریگا جس کے دل میں اللہ کا خوف ہے جو اس کی ملاقات پر یقین رکھتا ہے اور اس سے وہ عبرت و نصیحت حاصل نہیں کرسکتا جو بدبخت ہو جو جہنم میں جانے والا ہو جہاں نہ تو راحت کی زندگی ہے نہ بھلی موت ہے بلکہ وہ لازوال عذاب اور دائمی برائی ہے اس میں طرح طرح کے عذاب اور بدترین سزائیں ہیں مسند احمد میں ہے کہ جو اصلی جہنمی ہیں انہیں نہ تو موت آئیگی نہ کار آمد زندگی ملے گی ہاں جن کے ساتھ اللہ کا ارادہ رحمت کا ہے وہ آگ میں گرتے ہی جل کر مرجائیں گے پھر سفارشی لوگ جائیں گے اور ان میں سے اکثر کو چھڑا لائیں گے پھر نہر حیاۃ میں ڈال دئیے جائیں گے جنتی نہروں کا پانی ان پر ڈالا جائیگا اور وہ اس طرح جی اٹھیں گے جس طرح دانہ نالی کے کنارے کوڑے پر اگ آتا ہے کہ پہلے سبز ہوتا ہے پھر زرد پھر ہرا لوگ کہنے لگے حضور ﷺ تو اس طرح بیان فرماتے ہیں جیسے آپ جنگل سے واقف ہوں یہ حدیث مختلف الفاظ سے بہت سی کتب میں مروی ہے قرآن کریم میں اور جگہ وارد ہے آیت (وَنَادَوْا يٰمٰلِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۭ قَالَ اِنَّكُمْ مّٰكِثُوْنَ 77؀) 43۔ الزخرف :77) یعنی جہنمی لوگ پکار پکار کر کہیں گے کہ اے مالک داروغہ جہنم اللہ سے کہہ وہ ہمیں موت دے دے جواب ملے گا تم تو اب اسی میں پڑے رہنے والے ہو اور جگہ ہے آیت (لَا يُقْضٰى عَلَيْهِمْ فَيَمُوْتُوْا وَلَا يُخَـفَّفُ عَنْهُمْ مِّنْ عَذَابِهَا ۭ كَذٰلِكَ نَجْزِيْ كُلَّ كَفُوْرٍ 36؀ۚ) 35۔ فاطر :36) یعنی نہ تو ان کی موت آئیگی نہ عذاب کم ہوں گے اس معنی کی آیتیں اور بھی ہیں۔</p>"
      },
      {
        "resource_id": 91,
        "text": "يأمر تعالى بتسبيحه المتضمن لذكره وعبادته، والخضوع لجلاله، والاستكانة لعظمته، وأن يكون تسبيحا، يليق بعظمة الله تعالى، بأن تذكر أسماؤه الحسنى العالية على كل اسم بمعناها الحسن العظيم  ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 1{ سَبِّحِ اسْمَ رَبِّکَ الْاَعْلَی۔ } ”پاکی بیان کرو اپنے رب کے نام کی جو بہت بلند وبالا ہے۔“ یہ حکم یوں بھی ہوسکتا تھا کہ ”اپنے رب کی پاکی بیان کرو“ لیکن یہاں خصوصی طور پر اسم نام کا لفظ اس لیے آیا ہے کہ اللہ تعالیٰ کی ذات ہمارے تصور سے وراء الوراء ‘ ثم وراء الوراء ہے۔ اس کی ذات کے ساتھ ہمارا ذہنی و قلبی تعلق صرف اور صرف اس کے ناموں کے حوالے سے ہے۔ اسی لیے ہمیں حکم دیا گیا ہے : { وَلِلّٰہِ الْاَسْمَآئُ الْحُسْنٰی فَادْعُوْہُ بِہَاص } الاعراف : 180 ”اور تمام اچھے نام اللہ ہی کے ہیں ‘ تو پکارو اسے اُن اچھے ناموں سے“۔ چناچہ ہم انسان اگر اللہ کا ذکر کرنا چاہیں یا اس کی تسبیح وتحمید کرنا چاہیں تو ظاہر ہے اس کے اسماء کے حوالے سے ہی کرسکتے ہیں۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>তুমি তোমার সুমহান প্রতিপালকের নামে পবিত্রতা ও মহিমা ঘোষণা কর। [১]</p><p>[১] ঐ সব জিনিস থেকে পবিত্র যা তাঁর জন্য শোভনীয় বা উপযুক্ত নয়। হাদীসে বর্ণিত হয়েছে যে, নবী (সাঃ) এই সূরাটির প্রথম আয়াতের জওয়াবে 'সুবহানা রাব্বিয়াল আ'লা' বলতেন। <em>(মুসনাদে আহমাদ, আবু দাউদ নামায অধ্যায়, নামাযে দু</em><em>'</em><em>আর পরিচ্ছেদ শায়খ আলবানী এটাকে সহীহ বলেছেন।)</em></p>"
      },
      {
        "resource_id": 166,
        "text": "<p>আপনি আপনার সুমহান রবের নামের পবিত্রতা ও মহিমা ঘোষণা করুন [১] ,</p><p>সূরা সম্পর্কিত তথ্যঃ</p><p>এ সূরা মক্কায় নাযিল হওয়া প্রাচীন সূরাসমূহের অন্যতম। বারা ইবনে আযিব রাদিয়াল্লাহু ‘আনহু বলেন, “রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের সাহাবীগণের মধ্যে সর্বপ্রথম মুস‘আব ইবনে উমায়ের এবং আব্দুল্লাহ্ ইবনে উম্মে মাকতুমই মদীনায় হিজরত করে আসেন। তারা দু‘জনই আমাদেরকে কুরআন পড়ে শোনাতেন। তারপর আম্মার, বিলাল ও সা‘দ আসলেন। তারপর উমর ইবনুল খাত্তাব আসলেন বিশজনকে সাথে নিয়ে। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম আসলেন, মদীনাবাসীগণ তার আগমনে যে রকম খুশী হয়েছিলেন তেমন আর কারও আগমনে খুশী হননি। এমনকি আমি ছোট ছোট ছেলে-মেয়েদেরকে একথা বলতে শুনেছি যে, এই হলো আল্লাহ্র রাসূল। তিনি আমাদের মাঝে তাশরীফ রেখেছেন। তিনি আসার আগেই আমি ‘সাব্বিহিস্মা রাব্বিকাল আ‘লা’ এবং এ ধরনের আরও কিছু সূরা পড়ে নিয়েছিলাম।” [বুখারী: ৪৯৪১, ৩৯২৪, ৩৯২৫, ৪৯৯৫] অন্য হাদীসে এসেছে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম মু‘আয রাদিয়াল্লাহু ‘আনহুকে বললেন, “তুমি কেন ‘সাব্বিহিস্মা রাব্বিকাল আ‘লা, ওয়াস শামছি ওয়া দুহাহা, ওয়াল্লাইলে ইযা ইয়াগসা” এ সূরাগুলো দিয়ে সালাত পড়ালে না?” [বুখারী: ৭০৫, মুসলিম: ৪৬৫] অন্য হাদীসে এসেছে, “রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম দুই ঈদের সালাতে ‘সাব্বিহিসমা রাব্বিকাল আ‘লা এবং হাল আতাকা হাদীসুল গাশীয়াহ’ পড়তেন। আর যদি জুম‘আর দিনে ঈদ হতো তবে তিনি দুটাতেই এ সূরা দুটি দিয়ে সালাত পড়াতেন।” [মুসনাদে আহমাদ: ৪/২৭৭] কোন কোন হাদীসে এসেছে যে, “রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম জুম‘আ ও দুই ঈদের সালাতে “সাব্বিবহিসমা রাব্বিকাল আ‘লা এবং হাল আতাকা হাদীসুল গাশীয়াহ’ দিয়ে সালাত পড়াতেন। এমনকি কখনো যদি জুম‘আ ও ঈদের সালাতও একই দিনে অনুষ্ঠিত হয়ে যেত তখন তিনি উভয় সালাতে এ দু’ সূরাই পড়তেন। [মুসলিম: ৮৭৮, আবুদাউদ: ১১২২, তিরমিয়ী: ৫৩৩, নাসায়ী: ১৪২৪, ১৫৬৮, ১৫৯০, ইবনে মাজহ: ১২৮১] অন্য হাদীসে এসেছে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বিতরের সালাতে “সাব্বিবহিসমা রাব্বিকাল আ‘লা, কুল ইয়া আইয়ুহাল কাফিরূন এবং কুল হুয়াল্লাহু আহাদ, পড়তেন। আয়েশা রাদিয়াল্লাহু ‘আনহা থেকে অপর বর্ণনায় এসেছে যে, তিনি এর সাথে ‘কুল আউযু বিরাব্বিল ফালাক ও কুল আউযু বিরাব্বিন নাস’ও পড়তেন। [মুসনাদে আহমাদ: ৩/৪০৬, ৫/১২৩, আবুদাউদ: ১৪২৪, মুস্তাদরাকে হাকিম: ১/৩০৫] ইবনে আব্বাসরা দিয়াল্লাহু ‘আনহুমা বলেন, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম যখনই এ আয়াত পড়তেন তখন বলতেন, ‘সুবহানা রাব্বিয়াল আ‘লা’। [আবু দাউদ: ৮৮৩, মুসনাদে আহমাদ: ১/২৩২, মুস্তাদরাকে হাকিম:১/২৬৩]</p><p>--------------------</p><p>[১] আল্লাহ্ তা‘আলা বান্দাদেরকে তাঁর তাসবীহ বা পবিত্রতা ও মহিমা ঘোষণা করার নির্দেশ দিচ্ছেন। যে পবিত্ৰতা ঘোষণার মাধ্যমে আল্লাহ্র যিকির, ইবাদাত, তাঁর মাহাত্নের জন্য বিনয়, দৈন্যদশা ও হীনাবস্থা প্ৰকাশ পায়। আর তাঁর তাসবীহ যেন তাঁর সত্তার মাহাত্ম উপযোগী হয়। যেন তাঁকে তাঁর সুন্দর সুন্দর নামসমূহ দিয়েই সেগুলোর মহান অর্থের প্রতি লক্ষ্য রেখেই কেবল আহ্বান করা হয়। [সা‘দী]</p>"
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى (1)اختلف أهل التأويل في تأويل قوله: ( سَبِّحِ اسْمَ رَبِّكَ الأعْلَى ) فقال بعضهم: معناه: عظم ربك الأعلى، لا ربّ أعلى منه وأعظم، وكان بعضهم إذا قرأ ذلك قال: سبحان ربي الأعلى.* ذكر من قال ذلك:حدثني يعقوب بن إبراهيم، قال: ثنا هشيم، قال: أخبرنا أبو بشر، عن سعيد بن جُبير، عن ابن عمر أنه كان يقرأ: ( سَبِّحِ اسْمَ رَبِّكَ الأعْلَى ) سبحان ربي الأعلى ( الَّذِي خَلَقَ فَسَوَّى ) قال: وهي في قراءة أُبيّ بن كعب كذلك .حدثنا ابن بشار، قال: ثنا عبد الرحمن، قال: سفيان، عن السدي، عن عبد خير، قال: سمعت عليًا رضي الله عنه قرأ: ( سَبِّحِ اسْمَ رَبِّكَ الأعْلَى ) فقال: سبحان ربي الأعلى .حدثنا ابن حميد، قال: ثنا حكام، عن عنبسة، عن أبي إسحاق الهمداني، أن ابن عباس، كان إذا قرأ ( سَبِّحِ اسْمَ رَبِّكَ الأعْلَى ) يقول: سبحان ربي الأعلى، وإذا قرأ  لا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ  فأتى على آخرها  أَلَيْسَ ذَلِكَ بِقَادِرٍ عَلَى أَنْ يُحْيِيَ الْمَوْتَى  ؟ يقول: سبحانك اللهمّ وبَلَى .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة ( سَبِّحِ اسْمَ رَبِّكَ الأعْلَى ) ذُكر لنا أن نبيّ الله صلى الله عليه وسلم كان إذا قرأها قال: سبحان ربي الأعلَى.حدثنا ابن حميد، قال: ثنا مهران، عن خارجة، عن داود، عن زياد بن عبد الله، قال: سمعت ابن عباس يقرأ في صلاة المغرب: ( سَبِّحِ اسْمَ رَبِّكَ الأعْلَى ) سبحان ربي الأعلَى .وقال آخرون: بل معنى ذلك: نـزه يا محمد اسم ربك الأعلى، أن تسمي به شيئًا سواه، ينهاه بذلك أن يفعل ما فعل من ذلك المشركون من تسميتهم آلهتهم بعضها اللات وبعضها العزّى.وقال غيرهم: بل معنى ذلك: نـزه الله عما يقول فيه المشركون كما قال:  وَلا تَسُبُّوا الَّذِينَ يَدْعُونَ مِنْ دُونِ اللَّهِ فَيَسُبُّوا اللَّهَ عَدْوًا بِغَيْرِ عِلْمٍ  وقالوا: معنى ذلك: سبح ربك الأعلى؛ قالوا: وليس الاسم معنيًا.وقال آخرون: نـزه تسميتك يا محمد ربك الأعلى وذكرك إياه أن تذكره إلا وأنت له خاشع متذلل؛ قالوا: وإنما عُنِي بالاسم: التسمية، ولكن وُضع الاسم مكان المصدر.وقال آخرون: معنى قوله: ( سَبِّحِ اسْمَ رَبِّكَ الأعْلَى ) : صلّ بذكر ربك يا محمد ، يعني بذلك: صلّ وأنت له ذاكر، ومنه وجل خائف.وأولى الأقوال في ذلك عندنا بالصواب قول من قال: معناه: نـزه اسم ربك أن تدعو به الآلهة والأوثان، لما ذكرت من الأخبار، عن رسول الله صلى الله عليه وسلم، وعن الصحابة أنهم كانوا إذا قرءوا ذلك قالوا: سبحان ربي الأعلى، فَبَيَّن بذلك أن معناه كان عندهم معلوما: عظم اسم ربك ونـزهه."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 94,
        "text": "مكية( ( سبح اسم ربك الأعلى ) [ يعني ] قل سبحان ربي الأعلى . وإلى هذا ذهب جماعة من الصحابة والتابعين .أخبرنا أحمد بن إبراهيم الشريحي ، أخبرنا أحمد بن محمد بن إبراهيم الثعلبي ، أخبرنا عبد الله بن حامد ، أخبرنا أحمد بن عبد الله ، حدثنا محمد بن عبد الله ، حدثنا عبد الله بن عمر بن أبان ، حدثنا وكيع ، عن إسرائيل ، عن أبي إسحاق ، عن مسلم بن البطين ، عن سعيد بن جبير ، عن ابن عباس أن النبي - صلى الله عليه وسلم - قرأ \" سبح اسم ربك الأعلى \" فقال : \" سبحان ربي الأعلى \" .وقال قوم : معناه نزه ربك الأعلى عما يصفه به الملحدون ، وجعلوا الاسم صلة . ويحتج بهذا من يجعل الاسم والمسمى واحدا ، لأن أحدا لا يقول : سبحان اسم الله ، وسبحان اسم ربنا ، إنما يقول : سبحان الله وسبحان ربنا ، فكان معنى سبح اسم ربك الأعلى : سبح ربك .وقال آخرون : نزه تسمية ربك ، بأن تذكره وأنت له معظم ، ولذكره محترم [ ولأوامره مطاوع ] وجعلوا الاسم بمعنى التسمية .وقال ابن عباس : سبح [ اسم ربك الأعلى ] أي : صل بأمر ربك الأعلى ."
      },
      {
        "resource_id": 14,
        "text": "سورة الأعلي: الدليل على ذلك ما رواه البخاري حدثنا عبدان أخبرني أبي عن شعبة عن أبي إسحاق عن البراء بن عازب قال أول من قدم علينا من أصحاب النبي صلى الله عليه وسلم مصعب بن عمير وابن أم مكتوم فجعلا يقرئاننا القرآن ثم جاء عمار وبلال وسعد ثم جاء عمر بن الخطاب في عشرين ثم جاء النبي صلى الله عليه وسلم فما رأيت أهل المدينة فرحوا بشيء فرحهم به حتى رأيت الولائد والصبيان يقولون هذا رسول الله صلى الله عليه وسلم قد جاء فما جاء حتى قرأت سبح اسم ربك الأعلى في سور مثلها. وقال الإمام أحمد حدثنا وكيع حدثنا إسرائيل عن ثوير بن أبي فاخته عن أبيه عن علي رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم يحب هذه السورة سبح اسم ربك الأعلى تفرد به أحمد وثبت في الصحيحين أن رسول الله صلى الله عليه وسلم قال لمعاذ \"هلا صليت ب\"سبح اسم ربك الأعلى والشمس وضحاها والليل إذا يغشي\" \".وقال الإمام أحمد حدثنا سفيان عن إبراهيم بن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن أبيه عن النعمان بن بشير أن رسول الله صلى الله عليه وسلم قرأ في العيدين ب\"سبح اسم ربك الأعلي\" و\"هل أتاك حديث الغاشية\" وإن وافق يوم الجمعة قرأهما جميعا. هكذا وقع في مسند الإمام أحمد إسناد هذا الحديث وقد رواه مسلم في صحيحه وأبو داود والترمذي والنسائي من حديث أبو عوانه وجرير وشعبة ثلاثتهم عن محمد بن المنتشر عن أبيه عن حبيب بن سالم عن النعمان بن بشير به قال الترمذي وكذا رواه الثوري ومسعر عن إبراهيم قال ورواه سفيان بن عيينه عن إبراهيم عن أبيه عن حبيب بن سالم عن أبيه عن النعمان ولا يعرف لحبيب رواية عن أبيه وقد رواه ابن ماجه عن محمد بن الصباح عن سفيان بن عيينة عن إبراهيم بن المنتشر عن أبيه عن حبيب بن سالم عن النعمان به كما رواه الجماعة فالله أعلم ولفظ مسلم وأهل السنن كان يقرأ في العيدين ويوم الجمعة ب\"سبح اسم رب الأعلى\" و\"هل أتاك حديث الغاشية\" وربما اجتمعا في يوم واحد فقرأهما. وقد روى الإمام أحمد في مسنده من حديث أبي بن كعب وعبدالله بن عباس وعبدالرحمن بن أبزى وعائشة أم المؤمنين أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب\"سبح اسم ربك الأعلى\" و\"قل يا أيها الكافرون\" و\"قل هو الله أحد\" زادت عائشة والمعوذتين. وهكذا روي هذا الحديث من طريق جابر وأبي أمامة صدي بن عجلان وعبدالله بن مسعود وعمران بن حصين وعلي ابن أبي طالب رضي الله عنهم ولولا خشية الإطالة لأوردنا ما تيسر لنا من أسانيد ذلك ومتونه ولكن في الإرشاد بهذا الاختصار كفاية والله أعلم. قال الإمام أحمد حدثنا أبو عبدالرحمن حدثنا موسى يعني ابن أيوب الغافقي حدثنا عمي إياس بن عامر سمعت عقبة بن عامر الجهني لما نزلت \"فسبح باسم ربك العظيم\" قال لنا رسول الله صلى الله عليه وسلم \"اجعلوها في ركوعكم\" فلما نزلت \"سبح اسم ربك الأعلى\" قال \"اجعلوها في سجودكم\" ورواه أبو داود وابن ماجه من حديث ابن المبارك عن موسى بن أيوب به. وقال الإمام أحمد حدثنا وكيع حدثنا إسرائيل عن أبي إسحاق عن مسلم البطين عن سعيد بن جبير عن ابن عباس أن رسول الله صلى الله عليه وسلم كان إذا \"قرأ سبح اسم ربك الأعلى\" قال \"سبحان ربي الأعلى\" وهكذا رواه أبو داود عن زهير بن حرب عن وكيع به قال وخولف فيه وكيع رواه أبو وكيع وشعبة عن أبي إسحاق عن سعيد عن ابن عباس موقوفا وقال الثوري عن السدي عن عبد خير قال سمعت عليا قرأ \"سبح اسم ربك الأعلى\" فقال سبحان ربي الأعلى. وقال ابن جرير حدثنا ابن حميد حدثنا حكام عن عنبسة عن أبي إسحاق الهمداني أن ابن عباس كان إذا قرأ \"سبح اسم ربك الأعلى\" يقول سبحان ربي الأعلى وإذا قرأ \"لا أقسم بيوم القيامة\" فأتى على آخرها \"أليس ذلك بقادر على أن يحيي الموتى\" يقول سبحانك وبلى وقال قتادة \"سبح اسم ربك الأعلى\" ذكر لنا أن نبي الله صلى الله عليه وسلم كان إذا قرأها قال سبحان ربي الأعلى."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 2,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 14,
        "text": "أي خلق الخليقة وسوى كل مخلوق في أحسن الهيئات."
      },
      {
        "resource_id": 94,
        "text": "\"الذي خلق فسوى\"، قال الكلبي: خلق كل ذي روح، فسوى اليدين والرجلين والعينين. وقال الزجاج: خلق الإنسان مستوياً، ومعنى سوى: عدل قامته."
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : الذي خلق فسوى قد تقدم معنى التسوية في ( الانفطار ) وغيرها . أي سوى ما خلق ، فلم يكن في خلقه تثبيج . وقال الزجاج : أي عدل قامته . وعن ابن عباس : حسن ما خلق . وقال الضحاك : خلق آدم فسوى خلقه . وقيل : خلق في أصلاب الآباء ، وسوى في أرحام الأمهات . وقيل : خلق الأجساد ، فسوى الأفهام . وقيل : أي خلق الإنسان وهيأه للتكليف ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 159,
        "text": "<p>آیت 2 ‘ 3{ الَّذِیْ خَلَقَ فَسَوّٰی - وَالَّذِیْ قَدَّرَ فَہَدٰی۔ } ”جس نے ہر چیز کو پیدا کیا ‘ پھر تناسب قائم کیا۔ اور جس نے ہر شے کا اندازہ مقرر کیا ‘ پھر اسے فطری ہدایت عطا فرمائی۔“ ان چار الفاظ خَلَقَ ‘ فَسَوّٰی ‘ قَدَّرَ ‘ فَھَدٰی میں اللہ تعالیٰ کی صفات کا بیان بھی ہے اور تخلیقی عمل کے مختلف مراحل کا ذکر بھی۔ اللہ تعالیٰ کی صفت تخلیق کے حوالے سے تین اسمائے حسنیٰ اَلْخَالِقُ ‘ اَلْـبَارِیٔ‘ اَلْمُصَوِّرُ کا ایک ساتھ ذکر قبل ازیں سورة الحشر کی آخری آیت میں بھی آچکا ہے۔ سورة الحشر کی اس آیت میں اللہ تعالیٰ کی یہ تین صفات ایک خاص منطقی ترتیب سے بیان ہوئی ہیں۔ یہ ترتیب دراصل تخلیقی عمل کے مرحلہ وار ارتقاء کی نشاندہی کرتی ہے۔ اللہ تعالیٰ سب سے پہلے کسی چیز کا نقشہ یا نمونہ بناتا ہے ‘ اس لحاظ سے وہ اَلْخَالِقُہے۔ پھر وہ مطلوبہ چیز کو طے شدہ نمونے کے مطابق عدم سے عالم وجود میں ظاہر فرماتا ہے ‘ اس اعتبار سے وہ اَلْـبَارِیہے۔ تیسرے مرحلے میں وہ اس تخلیق کو ظاہری صورت یا شکل عطا فرماتا ہے ‘ اس مفہوم میں وہ اَلْمُصَوِّرُہے۔  سورة الحشر کی مذکورہ آیت میں تخلیقی عمل کے جن تین مراحل کا ذکر ہوا ہے ان کا تعلق چیزوں کے ظاہری یا مادی وجود سے ہے ‘ جبکہ زیر مطالعہ آیات میں مادی وجود کی تخلیق کے ساتھ ساتھ چیزوں کے باطنی خصائص کی تخلیق کا ذکر بھی ہے۔ خَلَقَ فَسَوّٰیکے الفاظ میں چیزوں کے مادی وجود کی تخلیق کے مراحل کا بیان ہے ‘ جبکہ قَدَّرَ فَھَدٰی کے الفاظ کسی تخلیق کے باطنی پہلوئوں کی نشاندہی کرتے ہیں۔  اب ہم ان الفاظ کے معانی و مفہوم کو انسانی ماحول کی مثالوں سے سمجھنے کی کوشش کرتے ہیں۔ چناچہ پہلے دو مراحل تخلیق اور تسویہ کو ایک عمارت کی مثال کے حوالے سے یوں سمجھئے کہ کسی عمارت کا ڈھانچہ کھڑا کردینا اس کی ”تخلیق“ ہے ‘ جبکہ اس کو سجانا ‘ سنوارنا finishing وغیرہ اس کا ”تسویہ“ ہے۔ تخلیق کا تیسرا مرحلہ جس کا یہاں ذکر ہوا ہے وہ ”قدر“ ہے۔ قدر کے لغوی معنی اندازہ مقرر کرنے کے ہیں ‘ جسے عرفِ عام میں ہمارے ہاں تقدیر کہا جاتا ہے۔ اس مفہوم میں کسی تخلیق کے معیار ‘ اس کی صلاحیت ‘ استعداد اور حدود limitations سمیت جملہ خصوصیات کو اس کی قدر یا تقدیر کہا جائے گا۔ مثلاً انسان اشرف المخلوقات تو ہے لیکن وہ ہوا میں اڑنے سے معذور ہے۔ اس کے مقابلے میں ایک چھوٹی سی چڑیا آسانی سے ہوا میں اڑتی پھرتی ہے۔ تو گویا ہوا میں اڑنے کی یہ صلاحیت رکھنا چڑیا کی تقدیر کا خاصہ ہے اور اس اعتبار سے معذور ہونا انسان کی تقدیر کا حصہ ہے۔ اس کے بعد تخلیق کے اگلے مرحلے کے طور پر یہاں ”ہدایت“ کا ذکر آیا ہے۔ اس سے مراد وہ فطری اور جبلی ہدایت ہے جو اللہ تعالیٰ نے اپنی ہر مخلوق کو پیدائشی طور پر عطا کر رکھی ہے۔ اسی ”ہدایت“ کی روشنی میں بکری کو معلوم ہوا ہے کہ اسے گھاس کھانا ہے اور شیر جانتا ہے کہ اس کی غذا گوشت ہے۔ غرض ہر جاندار اپنی زندگی اسی طریقے اور اسی لائحہ عمل کے مطابق گزار رہا ہے جو اللہ تعالیٰ نے اس کے لیے طے کردیا ہے۔  تخلیق کے ان چار مراحل کے حوالے سے اگر ہم انسانی زندگی کا جائزہ لیں تو پہلے دو مراحل یعنی تخلیق اور تسویہ کے اعتبار سے تو انسان میں اور اللہ تعالیٰ کی دوسری مخلوقات میں کوئی فرق نہیں۔ لیکن اگلے دو مراحل تقدیر اور ہدایت کے حوالے سے انسان کا معاملہ دوسری مخلوقات سے الگ ہے۔ اس لحاظ سے ہر انسان کی قدر ‘ صلاحیت اور استعداد اللہ تعالیٰ کے ہاں دو طرح سے طے پاتی ہے۔ اس کا ایک پہلو یا ایک حصہ تو وہ ہے جو اسے پیدائشی طور پر جینز genes کی صورت میں عطا ہوا given ہے اور دوسرا پہلو یا دوسرا حصہ اس کے ماحول کا ہے جس میں وہ آنکھ کھولتا اور پرورش پاتا ہے۔ ان دونوں پہلوئوں کے اچھے برے اور مثبت و منفی عوامل کے ملنے سے ہر انسان کی شخصیت کا ایک سانچہ تیار ہوتا ہے جسے سورة بنی اسرائیل کی آیت 84 میں ”شاکلہ“ کا نام دیا گیا ہے۔ سورئہ بنی اسرائیل کی اس آیت کے تحت اس اصطلاح کی وضاحت کی جا چکی ہے۔ اسی سانچہ یا شاکلہ سے ہر انسان کی استعداد کی حدود متعین ہوتی ہیں۔ اور کوئی انسان انگریزی محاورہ \" one cannot out grow ones skin\" کوئی انسان اپنی کھال سے باہر نہیں نکل سکتا کے مصداق ان حدود سے تجاوز نہیں کرسکتا۔ ہر انسان نیکی کرے گا تو اپنی اسی استعداد کے مطابق کرے گا اور اگر برائی کمائے گا تو انہی حدود کے اندر رہ کر ایسا کرے گا۔ غرض ہر انسان کی عملی زندگی کی ساری محنت ‘ کوشش اور بھاگ دوڑ اپنے شاکلہ کے مطابق ہی ہوگی اور اللہ تعالیٰ کے ہاں اس کی جانچ evaluation بھی اسی حوالے سے کی جائے گی۔ مثلاً ایک شخص کی صلاحیت پچاس درجے تک پہنچنے کی تھی ‘ اگر وہ چالیس درجے تک پہنچ گیا تو ہوسکتا ہے کہ اللہ تعالیٰ کے ہاں وہ کامیاب قرار پائے۔ اس کے مقابلے میں ایک دوسرا شخص جو سو درجے تک جانے کی استعداد رکھتا تھا ‘ وہ ممکن ہے پچاس درجے تک پہنچنے کے بعد بھی ناکام رہے۔ بہرحال اس حوالے سے اللہ تعالیٰ نے ایک اصول طے فرمادیا کہ { لَا یُکَلِّفُ اللّٰہُ نَفْسًا اِلاَّ وُسْعَھَاط } البقرۃ : 286 ”اللہ تعالیٰ نہیں ذمہ دار ٹھہرائے گا کسی جان کو مگر اس کی وسعت کے مطابق۔“  اسی طرح انسان کی ”ہدایت“ کے بھی دو درجے ہیں۔ پہلا درجہ تو جبلی ہدایت کا ہے۔ یعنی جس طرح اللہ تعالیٰ نے اپنی ہر مخلوق کو جبلی ہدایت سے نواز رکھا ہے اسی طرح اس نے ہر انسان کو بھی فطری اور جبلی طور پر ہدایت کا ایک حصہ عطا فرمایا ہے۔ جبکہ انسان کی ہدایت کا دوسرا حصہ وہ ہے جو اللہ تعالیٰ نے اسے وحی کے ذریعے عطا فرمایا ہے۔ یعنی انسان کی فطرت میں پہلے سے ودیعت شدہ بنیادی ہدایت کی تکمیل کے لیے اللہ تعالیٰ نے دنیا میں پیغمبر بھی بھیجے اور کتابیں بھی نازل کیں۔</p>"
      },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 16,
        "text": "نَزِّه اسم ربك الأعلى عن الشريك والنقائص تنزيهًا يليق بعظمته سبحانه، الذي خلق المخلوقات، فأتقن خلقها، وأحسنه، والذي قدَّر جميع المقدرات، فهدى كل خلق إلى ما يناسبه، والذي أنبت الكلأ الأخضر، فجعله بعد ذلك هشيمًا جافًا متغيرًا."
      },
      {
        "resource_id": 93,
        "text": "ثم وصف - سبحانه - ذاته بعد وصفه بالأعلى بصفات كريمة أخرى فقال : ( الذي خَلَقَ فسوى ) أى : خلق كل شئ فسوى خلقه تسوية ، ولم يأت به متفاوتا غير ملتئم ، ولكن على إحكام واتساق ، ودلالة على أنه صادر عن عالم ، وأنه صنعه حكيم . ."
      },
      {
        "resource_id": 91,
        "text": "وتذكر أفعاله التي منها أنه خلق المخلوقات فسواها، أي: أتقنها وأحسن خلقها."
      },
      {
        "resource_id": 166,
        "text": "<p>যিনি [১] সৃষ্টি করেন [২] অতঃপর সুঠাম করেন [৩]।</p><p>[১] এখানে মূলত: আল্লাহ্ তা‘আলার পবিত্রতা ও মহিমা ঘোষণার কারণ ও হেতুসমূহ বর্ণনা করা হচ্ছে। এ আয়াত এবং এর পরবর্তী কয়েকটি আয়াতে জগৎ সৃষ্টিতে আল্লাহ্র অপার রহস্য ও শক্তি সম্পর্কিত কতিপয় কর্মগত গুণাবলী বর্ণিত হয়েছে।</p><p>[২] অর্থাৎ সৃষ্টি করেছেন। কোন কিছুকে নাস্তি থেকে আস্তিতে আনয়ন করেছেন। কোন সৃষ্টির এ কাজ করার সাধ্য নেই; একমাত্র আল্লাহ্ তা‘আলার অপার কুদরতই কোন পূর্ব-নমুনা ব্যতিরেকে যখন ইচ্ছা, যাকে ইচ্ছা নাস্তি থেকে আস্তিতে আনয়ন করে।</p><p>[৩] অর্থ সামঞ্জস্যপূর্ণ, মজবুত ও সুন্দর করেছেন। [সা‘দী]। অর্থাৎ তিনি সবকিছু সৃষ্টি করেছেন। আর যে জিনিসটিই সৃষ্টি করেছেন তাকে সঠিক ও সুঠাম দেহসৌষ্ঠব দান করেছেন তার মধ্যে ভারসাম্য ও শক্তির অনুপাত সঠিকভাবে প্রতিষ্ঠিত করেছেন। তাকে এমন আকৃতি দান করেছেন যে, তার জন্য এর চেয়ে ভালো আকৃতির কল্পনাই করা যেতে পারে না। একথাটিকে অন্যত্র বলা হয়েছে, “তিনি প্রত্যেকটি জিনিসকে চমৎকার তৈরি করেছেন।” [সূরা আস-সাজদাহ: ৭]</p>"
      },
      {
        "resource_id": 92,
        "text": "الَّذِي خَلَقَ فَسَوَّى (2) وجملة : { الذي خلق فسوى } اشتملت على وصفين : وصف الخلق ووصف تسويه الخلق ، وحذف مفعول { خلق } فيجوز أن يقدر عامّاً ، وهو ما قدره جمهور المفسرين ، وروي عن عطاء ، وهو شأن حذف المفعول إذا لم يدل عليه دليل ، أي خلق كل مخلوق فيكون كقوله تعالى حكاية عن قول موسى : { ربنا الذي أعطى كل شيء خلقه ثم هدى } [ طه : 50 ] .ويجوز أن يقدر خاصاً ، أي خلق الإنسان كما قدره الزجاج ، أو خلق آدم كما روي عن الضحاك ، أي بقرينة قرن فعل { خلق } بفعل «سوى» قال تعالى : { فإذا سويته ونفخت فيه من روحي } [ الحجر : 29 ] الآية .وعطف جملة : { فسوى } بالفاء دون الواو للإِشارة إلى أن مضمونها هو المقصود من الصلة وأن ما قبله توطئة له كما في قول ابن زيابة: ... يا لهفَ زيَابةً للحارث الصّابححِ فالغَانِم فالآيب ... لأن التلهف يحق إذا صبحهم فغنم أموالَهم وآب بها ولم يستطيعوا دفاعه ولا استرجاعه .فالفاء من قوله : { فسوى } للتفريع في الذكر باعتبار أن الخلق مقدم في اعتبار المعتبر على التسويه ، وإن كان حصول التسويه مقارناً لحصول الخلق .والتسويه : تسويةُ ما خلقَه فإن حمل على العموم فالتسوية أنْ جعل كل جنس ونوع من الموجودات معادِلاً ، أي مناسباً للأعمال التي في جبلته فاعوجاج زُبَانَى العقرببِ من تسويه خلقها لتدفع عن نفسها بها بسهولة .ولكونه مقارناً للخلقة عطف على فعل { خلق } بالفاء المفيدة للتسبب ، أي ترتَّبَ على الخَلق تسويتُه .والتقديرُ : وضْعُ المقدارِ وإيجادُه في الأشياء في ذواتها وقواها ، يقال : قَدَّر بالتضعيف وقدَر بالتخفيف بمعنىً .وقرأ الجمهور بالتشديد وقرأها الكسائي وحده بالتخفيف .والمقدار : أصله كمية الشيء التي تُضبط بالذرع أو الكيل أو الوزن أو العَدّ ، وأطلق هنا على تكوين المخلوقات على كيفيات منظّمة مطردة من تركيب الأجزاء الجسدية الظاهرة مثل اليدين ، والباطنة مثل القلب ، ومن إيداع القُوى العقلية كالحس والاستطاعة وحِيلَ الصناعة ."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( الَّذِي خَلَقَ فَسَوَّى ) يقول: الذي خلق الأشياء فسوىّ خلقها، وعدّلها، والتسوية التعديل."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>যিনি সৃষ্টি করেছেন, অতঃপর সুসমঞ্জস করেছেন। [১]</p><p>[১] এ ব্যাপারে দেখুন সূরা ইনফিত্বার ৮২:৭ নং আয়াতের টীকা।</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>Subtle and Profound Wisdom in the Creation of the Universe</p><p>الَّذِي خَلَقَ فَسَوَّىٰ وَالَّذِي قَدَّرَ فَهَدَىٰ (who created [ everything ], then made [ it ] well, and who determined a measure [ for everything ], then guided [ it ]...87:2, 3). All these are the attributes of the 'Most Exalted Lord'. The first attribute is khalaqa which does not simply mean 'to make' or 'manufacture'. It has a deeper significance: 'to bring out something from pure non-existence into the realm of existence without the help of any pre-existing matter'. (This is the correct meaning of 'creation'. If something is made with the help of some pre-existing matter, it cannot be called 'creation' in its original sense.) This is not within the power of anyone else. Only the perfect power of Allah can bring things into existence, whenever He wills, without the help of any pre-existing matter.</p><p>The second attribute, which is connected with takhliq (creation), is sawwa. This word is derived from taswiyah, and it literally means 'to make well or equal'. The verse signifies that Allah made the constitution of everything symmetrical or made it congruously consistent in its several parts, the body structure, shape and size, limbs and organs. Man and every other animal is adapted to the requirements of wisdom. The hands and legs, the tips of the fingers and toes have joints with different types of springy connective tissues that make it possible to bend and fold in different ways. If we look at another limb or organ of human body, its symmetry and balance baffles our imagination and is sufficient for us to believe in the consummate wisdom and power of the Creator of the universe.</p><p>The third attribute is qaddara which is derived from taqdir and it means 'to determine; to measure; to balance; to design symmetrically; to decree/decide'. The word is used in the last sense here. The verse purports to say that things in the world have not been created without purpose. Everything has been created for a specific purpose, and has been endowed with natural capacities to fit its function. If we look carefully, the principle does not apply only to specific species. Every member of the universe has been assigned a specific function to perform. We witness the manifestation of the assignments in the sky, the stars, lightning, rain, humans, animals, vegetation and minerals.</p><p>Maulana Rumi رحمۃ علیہ says:</p><p>خاک و باد و آب و آتش بندہ اند بامن و تو مردہ باحق زندہ اند</p><p>'The earth, the wind, the water and the fire all of them are slaves of Allah.</p><p>According to me and you, they are senseless, but according to Allah, all of them are alive and sensible.</p><p>Allah has especially geared man and every species of animals to do particular works and they perform them according to their natural inclination, and their predisposition pivots around their respective tasks.</p><p>ہری کے رابہر کارے ساختند میل اور ادردلش اند اختند</p><p>Allah has created everything for a particular purpose And has filled its heart with inclination towards it.</p><p>The fourth attribute of Allah is fa-hada 'then guided it'. In other words, The Creator of the universe did not create things and left them to their own mercy to perform their particular function as they like, but they are shown the way in which they should be performed. As a matter of fact, He guided the entire creation by equipping each member of it with suitable nature to function for which it was created, whether the member is the sky or celestial creation, or it is the earth or the earthly creation. They all possess a special type of sense, though it is of a lower than that of man. The Qur'an says:</p><p>رَبُّنَا الَّذِي أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَىٰ</p><p>'Our Lord is He Who gave to each thing its form and nature, then guided it aright. [ 20:50] '</p><p>As a result, since the inception of their creation, the skies, the earth, the stars and planets, mountains and oceans are all performing their functions accurately, without any failure or deviation. Humans and animals, in particular, whose intellect and sensibility can be observed easily, have been invested with capabilities of fulfilling their minute needs and repelling harmful things in a way that baffles the one who thinks about it. Since man possesses sense and intelligence of a higher degree, his capabilities may not be so much surprising, but let us look into wild animals, ferocious animals or beasts of prey, birds and insects. Each and everyone of them is able to obtain its necessities of life. They are able to find their habitats. They have not acquired the skills of fulfilling their individual and communal needs through a teacher that may educate or train them, nor did they need any school or college to acquire this knowledge and skill. Their education and training comes directly from the Creator of the universe. It is this divine guidance that has been referred to in the Holy Qur'an by saying,</p><p>رَبُّنَا الَّذِي أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَىٰ</p><p>'Our Lord is He Who gave to each thing its form and nature, then guided it aright. [ 20:50] '</p><p>and in this Surah thus:</p><p>وَالَّذِي قَدَّرَ فَهَدَىٰ</p><p>'and who determined a measure (for everything), then guided (it), [ 3] '</p><p>The Knowledge of Science is a Divine Gift to Man</p><p>Allah has equipped man with the higher order of intelligence and sense. The entire universe is made subservient to him, the earth, mountains and oceans and everything created therein are made to serve man and created for his benefit. However, full advantage of them is not possible unless man acquires knowledge and skill to put various things together and produce a new item. Nature has provided man with intelligence and understanding to excavate mountains and dive into the oceans to obtain minerals and marine objects. He composes certain items like wood, iron, steel, copper, brass and so on and makes new items of his need. This knowledge and technology is not dependent on scientific research and college or university education. Even illiterate people have been doing this since the inception of human existence. This is intrinsic science that Allah has endowed upon man as a natural gift. Later, man developed the capability of doing technical and scientific research. He thus made progress in various fields of science and technology. The capability to do this is also a Divine gift.</p><p>Obviously, science and technology does not create anything, but it merely shows the way to use the created things. The initial knowledge about their use is taught by Allah, but there is a wide scope to make progress in it by the capabilities Allah has bestowed to man, the manifestation of which we are witnessing in this scientific age day by day, and what further range of these abilities and talents will manifest in future is unknown. All this is the interpretation of hada '[ He ] guided (it), [ 3] In other words, Allah has placed in them potentials and capabilities to perform their natural functions. But alas! the scientists are getting more and more negligent, rather blind to these realities day by day.</p>"
      },
      {
        "resource_id": 170,
        "text": "Всевышний повелел поминать Его, поклоняться Ему и проявлять смирение и покорность пред Его величием. А для того, чтобы это прославление соответствовало величию Всевышнего Аллаха, люди должны поминать Его возвышенные имена и осознавать славный и великий смысл каждого имени. Они также должны поминать Божьи деяния, одним из которых является сотворение Вселенной в столь совершенном и прекрасном облике."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 3,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 16,
        "text": "نَزِّه اسم ربك الأعلى عن الشريك والنقائص تنزيهًا يليق بعظمته سبحانه، الذي خلق المخلوقات، فأتقن خلقها، وأحسنه، والذي قدَّر جميع المقدرات، فهدى كل خلق إلى ما يناسبه، والذي أنبت الكلأ الأخضر، فجعله بعد ذلك هشيمًا جافًا متغيرًا."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 166,
        "text": "<p>আর যিনি নির্ধারণ করেন [১] অতঃপর পথনির্দেশ করেন [২] ,</p><p>[১] অর্থাৎ প্রতিটি বস্তুকে তাকদীর নির্ধারণ করেছেন। প্রতিটি জিনিস সে তাকদীর অনুসরণ করছে। [সা’দী]</p><p>[২] অর্থাৎ স্রষ্টা যে কাজের জন্যে যাকে সৃষ্টি করেছেন, তাকে সে কাজের পথনির্দেশও দিয়েছেন। সত্যিকারভাবে এ পথনির্দেশে আকাশ ও পৃথিবীর যাবতীয় সৃষ্টিই অন্তর্ভুক্ত আছে। কেননা, এক বিশেষ ধরনের বুদ্ধি ও চেতনা আল্লাহ্ তা‘আলা সবাইকে দিয়েছেন, যদিও তা মানুষের বুদ্ধি ও চেতনা থেকে নিম্নস্তরের। অন্য আয়াতে আছে:</p><p>قَالَ رَبُّنَا الَّذِي أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَىٰ</p><p>“ তিনি বললেন , ‘আমাদের প্রতিপালক তিনি, যিনি প্রত্যেক বস্তুর জন্য তাকদীর নির্ধারণ করেছেন, তারপর পথনির্দেশ করেছেন।” [সূরা ত্বাহা: ৫০] এ হিসেবে আলোচ্য আয়াতের অর্থ, আল্লাহ্ তা‘আলা প্রত্যেক বস্তুকে সৃষ্টি করে এর জন্য তাকদীর নির্ধারণ করেছেন। তারপর সে তাকদীর নির্ধারিত বিষয়ের দিকে মানুষকে পরিচালিত করছেন। মুজাহিদ বলেন, মানুষকে সৌভাগ্য কিংবা দুর্ভাগ্যের পথ দেখিয়েছেন। আর জীব-জন্তুকে তাদের চারণভূমির পথ দেখিয়েছেন। [ইবন কাসীর]</p>"
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 93,
        "text": "( والذي قَدَّرَ فهدى ) والتقدير : وضع الأشياء فى مواضعها الصحيحة ، بمقدار معين ، وبكيفية معينة . . تقتضيها الحكمة ، ويقرها العقل السليم .وقوله : ( فهدى ) من الهداية . بمعنى الإِرشاد والدالالة على طريق الخبر والبر . أى : وهو - سبحانه - الذى جعل الأشياء على مقادير مخصوصة فى أجناسها ، وفى أنواعها ، وفى أفرادها . وفى صفاتها وأفعالها . . وهدى كل مخلوق إلى ما ينبغى له طبعا واختيارا ، ووجهه إلى الوظيفة التى خلقه من أجلها ، بأن أوجد فيه العقل والميول والإِلهامات والغرائز والدوافع التى تعينه على أداء تلك الوظيفة .وحذف - سبحانه - المفعول فى قوله : ( الذي خَلَقَ فسوى .والذي قَدَّرَ فهدى ) للعموم ، لأن هذه الأفعال تشمل جميع مخلوقاته - عز وجل - .قال الآلوسى : ( والذي قَدَّرَ . . ) أى : جعل الأشياء على مقادير مخصوصة . . ( فهدى ) أى : فوجه كل واحد منها إلى ما يصدر عنه ، وينبغى له . . فلو تتبعت أحوال النباتات والحيوانا ، لرأيت فى كل منهما ما تحار فيه العقول ، وتضيق عنه دفاتر النقول .وأما فنون هداياته - سبحانه - للإِنسان على الخصوص ، ففوق ذلك بمراحل . . وهيهات أن يحيط بها فلك العبارة والتحرير ، ولا يعلمها إلا اللطيف الخبير .أتزعم أنك جرم صغير ... وفيك انطوى العالم الأكبروقد فصل بعض العلماء الحديث عن مظاهر تقديره وهدايته - سبحانه - فقال : قوله - تعالى - : ( الذي خَلَقَ فسوى . والذي قَدَّرَ فهدى ) أى : الذى خلق كل شئ فسواه ، فأكمل صنعته ، وبلغ به غاية الكمال الذى يناسبه ، والذى قدر لكل مخلوق وظيفته وطريقته وغايته ، فهداه إلى ما خلقه لأجله ، وألهمه غاية وجوده ، وقدر له ما يصلحه مدة بقائه ، وهداه إليه . وهذه الحقيقة الكبرى ماثلة فى كل شئ فى هذا الوجود ، ويشهد بها كل شئ فى رحاب هذا الكون ، من الكبير إلى الصغير .فالطيور لها غريزة العودة إلى الوطن . . دون أن تضل عنه مهما بعد ، والنحلة تهتدى إلى خليتها ، مهما طمست الريح فى هبوبها على الأعشاب والأشجار كل دليل يرى . .وسمك \" السلمون \" الصغير ، يمضى سنوات فى البحر ، ثم يعود إلى نهره الخاص به . ."
      },
      {
        "resource_id": 92,
        "text": "وَالَّذِي قَدَّرَ فَهَدَى (3) وإعادة اسم الموصول في قوله : { والذي قدر } وقوله : { والذي أخرج المرعى } مع إغناء حرف العطف عن تكريره ، للاهتمام بكل صلة من هذه الصلات وإثباتها لمدلول الموصول وهذا من مقتضيات الإطناب .وعطْفُ قوله : { فهدى } بالفاء مثل عطف { فسوى } ، فإن حمل { خلق } و { قدّر } على عموم المفعول كانت الهداية عامة . والقول في وجه عطف { فهدى } بالفاء مثل القول في عطف { فسوى } .وعطف { فهدى } على { قدر } عطفُ المسبَّب على السبب أي فهدى كلَّ مقدر إلى ما قدر له فهداية الإنسان وأنواع جنسه من الحيوان الذي له الإِدراك والإِرادة هي هداية الإِلهام إلى كيفية استعمال ما قدَّر فيه من المقادير والقوى فيما يناسب استعماله فيه فكلما حصل شيء من آثار ذلك التقدير حصل بأثره الاهتداء إلى تنفيذه .والمعنى : قَدّر الأشياءَ كلها فهداها إلى أداء وظائفها كما قدّرها لها ، فالله لما قدّر للإِنسان أن يكون قابلاً للنطق والعِلم والصناعة بما وَهَبَه من العقل وآلات الجسد هداهُ لاستعمال فكره لما يُحصِّل له ما خُلق له ، ولمَّا قَدر البقرةَ للدَّر ألهمها الرَعْي ورِثْمَانَ ولدها لِتَدرَّ بذلك للحالب ، ولمّا قدر النحل لإنتاج العسَل ألهمها أن ترعى النَّور والثمار وألهمها بناء الجِبْح وخلاياه المسدسة التي تضع فيها العسل .ومن أجلِّ مظاهر التقدير والهداية تقدير قوى التناسل للحيوان لبقاء النوع . فمفعول «هدى» محذوف لإفادة العموم وهو عام مخصوص بما فيه قابلية الهَدْي فهو مخصوص بذوات الإِدراك والإِرادة وهي أنواع الحيوان فإن الأنواع التي خلقها الله وقدَّر نظامها ولم يقدِّر لها الإِدراك مثل تقدير الإِثمار للشجر ، وإنتاج الزريعة لتجدد الإِنبات ، فذلك غير مراد من قوله : { فهدى } لأنها مخلوقة ومقدّرة ولكنها غير مهدية لعدم صلاحها للاهتداء ، وإن جعل مفعول { خلق } خاصاً ، وهو الإنسان كان مفعول { قدر } على وزانه ، أي تقدير كمال قوى الإِنسان ، وكانت الهداية هداية خاصة وهي دلالة الإِدراك والعقل .وأوثر وصفا التسوية والهداية من بين صفات الأفعال التي هي نِعم على الناس ودالة على استحقاق الله تعالى للتنزيه لأن هذين الوصفين مناسبة بما اشتملت عليه من السورة فإن الذي يسوي خَلق النبي صلى الله عليه وسلم تسوية تلائم ما خلَقه لأجله من تحمل أعباء الرسالة لا يفوته أن يهيئه لحفظ ما يوحيه إليه وتيسيره عليه وإعطائه شريعة مناسبة لذلك التيسير قال تعالى : { سنقرئك فلا تنسى } [ الأعلى : 6 ] وقال : { ونيسرك لليسرى } [ الأعلى : 8 ] ."
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 91,
        "text": "{ وَالَّذِي قَدَّرَ } تقديرًا، تتبعه جميع المقدرات { فَهَدَى } إلى ذلك جميع المخلوقات."
      },
      {
        "resource_id": 14,
        "text": "قال مجاهد هدى الإنسان للشقاوة والسعادة وهدى الأنعام لمراتعها. وهذه الآية كقوله تعالى إخبارا عن موسى أنه قال لفرعون \"ربنا الذي أعطي كل شيء خلقه ثم هدى\" أي قدر قدرا وهدى الخلائق إليه كما ثبت في صحيح مسلم عن عبدالله بن عمرو أن رسول الله صلى الله عليه وسلم قال \"إن الله قدر مقادير الخلائق قبل أن يخلق السموات والأرض بخمسين ألف سنة وكان عرشه على الماء\"."
      },
      {
        "resource_id": 170,
        "text": "Речь идет о всеобщем руководстве Аллаха, посредством которого Он указал всем творениям путь к тому, что принесет им пользу и наделил их мирскими благами."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 94,
        "text": "( والذي قدر فهدى ) قرأ الكسائي : \" قدر \" بتخفيف الدال ، وشددها الآخرون ، وهما بمعنى واحد .وقال مجاهد : هدى الإنسان لسبيل الخير والشر ، والسعادة والشقاوة ، وهدى الأنعام لمراتعها .وقال مقاتل والكلبي : قدر لكل شيء مسلكه ، \" فهدى \" عرفها كيف يأتي الذكر الأنثى .وقيل : قدر الأرزاق وهدى لاكتساب الأرزاق والمعاش .وقيل : خلق المنافع في الأشياء ، وهدى الإنسان لوجه استخراجها منها .وقال السدي : قدر مدة الجنين في الرحم ثم هداه للخروج من الرحم .قال الواسطي : قدر السعادة والشقاوة عليهم ، ثم يسر لكل واحد من الطائفتين سلوك [ سبيل ] ما قدر عليه ."
      },
      {
        "resource_id": 90,
        "text": "والذي قدر فهدى قرأ علي - رضي الله عنه - والسلمي والكسائي ( قدر ) مخففة الدال ، وشدد الباقون . وهما بمعنى واحد . أي قدر ووفق لكل شكل شكله . فهدى أي أرشد . قال مجاهد : قدر الشقاوة والسعادة ، وهدى للرشد والضلالة . وعنه قال : هدى الإنسان للسعادة والشقاوة ، وهدى الأنعام لمراعيها . وقيل : قدر أقواتهم وأرزاقهم ، وهداهم لمعاشهم إن كانوا إنسا ، ولمراعيهم إن كانوا وحشا . وروي عن ابن عباس والسدي ومقاتل والكلبي في قوله فهدى قالوا : عرف خلقه كيف يأتي الذكر الأنثى كما قال في ( طه ) : الذي أعطى كل شيء خلقه ثم هدى أي الذكر للأنثى . وقال عطاء : جعل لكل دابة ما يصلحها ، وهداها له . وقيل : خلق المنافع في الأشياء ، وهدى الإنسان لوجه استخراجها منها . وقيل قدر فهدى : قدر لكل حيوان ما يصلحه ، فهداه ، وعرفه وجه الانتفاع به . يحكى أن الأفعى إذا أتت عليها ألف سنة عميت ، وقد ألهمها الله أن مسح العين بورق الرازيانج الغض يرد إليها بصرها فربما كانت في برية بينها وبين الريف مسيرة أيام ، فتطوي تلك المسافة على طولها وعلى عماها ، حتى تهجم في بعض البساتين على شجرة الرازيانج لا تخطئها ، فتحك بها عينيها وترجع باصرة بإذن الله تعالى . وهدايات الإنسان إلى ما لا يحد من مصالحه ، وما لا [ ص: 16 ] يحصر من حوائجه ، في أغذيته وأدويته ، وفي أبواب دنياه ودينه ، وإلهامات البهائم والطيور وهوام الأرض باب واسع ، وشوط بطين ، لا يحيط به وصف واصف فسبحان ربي الأعلى . وقال السدي : قدر مدة الجنين في الرحم تسعة أشهر ، وأقل وأكثر ، ثم هداه للخروج من الرحم . وقال الفراء : أي قدر ، فهدى وأضل فاكتفى بذكر أحدهما كقوله تعالى : سرابيل تقيكم الحر . ويحتمل أن يكون بمعنى دعا إلى الإيمان كقوله تعالى : وإنك لتهدي إلى صراط مستقيم . أي لتدعو ، وقد دعا الكل إلى الإيمان . وقيل : فهدى أي دلهم بأفعاله على توحيده ، وكونه عالما قادرا . ولا خلاف أن من شدد الدال من قدر أنه من التقدير كقوله تعالى : وخلق كل شيء فقدره تقديرا . ومن خفف فيحتمل أن يكون من التقدير فيكونان بمعنى . ويحتمل أن يكون من القدر والملك أي ملك الأشياء ، وهدى من يشاء .قلت : وسمعت بعض أشياخي يقول : الذي خلق فسوى وقدر فهدى . هو تفسير العلو الذي يليق بجلال الله سبحانه على جميع مخلوقاته ."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَالَّذِي قَدَّرَ فَهَدَى ) يقول تعالى ذكره: والذي قدّر خلقه فهدى.واختلف أهل التأويل في المعنى الذي عُنِي بقوله: ( فَهَدَى ) ، فقال بعضهم: هدى الإنسان لسبيل الخير والشرّ، والبهائم للمراتع.* ذكر من قال ذلك:حدثنا محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى؛ وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا عن ابن أبي نجيح، عن مجاهد، قوله: ( قَدَّرَ فَهَدَى ) قال: هدى الإنسان للشِّقوة والسعادة، وهَدى الأنعام لمراتعها .وقال آخرون: بل معنى ذلك، هدى الذكور لمأتى الإناث. وقد ذكرنا الرواية بذلك فيما مضى.والصواب من القول في ذلك عندنا، أن الله عمّ بقوله: ( فَهَدَى ) الخبر عن هدايته خلقه، ولم يخصص من ذلك معنى دون معنى، وقد هداهم لسبيل الخير والشرّ، وهدى الذكور لمأتى الإناث، فالخبر على عمومه حتى يأتي خبر تقوم به الحجة، دالّ على خصوصه. واجتمعت قرّاء الأمصار على تشديد الدال من قدّر، غير الكسائي فإنه خفَّفها.والصواب في ذلك التشديد، لإجماع الحجة عليه."
      },
      {
        "resource_id": 165,
        "text": "<p>এবং যিনি তকদীর (নিয়তি) নির্ধারণ করেছেন। তারপর পথ দেখিয়ে দিয়েছেন। [১]</p><p>[১] অর্থাৎ, নেকী এবং বদীর। অনুরূপ জীবন-যাপনের জন্য প্রয়োজনীয় সকল কিছুর পথ তিনি দেখিয়েছেন। এই পথনির্দেশ পশু-পক্ষীকেও করা হয়েছে। قدَّر শব্দের অর্থ হল প্রত্যেক বস্তুর শ্রেণী ও তার প্রকারভেদ, গুণাবলী ও বৈশিষ্ট্য নির্ধারণ করে মানুষকেও তার প্রতি তিনি পথ প্রদর্শন করেছেন, যাতে মানুষ উপকৃত হতে পারে।</p>"
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 4,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 14, "text": "أي من جميع صنوف النباتات والزروع." },
      {
        "resource_id": 94,
        "text": "( والذي أخرج المرعى ) أنبت العشب وما ترعاه [ النعم ] من بين أخضر وأصفر وأحمر وأبيض ."
      },
      {
        "resource_id": 16,
        "text": "نَزِّه اسم ربك الأعلى عن الشريك والنقائص تنزيهًا يليق بعظمته سبحانه، الذي خلق المخلوقات، فأتقن خلقها، وأحسنه، والذي قدَّر جميع المقدرات، فهدى كل خلق إلى ما يناسبه، والذي أنبت الكلأ الأخضر، فجعله بعد ذلك هشيمًا جافًا متغيرًا."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 157, "text": "" },
      { "resource_id": 170, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - : ( والذي أَخْرَجَ المرعى . فَجَعَلَهُ غُثَآءً أحوى ) بيان لمظهر آخر من مظاهر قدرته - تعالى - ، التى لا يعجزها شئ .والمرعى : النبات الذى ترعاه الحيوانات ، وهو اسم مكان للأرض الذى يوجد فيها النبات .أى : وهو - سبحانه - وحده ، الذى أنبت النبات الذى ترعاه الدواب ، حالة كون هذا النبات أخضر رطبا . ثم يحوله بقدرته - تعالى - بعد حين إلى نبات يابس جاف .وهذا من أكبر الأدلة المشاهدة ، على أنه - تعالى - يتصرف فى خلقه كما يشاء ، فهو القادر على تحويل الزرع الأخضر إلى زرع يابس جاف ، كما أنه قادر على إحياء الإِنسان بعد موته .فالمقصود من هذه الآيات الكريمة ، الإِرشاد إلى كمال قدرته ، وتنوع نعمه - سبحانه - ، حتى يزداد المؤمنون إيمانا على إيمانهم ، وحتى يعود الكافرون إلى رشدهم بعد هذا البيان الواضح الحكيم ."
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَالَّذِي أَخْرَجَ الْمَرْعَى ) يقول: والذي أخرج من الأرض مرعى الأنعام من صنوف النبات وأنواع الحشيش.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني يعقوب بن مكرم، قال ثنا الحفري، قال ثنا سفيان، عن منصور، عن أبي رزين ( أَخْرَجَ الْمَرْعَى ) قال النبات .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( وَالَّذِي أَخْرَجَ الْمَرْعَى ... ) الآية، نبت كما رأيتم بين أصفر وأحمر وأبيض ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>এবং যিনি (চারণ-ভূমির) তৃণাদি উদ্‌গত করেছেন। [১]</p><p>[১] যাতে চতুষ্পদ জন্তুরা চরে বেড়ায়।</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : والذي أخرج المرعى أي النبات والكلأ الأخضر . قال الشاعر [ زفر بن الحارث ] :وقد ينبت المرعى على دمن الثرى وتبقى حزازات النفوس كما هيا"
      },
      {
        "resource_id": 166,
        "text": "<p>আর যিনি তৃণাদি উৎপন্ন করেন [১] ,</p><p>[১] তিনি চারণভূমির ব্যবস্থা করেছেন। যাবতীয় উদ্ভিদ ও ক্ষেত-খামার। [ইবন-কাসীরা] حافظ শব্দের অর্থ খড়-কুটো, আবর্জনা; যা বন্যার পানির উপর ভাসমান থাকে। [ফাতহুল কাদীর] أحوى শব্দের অর্থ কৃষ্ণাভ গাঢ় সবুজ রং। [ফাতহুল কাদীর] এ আয়াতে আল্লাহ্ তা‘আলা উদ্ভিদ সম্পর্কিত স্বীয় কুদরত ও হেকমত বৰ্ণনা করেছেন। তিনি ভূমি থেকে সবুজ-শ্যামল ঘাস উৎপন্ন করেছেন, অতঃপর একে শুকিয়ে কাল রং-এ পরিণত করেছেন এবং সবুজতা বিলীন করে দিয়েছেন। এতে দুনিয়ার চাকচিক্য যে ক্ষণস্থায়ী সেদিকে ইঙ্গিত করেছেন। [কুরতুবী]</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>وَالَّذِي أَخْرَجَ الْمَرْعَىٰ ﴿4﴾ فَجَعَلَهُ غُثَاءً أَحْوَىٰ (and who brought forth pasturage, then turned it into a blackening stubble....87:4, 5)</p><p>The word مَرْعَىٰ ma’ ra means 'pasturage'. This is the land that has grass growing on it, and that is used for animals to graze. The word ghutha' غُثَا refers to 'stubble, and scum borne upon the surface of a torrent'. The word أَحْوَىٰ ahwa is derived from the root huwwah which refers to 'a kind of black colour that comes upon a dense vegetation'. The verse purports to depict the Divine power and wisdom related to herbage and vegetation. He grows the green vegetation and then He gradually turns it into black colour, and it loses its freshness. This directs man's attention also to his end. His body radiating with health, beauty, smartness and alertness is a Divine gift, but its tenure of life is limited. Eventually it will come to an end.</p>"
      },
      {
        "resource_id": 92,
        "text": "وَالَّذِي أَخْرَجَ الْمَرْعَى (4) وقوله : { والذي أخرج المرعى } تذكير لخلق جنس النبات من شجر وغيره . واقتُصر على بعض أنواعه وهو الكلأ لأنه معاش السوائم التي ينتفع الناس بها .والمرادُ : إخراجه من الأرض وهو إنباته .والمرعى : النبت الذي ترعاه السوائم ، وأصله : إما مصدر ميمي أطلق على الشيء المَرْعِيّ من إطلاق المصدر على المفعول مثل الخلق بمعنى المخلوق وإما اسم مكان الرعي أطلق على ما ينبت فيه ويُرعَى إطلاقاً مجازياً بعلاقة الحلول كما أطلق اسم الوادي على الماء الجاري فيه .والقرينة جعله مفعولاً ل { أخرج } ، وإيثار كلمة { المرعى } دون لفظ النبات ، لما يشعر به مادة الرعي من نفع الأنعام به ونفعها للناس الذين يتخذونها مع رعاية الفاصلة . . .والغُثاء : بضم الغين المعجمة وتخفيف المثلثة ، ويقال بتشديد المثلثة هو اليابس من النبت .والأحوى : الموصوف بالحُوَّة بضم الحاء وتشديد الواو ، وهي من الألوان : سُمرة تقرب من السواد ."
      },
      {
        "resource_id": 91,
        "text": "وهذه الهداية العامة، التي مضمونها أنه هدى كل مخلوق لمصلحته، وتذكر فيها نعمه الدنيوية، ولهذا قال فيها: { وَالَّذِي أَخْرَجَ الْمَرْعَى } أي: أنزل من السماء ماء فأنبت به أنواع  النبات والعشب الكثير، فرتع فيها الناس والبهائم وكل حيوان  ، ثم بعد أن استكمل ما قدر له من الشباب، ألوى نباته، وصوح عشبه."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 5,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 94,
        "text": "( فجعله ) بعد الخضرة ( غثاء ) هشيما باليا ، كالغثاء الذي تراه فوق السيل . ( أحوى ) أسود بعد الخضرة ، وذلك أن الكلأ إذا جف ويبس اسود ."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 90,
        "text": "فجعله غثاء أحوى الغثاء : ما يقذف به السيل على جوانب الوادي من الحشيش والنبات والقماش . وكذلك الغثاء ( بالتشديد ) . والجمع : الأغثاء ، قتادة : الغثاء : الشيء اليابس . ويقال للبقل والحشيش إذا تحطم ويبس : غثاء وهشيم . وكذلك للذي يكون حول الماء من القماش غثاء كما قال :كأن طمية المجيمر غدوة من السيل والأغثاء فلكة مغزل وحكى أهل اللغة : غثا الوادي وجفأ . وكذلك الماء : إذا علاه من الزبد والقماش ما لا ينتفع به . والأحوى : الأسود أي إن النبات يضرب إلى الحوة من شدة الخضرة كالأسود . والحوة : السواد قال الأعشى :لمياء في شفتيها حوة لعس وفي اللثاث وفي أنيابها شنب وفي الصحاح : والحوة : سمرة الشفة . يقال : رجل أحوى ، وامرأة حواء ، وقد حويت . وبعير أحوى إذا خالط خضرته سواد وصفوة . وتصغير أحوى أحيو في لغة من قال أسيود . ثم [ ص: 17 ] قيل : يجوز أن يكون أحوى حالا من المرعى ، ويكون المعنى : كأنه من خضرته يضرب إلى السواد والتقدير : أخرج المرعى أحوى ، فجعله غثاء يقال : قد حوي النبت حكاه الكسائي ، وقال :وغيث من الوسمي حو تلاعه تبطنته بشيظم صلتان ويجوز أن يكون أحوى صفة ل غثاء . والمعنى : أنه صار كذلك بعد خضرته . وقال أبو عبيدة : فجعله أسود من احتراقه وقدمه والرطب إذا يبس اسود . وقال عبد الرحمن بن زيد : أخرج المرعى أخضر ، ثم لما يبس اسود من احتراقه ، فصار غثاء تذهب به الرياح والسيول . وهو مثل ضربه الله تعالى للكفار ، لذهاب الدنيا بعد نضارتها ."
      },
      {
        "resource_id": 92,
        "text": "فَجَعَلَهُ غُثَاءً أَحْوَى (5)وهو صفة { غثاء } لأن الغثاء يابس فتصير خضرته حُوّة .وهذا الوصف أحوى لاستحضار تغيُّر لونه بعد أن كان أخضر يانعاً وذلك دليل على تصرفه تعالى بالإنشاء وبالإنهاء . وفي وصف إخراج الله تعالى المرعى وجعله غُثاء أحوى مع ما سبقه من الأوصاف في سياق المناسبة بينها وبين الغرض المسوق له الكلام إيماء إلى تمثيل حال القرآن وهدايته وما اشتمل عليه من الشريعة التي تنفع الناس بحال الغيث الذي يَنبت به المرعَى فتنتفع به الدواب والأنعام ، وإلى أن هذه الشريعة تكمل ويبلغ ما أراد الله فيها كما يكمل المرعَى ويبلغ نُضجه حين يصير غثاء أحوى ، على طريقة تمثيلية مكنية رُمز إليها بذكر لازم الغيث وهو المرعى .وقد جاء بيان هذا الإِيماء وتفصيله بقول النبي صلى الله عليه وسلم « مثل ما بَعَثني الله به من الهُدى والعِلم كمثَل الغيث الكثير أصابَ أرضاً فكان منها نَقِيُّةٌ قَبِلَتْ الماء فأنبتت الكلأ والعُشُبَ الكثير ، وكانت منها أجادب أمسكت الماء ، فنفع الله بها الناس فشربوا وسَقوا وزرعوا » الحديث .ويجوز أن يكون المقصود من جملة : { فجعله غثاء أحوى } إدماج العبرة بتصاريف ما أودع الله في المخلوقات من مختلف الأطوار من الشيء إلى ضده للتذكير بالفناء بعد الحياة كما قال تعالى : { اللَّه الذي خلقكم من ضعف ثم جعل من بعد ضعف قوة ثم جعل من بعد قوة ضعفاً وشيبة يخلق ما يشاء وهو العليم القدير } [ الروم : 54 ] للإِشارة إلى أن مدة نضارة الحياة للأشياء تشبه المدة القصيرة ، فاستعير لعطف { جعله غثاء } الحرفُ الموضوع لعطف ما يحصل فيه حكم المعطوف بعدَ زمن قريب من زمن حصول المعطوف عليه ، ويكون ذلك من قبيل قوله تعالى : { إنما مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض مما يأكل الناس والأنعام إلى قوله : { فجعلناها حصيداً كأن لم تغن بالأمس } [ يونس : 24 ] ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 5{ فَجَعَلَہٗ غُثَآئً اَحْوٰی۔ } ”پھر اس کو کردیا سیاہ چورا۔“ یعنی اسی کے طے کردہ نظام کے تحت گھاس اور نباتات وغیرہ زمین سے اگتے ہیں اور پھر گل سڑ کر ختم ہوجاتے ہیں۔</p>"
      },
      {
        "resource_id": 91,
        "text": "{ فَجَعَلَهُ غُثَاءً أَحْوَى } أي: أسود أي: جعله هشيمًا رميمًا، ويذكر فيها نعمه الدينية."
      },
      {
        "resource_id": 166,
        "text": "<p>পরে তা ধূসর আবর্জনায় পরিণত করেন।</p>"
      },
      {
        "resource_id": 14,
        "text": "قال ابن عباس هشيما متغيرا وعن مجاهد وقتادة وابن زيد نحوه. قال ابن جرير وكان بعض أهل العلم بكلام العرب يرى أن ذلك من المؤخر الذي معناه التقديم وأن معني الكلام والذي أخرج المرعى أحوى: أي أخضر إلى السواد فجعله غثاء بعد ذلك ثم قال ابن جرير وهذا وإن كان محتملا إلا أنه غير صواب لمخالفته أقوال أهل التأويل."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( فَجَعَلَهُ غُثَاءً أَحْوَى ) يقول تعالى ذكره: فجعل ذلك المرعى غُثاء، وهو ما جفّ من النبات ويبس، فطارت به الريح؛ وإنما عُني به هاهنا أنه جعله هشيمًا يابسًا متغيرًا إلى الحُوَّة، وهي السواد من بعد البياض أو الخضْرة، من شدّة اليبس.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح، قال: ثني معاوية، عن عليّ، عن ابن عباس، في قوله: ( غُثَاءً أَحْوَى ) يقول: هشيمًا متغيرًاحدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى؛ وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا عن ابن أبي نجيح، عن مجاهد، قوله: ( غُثَاءً أَحْوَى ) قال: غثاء السيل أحوى، قال: أسود .حدثنا بشر، قال: ثنا يزيد، قال ثنا سعيد، عن قتادة، في قوله: ( غُثَاءً أَحْوَى ) قال: يعود يبسًا بعد خُضرة .حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله: ( فَجَعَلَهُ غُثَاءً أَحْوَى ) قال: كان بقلا ونباتًا أخضر، ثم هاج فيبُس، فصار غُثاء أحوى تذهب به الرياح والسيول. وكان بعض أهل العلم بكلام العرب يرى أن ذلك من المؤخَّر الذي معناه التقديم، وأن معنى الكلام: والذي أخرج المرعى أحوى: أي أخضر إلى السواد، فجعله غثاء بعد ذلك، ويعتلّ لقوله ذلك بقول ذي الرُّمة:حَــوَّاءُ قَرْحـاءُ أشْـراطِيَّةٌ وَكَـفَتْفِيهَــا الذِّهَــابُ وَحَفَّتْهَـا الْـبَرَاعِيمُ (4)وهذا القول وإن كان غير مدفوع أن يكون ما اشتدّت خضرته من النبات، قد تسميه العرب أسود، غير صواب عندي بخلافه تأويل أهل التأويل في أن الحرف إنما يحتال لمعناه المخرج بالتقديم والتأخير إذا لم يكن له وجه مفهوم إلا بتقديمه عن موضعه، أو تأخيره، فأما وله في موضعه وجه صحيح فلا وجه لطلب الاحتيال لمعناه بالتقديم والتأخير.------------------الهوامش :(4) البيت لذي الرمة ( ديوانه : 573 ) وأنشده أبو عبيدة في مجاز القرآن ( 186 ) قال : { فجعله غثاء أحوى } هيجه حتى يبس ، فجعله أسود من احتراقه . غثاء : هشيما . وهو في موضع آخر من شدة خضرته وكثرة مائه يقال له : أحوى ؛ قال ذو الرمة : \" قرحاء حواء ... \" البيت . وفي ( اللسان : قرح ) وروضة قرحاء : في وسطها نورًا أبيض . قال ذو الرمة يصف روضة : \" حواء قرحاء .... \" البيت \" . وقيل القرحاء : التي بدا نبتها : وفي ( اللسان : شرط ) وروضة أشراطية : مطرت بالشرطين ، قال ذو الرمة يصف روضة \" قرحاء حواء أشراطية ... \" يعني : روضة مطرت بنوء الشرطين ( وهما نجمان من برج الحمل ، يقال لهما قرن الحمل . ( اللسان : شرط ) . قال : وإنما قال : قرحاء ؛ لأن في وسطها نوارة بيضاء ، وقال : حواء : لخضرة نباتها . وفي ( اللسان : ذهب ) والذهبة ، بالكسر : المطرة . وقيل : المطرة : الضعيفة . وقيل : الجود ( بالفتح ) . والجمع : ذهاب . قال ذو الرمة يصف روضة : \" حواء قرحاء ... \" البيت . ا هـ . وفي ( اللسان : برعم ) البرعم والبرعوم والبرعومة ( بضم أولها ) كله : كم ثمر الشجر والنور . وقيل : زهرة الشجرة ، ونور النبت ، قبل أن يتفتح . وبرعمت الشجرة فهي مبرعمة . وتبرعمت : أخرجت برعمتها . قال : وفسر مؤرج قول ذي الرمة :* فيهـا الذهـاب وحفتهـا البراعيم *فقال : هي رمال فيها دارات تنبت البقل . ا هـ ."
      },
      {
        "resource_id": 170,
        "text": "Он низводит с небес воду и взращивает ею многие растения и травы, которыми наслаждаются люди, их скот и все остальные животные. А после того, как по предопределению Аллаха растения и травы достигают предела своего развития, они темнеют и сохнут. Затем Аллах упомянул о религии, которой Он одарил людей и основой которой является Священный Коран."
      },
      {
        "resource_id": 16,
        "text": "نَزِّه اسم ربك الأعلى عن الشريك والنقائص تنزيهًا يليق بعظمته سبحانه، الذي خلق المخلوقات، فأتقن خلقها، وأحسنه، والذي قدَّر جميع المقدرات، فهدى كل خلق إلى ما يناسبه، والذي أنبت الكلأ الأخضر، فجعله بعد ذلك هشيمًا جافًا متغيرًا."
      },
      {
        "resource_id": 93,
        "text": "والغثاء : هو اليابس الجاف من النبات الذى ترعاه المواشى .والأحوى : أى : المائل إلى السواد ، مأخوذ من الحُوَّة - بضم الحاء مع تشديد الواو المفتوحة - وهى لون يكون بين السواد والخضرة أو الحمرة . ووصف الغثاء بأنه أحوى ، لأنه إذا طال عليه الزمن ، وأصابته المياه ، اسود وتعفن فصار أحوى .أى : وهو - سبحانه - وحده ، الذى أنبت النبات الذى ترعاه الدواب ، حالة كون هذا النبات أخضر رطبا . ثم يحوله بقدرته - تعالى - بعد حين إلى نبات يابس جاف .وهذا من أكبر الأدلة المشاهدة ، على أنه - تعالى - يتصرف فى خلقه كما يشاء ، فهو القادر على تحويل الزرع الأخضر إلى زرع يابس جاف ، كما أنه قادر على إحياء الإِنسان بعد موته .فالمقصود من هذه الآيات الكريمة ، الإِرشاد إلى كمال قدرته ، وتنوع نعمه - سبحانه - ، حتى يزداد المؤمنون إيمانا على إيمانهم ، وحتى يعود الكافرون إلى رشدهم بعد هذا البيان الواضح الحكيم ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>পরে ওকে শুষ্ক খড়-কুটায় পরিণত করেছেন। [১]</p><p>[১] ঘাস শুকিয়ে গেলে তাকে غُثاء বলা হয়। أحوَى শব্দের অর্থ হল কালো করে দিয়েছেন। অর্থাৎ, তাজা-সবুজ ঘাসকে শুকিয়ে কালো করে দিয়েছেন।</p>"
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 6,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 94,
        "text": "\"سنقرئك\" سنعلمك بقراءة جبريل عليك، \"فلا تنسى\"."
      },
      {
        "resource_id": 16,
        "text": "سنقرئك -أيها الرسول- هذا القرآن قراءة لا تنساها، إلا ما شاء الله مما اقتضت حكمته أن ينسيه لمصلحة يعلمها. إنه - سبحانه- يعلم الجهر من القول والعمل، وما يخفى منهما."
      },
      {
        "resource_id": 157,
        "text": "<p>اب وہ خوشخبری آتی ہے جو آپ کے لئے ہے اور آپ کے بعد آپ کی امت کے لئے ہے۔</p><p>سنقرنک .................................... الذکری</p><p>اس عظیم خوشخبری کا آغاز ہوتا ہے کہ قرآن کے حفظ کرنے اور اسے باقی رکھنے کی ذمہ داری نبی ﷺ کے کاندھوں سے اتار دی جاتی ہے۔</p><p>سنقرءک فلا تنسی (6:87) ” ہم تمہیں پڑھوا دیں گے ، پھر تم نہیں بھولوگے “۔ لہٰذا آپ اپنے رب سے یہ کلام لیں اور بس۔ اس کو یاد کرادینا اللہ کا کام ہے۔ یہ بات فی الواقعہ نبی ﷺ کے لئے بڑی خوشخبری تھی۔ آپ حفظ قرآن کے لئے فکر مند ہوتے تھے۔ اب تو اس کی حفاظت کی جانب سے مطمئن کردیا گیا کیونکہ قرآن کریم ایک نہایت ہی عظیم کلام اور آپ اسے بہت ہی محبوب رکھتے تھے۔ آپ دل وجان سے قرآن پر فدا تھے۔ اور اس کی حفاظت کا بہت ہی خیال رکھتے تھے۔ اس پر حریص تھے اور اپنی عظیم اور بھاری ذمہ داری سمجھتے تھے۔ آپ ایک ایک آیت دہراتے تھے۔ جب جبرائیل (علیہ السلام) اسے لاتے تو آپ سننے کے ساتھ ساتھ تکرار کرتے اور زبان کو دہرانے میں لگادیتے یہاں تک کہ یہ بشارت آگئی اور آپ کو مطمئن کردیا گیا۔</p><p>پھر یہ آپ کے بعد آپ کی امت کے لئے بھی ایک خوشخبری ہے۔ امت بھی مطمئن ہوجاتی ہے کہ اس عقیدے کا اصل سرچشمہ ذات باری ہے اور اس کی حفاظت کا کفیل اور ذمہ دار بھی اللہ ہے۔ نبی کے دل میں بٹھانے کا ذمہ دار بھی اور بعد کے زمانے میں حفاظت کی ذمہ داری بھی۔ یہ اللہ کی بڑی مہربانی ہے اور اس دین کی عظمت سے اور اللہ کے ہاں اس کی اہمیت کا ثبوت ہے۔</p><p>اس موقعہ پر اور ایسے تمام مواقع پر ایک اٹل بات ضرور سامنے آتی ہے ۔ یہ ایک اٹل اور دائمی قانون ہے وہ یہ کہ اللہ کی مشیت بےقید ہے اور اللہ کی مشیت پر کوئی پابندی نہیں۔ آپ نہیں بھولیں گے الایہ کہ اللہ کچھ بھلانا چاہے۔ اگرچہ یہ پابندی خود اللہ کی طرف سے ہو ، لہٰذا اللہ کی مشیت بےقید اور اس پر کوئی قانونی قید ہے نہ کوئی وعدہ اسے پابند کرتا ہے۔ قرآن اس اصول کو پوری طرح محفوظ رکھتا ہے جیسا کہ اس سے قبل ہم ظلال القرآن میں اس کی وضاحت کرچکے ہیں۔ یہاں بھی اس اصول کو قائم رکھا گیا۔</p><p>الا ماشاء اللہ (7:87) ” سوائے اس کے جو اللہ چاہے “۔ اگرچہ یہ وعدہ سچا ہے کہ حضور نہ بھولیں گے مگر اللہ کی مشیت بھی بےقید ہے ، اگر اللہ چاہے تو ایسا ہوسکتا ہے تاکہ تمام معاملات اللہ کی مشیت کے دائرے میں رہیں اور لوگ اللہ کی مشیت ہی پر نگاہ رکھیں۔ اگرچہ کسی معاملے میں سچا وعدہ کیا گیا ہو۔ انسانی دل و دماغ کو اللہ کی مشیت کے ساتھ ہی لٹکے رہنا چاہئے۔</p><p>انہ یعلم .................... وما یخفی (7:87) ” وہ ظاہر کو بھی جانتا ہے اور جو کچھ پوشیدہ ہے اس کو بھی جانتا ہے “۔ یہ ہے اشارہ کہ اللہ پڑھائے گا ، حفظ کرائے گا اور نسیان نہ ہوگا الایہ کو وہ کچھ اور چاہے کیونکہ یہ تمام امور اللہ کی مخفی حکمت پر مبنی ہیں جو ظاہر اور خفیہ سب کو جانتا ہے اور معاملات کو ان کے تمام پہلوﺅں سے جانتا ہے اس لئے وہ تمام معاملات میں ایسے فیصلے کرتا ہے جس میں حکمت ہوتی ہے اور یہ حکمت اللہ کے بھرپور علم پر مبنی ہوتی ہے۔ اللہ کا علم کامل علم ہوتا ہے۔</p><p>اب دوسری خوشخبری ونیسرک للیسری (8:87) ” اور ہم تمہیں آسان طریقے کی سہولت دیتے ہیں “۔ یہ خوشخبری بھی رسول اللہ ﷺ کی ذات اقدس کے لئے ہے۔ اور آپ کے بعد آپ کی امت کے لئے بھی ہے۔ اور اس سے اس دین کا مزاج بھی معلوم ہوتا ہے۔ دعوت اسلامی کی حقیقت بھی معلوم ہوتی ہے کہ وہ انسانی زندگی میں کیا کردار ادا کرتی ہے اور اس کائنات میں اسلامی نظام زندگی کا مقام و مرتبہ کیا ہے۔ بظاہر تو یہ دولفظ ہیں۔</p><p>ونیسرک للیسری (8:87) لیکن ان کے اندر جو حقیقت بیان کی گئی وہ اسلامی نظریہ حیات اور اسلامی نظام اور شریعت کی ایک عظیم حقیقت ہے ، نیز وہ اس پوری کائنات کا بھی خلاصہ اور روح ہے۔ یہ حقیقت رسول اللہ کے مزاج کو ، اس کائنات کے مزاج اور اس دین کے مزاج سے ملادیتی ہے۔ یہ پوری کائنات دست قدرت نے بڑی آسانی سے بنادی ہے۔ یہ کائنات نہایت آسانی سے چل رہی ہے ، جس رخ پر اسے ڈال دیا گیا ہے وہ نہایت آرام اور سکون اور سہولت سے اسی رخ اور سمت پر چل رہی ہے۔ غرض یہ نور سے نکلی ہے اور ایسے حقائق کی طرف اشارہ کررہی ہے جو حدود وقیود سے ماوراء ہے۔</p><p>جس ذات کو اللہ آسانیاں میسر کردے وہ اپنی زندگی کی راہوں پر بسہولت چلتا ہے۔ وہ اس کائنات کے ساتھ چلتا ہے جس کا وجود اور جس کی ترتیب باہم متناسب ، جس کی حرکت متوازن اور جس کا رخ ایک طرف ہے یعنی اللہ کی طرف۔ ایسا شخص صرف ان قوتوں سے ٹکراتا ہے ، جو اس عظیم کائنات کے خطوط سے منحرف ہوں۔ ایسے لوگوں کا موازنہ اگر اس پوری کائنات سے کای جائے تو ان کا کوئی وزن نہیں رہتا۔ ایسا شخص جب چلتا ہے تو اس کی حرکت آسان ، لطیف اور نرم ہوتی ہے۔ اس کائنات کے ہم آہنگ دنیا کے واقعات سے ہم آہنگ ، دنیا کی چیزوں اور اشخاص کے ساتھ ہم آہنگ۔ اس کے ہاتھوں میں آسانی ہوتی ہے ، اس کی زبان میں یسر ہوتا ہے ، اس کے اقدامات آسان ہوتے ہیں ، اس کا عمل یسر ہوتا ہے۔ اس کے خیالات آسان ہوتے ہیں ، اس کی فکر آسان ہوتی ہے جو معاملات کو آسانی سے لیتا ہے ، معاملات کو نہایت آسانی سے لیتا ہے ، اپنے نفس کے لئے بھی آسان ہوتا ہے دوسروں کے لئے بھی آسان ہوتا ہے۔</p><p>یہ تھے رسول اللہ ﷺ ، اپنے تمام امور میں یسر ہی یسر۔ حضور اکرم ﷺ جب دوکاموں میں سے کسی ایک کا انتخاب کرتے تو آسان کو لیتے۔ یہ ہے روایت حضرت عائشہ ؓ کی۔ (بخاری ومسلم)</p><p>اور آپ ؓ ہی سے روایت ہے ” حضور اکرم ﷺ جب اپنے گھر میں تنہا ہوتے تو آپ تمام لوگوں سے نرم مزاج ہوتے ، مسکراتے ہوئے اور ہنستے ہوئے “۔ اور صحیح بخاری کی ایک روایت ہے : ” ایک لونڈی بھی رسول اللہ کا ہاتھ پکڑ لیتی اور جہاں چاہتی آپ کو لے جاتی “۔</p><p>لباس ، طعام ، بچھونے وغیرہ میں آپ کی جو سیرت تھی اس پر اگر غور کیا جائے تو معلوم ہوتا ہے کہ آپ سادی ، آسانی اور بےتکلفی کو پسند فرماتے تھے۔ ابو عبداللہ شمس الدین محمد ابن قیم الجوزیہ اپنی کتاب زاد المعاد میں لباس کے سلسلے میں آپ کی سیرت کے بارے میں لکھتے ہیں کہ آپ کی ایک پگڑی تھی جسے ” السحاب “ کہا جاتا تھا۔ یہ آپ نے حضرت علی ؓ کو دے دی تھی ، آپ پگڑی باندھتے اور اسے کے نیچے ٹوپی پہنتے ، کبھی آپ ٹوپی بغیر عمامہ کے پہنتے ، کبھی عمامہ بغیر ٹوپی کے بھی باندھتے۔ آپ جب عمامہ باندھتے تو اس کے شملے کو دونوں کاندھوں کے درمیان لٹکادیتے ، جیسا کہ مسلم شریف کی روایت میں ہے۔ حضرت عمر ابن حریث سے روایت ہے کہ انہوں نے رسول اللہ ﷺ کو منبر پر دیکھا اور آپ نے سیاہ عمامہ باندھا ہوا تھا اور آپ نے اس کا ایک طرف دونوں کاندھوں کے درمیان لٹکایا ہوا تھا۔ اور مسلم میں حضرت جابر سے یہ بھی ہے ، بالوں کی لٹ کی طرح۔</p><p>اس سے معلوم ہوا کہ شملہ ہمیشہ کاندھوں کے درمیان سے نہ لٹکاتے تھے۔ کہا جاتا ہے آپ مکہ میں داخل ہوئے ، آپ نے جنگی لباس پہنا ہوا تھا اور آپ کے سر پر خود تھا۔ لہٰذا ہر موقعہ کی مناسبت سے لباس پہنتے تھے۔</p><p>ایک دوسری فصل میں وہ فرماتے ہیں کہ بہترین طریقہ رسول اللہ ﷺ کا طریقہ ہے جو طریقہ آپ نے رائج فرمایا اور جس کا حکم دیا اور جس کی ترغیب دی اور اس پر مداومت کی۔ لباس میں آپ کا طریقہ یہ تھا کہ جو لباس میسر ہوتا آپ وہ پہنتے کبھی اونی ، کبھی روئی ، کبھی کتان کا۔ آپ نے یمنی چادر بھی پہنی ، سبزچادر بھی پہنی ، حلہ ، قبا اور قمیص بھی زیت تن فرمائی۔ پاجامہ ، ازار اور چادر بھی پہنی۔ چمڑے کے موزے اور جوتے۔ یہ سب چیزیں آپ نے استعمال فرمائیں اور عمامہ کا شملہ کبھی آپ نے پیچھے سے لٹکایا اور کبھی نہ لٹکایا “۔</p><p>اور کھانے کے بارے میں آپ کی سیرت یہ تھی کہ آپ کسی موجود کھانے کو رد نہ فرماتے اور نہ غیر موجود کے بارے میں تکلف فرماتے ، پاکیزہ چیزوں میں سے جو بھی آپ کو پیش کی گئی آپ نے اسے تناول فرمایا۔ الایہ کہ کسی چیز کو آپ کی طبیعت نہ چاہتی ہو تو آپ نے بغیر حرام قرار دینے کے اسے چھوڑ دیا۔ آپ نے کسی کھانے میں کبھی عیب نہیں نکالا۔ اگر چاہت ہوتی تو تناول فرماتے ورنہ چھوڑ دیتے ، جس طرح آپ نے گوہ کو تناول نہ فرمایا کیونکہ آپ اس کے کھانے کے عادی نہ تھے لیکن امت پر اسے حرام بھی قرار نہیں دیا ، بلکہ اسے آپ کے دستر خوان پر آپ کے دیکھتے ہوئے کھایا گیا۔ آپ نے حلوی اور شہد تناول فرمایا۔ ان کو آپ بہت پسند فرماتے تھے۔ آپ نے تازہ اور خشک کھجوروں کو تناول فرمایا۔ آپ نے خالص دودھ بھی پیا اور ملا ہوا بھی۔ آپ نے شہد اور ستو پانی کے ساتھ تناول فرمائے۔ آپ نے کھجوروں کا صاف پانی پیا ، آپ نے حریرہ استعمال کیا۔ یہ ایک قسم کی کھیر ہے جو دودھ اور آٹے سے بنتی ہے۔ آپ نے تروتازہ کھجور کے ساتھ ککڑی کھائی ، پنیر تناول فرمایا ، کھجور کے ساتھ روٹی کھائی ، سر کے ساتھ روٹی کھائی۔ آپ نے پکا ہوا کدو کھایا اور اس کو آپ بہت پسند فرماتے تھے۔ آپ نے ابالا ہوا کدو بھی کھایا ، گھی کے ساتھ ثرید کھایا ، پنیر کھایا۔ تیل کے ساتھ روٹی کھائی ، خربوزوں کو تازہ کھجوروں کے ساتھ اور کھجوروں کو مکھن کے ساتھ کھایا اور یہ آپ کو بہت پسند تھا۔ کسی پاکیزہ چیز کو آپ ردنہ کرتے اور نہ بتکلف خواہش کرتے بلکہ آپ کا طریقہ یہ تھا جو میسر ہو وہ تناول فرماتے ، اگر کوئی چیز نہ ملتی تو صبر کرتے “۔</p><p>سونے اور بیدار ہونے کے بارے میں آپ کی سنت یہ تھی۔ کبھی اپنے بستر پر سوتے ، کبھی کھال پر ، کبھی چٹائی پر ، کبھی زمین پر ، کبھی تخت پر ، کبھی سیاہ کمبل پر سوتے “۔</p><p>آپ کے فرامین سے معلوم ہوتا ہے کہ تمام امور میں نرمی سے کام لیاجائے ، جن میں اسلامی نظریہ حیات اور اسکے تقاضے بھی آتے ہیں۔ اس سلسلے میں آپ کی ہدایات بہت زیادہ ہیں ، سب کو یہاں لانا مشکل ہے ، چند پیش خدمت ہیں : ” یہ دین آسان ہے ، جو شخص اس دین کے ساتھ کشتی کرے گا وہ شکست کھاجائے گا “ (بخاری) ۔ ” اپنے نفسوں پر سختی مت کرو ، تم پر سختی کی جائے گی ، ایک قوم نے اپنے آپ کو سختیوں میں ڈالا تو اس پر سختی کی گئی “ (ابوداﺅد) ۔ ” جو شخص اپنی سواری پر سختی کرتا ہے ، وہ نہ تو سفر طے کرسکتا ہے اور نہ ہی اس کی سواری زندہ رہتی ہے “ (بخاری۔ ” آسانیاں کرو سختی نہ کرو “ (بخاری ومسلم) ۔</p><p>اور معاملات کے بارے میں آپ کی ہدایات یہ ہیں :” اللہ رحم کرے ، اس شخص پر جو فروخت کرے تو نرمی اور فراغ دلی سے ، خریدے تو نرمی اور فراخ دلی سے اور تقاضا کرے تو بھی نرمی اور فراخ دلی سے “ (بخاری) ۔” مومن آسان اور نرم ہوتا ہے “ (بیہقی) ۔” مومن لوگوں سے مانوس ہوتا ہے اور لوگ اس سے مانوس ہوتے ہیں “ (دارقطنی) ۔” اللہ کے ہاں مبغوض ترین شخص وہ ہے جو جھگڑالو اور لڑنے والا ہو “ (بخاری ومسلم) ۔</p><p>آپ کی سیرت میں اس بات کی روشن مثالیں ملتی ہیں کہ آپ سختی اور مشکل کو پسند نہ فرماتے تھے ، یہاں تک کہ نام اور چہرے کے خدوخال میں بھی۔ جس سے معلوم ہوتا ہے کہ آپ کا مزاج کیسا تھا ، اور آپ کے ساتھ اللہ کا سلوک کیسا تھا ، اور کس طرح اللہ نے آپ کو آپ کی ساخت اور مزاج کے اعتبار سے سہل پسند بنایا تھا اور اس کی طرف آپ کی رہنمائی فرمائی تھی۔ سعید ابن مسیب اپنے والد سے روایت فرماتے ہیں کہ وہ نبی ﷺ کے پاس آئے ، تو حضور ﷺ نے دریافت فرمایا تمہارا نام کیا ہے۔ والد نے کہا میرا نام حزن ہے (یعنی سخت دشوار) تو آپ نے فرمایا نہیں آپ ” سہل “ ہیں۔ تو انہوں نے کہا میں اس نام کو نہیں بدلوں گا جو میرے باپ نے رکھا ہے۔ ابن مسیب کہتے ہیں اس کے بعد ہمارے خاندان میں برابر سختی رہی “ (بخاری) ۔ ” حضرت ابن عمر ؓ سے روایت ہے کہ آپ نے عاصیہ کا نام بدل کر جمیلہ رکھ دیا “ (مسلم) ۔ اور آپ کی مشہور حدیث ہے ” یہ بات نیکی کا حصہ ہے کہ تم اپنے بھائی سے ہنس مکھ ہوکر ملو “ (ترمذی) ۔</p><p>غرض آپ اس قدر حساس تھے کہ آپ کو ناموں ، چہرے کے خدوخال میں بھی درشتی پسند نہ تھی اور آپ نرمی اور آسانی کی طرف مائل ہوتے تھے۔ چناچہ آپ کی پوری سیرت نرمی ، یسر ، سہولت ، اور سہل برتاﺅ پر مشتمل ہے۔ آپنے ہمیشہ معاملات اور لین دین میں نرمی سے کام لیا۔ ایک مثال سے واضح ہوتا ہے کہ آپ اپنے برتاﺅ کی وجہ سے لوگوں کی اصلاح کس طرح کرتے تھے۔</p><p>” ایک دن آپ کے پاس ایک دیہاتی آیا ، وہ کوئی چیز مانگ رہا تھا۔ آپ نے اسے دے دی تو آپ نے اس سے پوچھا : کیا میں نے تمہارے ساتھ اچھا سلوک کیا ؟ تو اس نے کہا : نہیں ! تم نے اچھا سلوک نہیں کیا۔ مسلمانوں کو سخت غصہ آیا ، اور وہ اس کی طرف لپکے۔ آپ نے اشارہ فرمایا کہ کچھ نہ کہو۔ آپ پھر گھر میں داخل ہوئے اور کچھ مزید دیا اور پھر پوچھا : کیا میں نے اچھا سلو کیا ؟ تو اس نے کہا : ” ہاں “۔ اللہ آپ کو جزادے۔ آپ اچھے خاندان کے ہیں۔ اس کو نبی ﷺ نے فرمایا تم پہلے جو بات کی وہ تمہیں معلوم ہے جس کی وجہ سے میرے ساتھی خفا ہوئے اور ان کے دل صاف نہیں۔ تو اگر تم پسند کرو تو یہ باتیں جو تم نے میرے سامنے کی ہیں ان کے سامنے بھی کرو ، تاکہ ان کے دلوں میں تم پر جو غصہ ہے ، وہ دور ہوجائے۔ تو اس نے کہا ” اچھا “۔ دوسرے دن وہ پھر آیا۔ اور حضور ﷺ نے فرمایا کہ اس دیہاتی نے کل جو کچھ کہا وہ تمہیں معلوم ہے ، ہم نے اسے مزید کچھ دیا۔ اب اس کا خیال ہے کہ وہ راضی ہوگیا ہے۔ بتاﺅ بھائی کیا یہ درست ہے ؟ تو دیہاتی نے کہا : ” ہاں اللہ آپ کو جزائے خیر دے۔ آپ اچھے خاندان سے ہیں “۔ اس پر حضور اکرم ﷺ نے فرمایا : ” میری مثال اور اس دیہاتی کی مثال اس طرح ہے کہ اس شخص کی اونٹنی بگڑ گئی۔ لوگوں نے اس کا پیچھا کیا تو وہ اور بھاگنے لگی۔ تو مالک نے لوگوں کو چلا کر کہا : ” میری ناقہ کو اور مجھے چھوڑ دو میں اس کے ساتھ زیادہ نرم سلوک کرتا ہوں اور اس کے مزاج کو اچھی طرح جانتا ہوں “۔ چناچہ اس کا مالک اس کے سامنے سے آیا۔ اور زمین سے کچھ گھاس پھونس جمع کرکے اس کے لئے لے آیا۔ اور اسے آہستہ آہستہ واپس لایا ۔ یہاں تک کہ وہ اپنے مقام پر آکر بیٹھ گئی۔ اس نے اس کجاوا کسا اور سوار ہوگیا۔ جب اس شخص نے جو کچھ کہا تھا اور تم اس پر لپکے تھے تو میں اگر تمہیں چھوڑ دیتا اور تم اسے قتل کردیتے تو وہ جہنم میں چلا جاتا “۔</p><p>یہ تھا حضور ﷺ کا طرز عمل ان لوگوں کے ساتھ جو نہایت ہی سخت اور بدکنے والے تھے ، اس قدر سادگی اور آسانی کے ساتھ اور اللہ کی ایسی توفیق کے ساتھ ، آپ ان کے ساتھ حسن سلوک کرتے تھے۔ اس قسم کے بیشمار نمونے آپ کی سیرت میں موجود ہیں۔ یہی وہ بات ہے جو اس آیت میں بطور خوشخبری آپ کو کہی گئی ہے اور آپ کو اپنی پوری زندگی میں ، آپ کو دعوت میں اور آپ کے معاملات میں اس کی آپ کو توفیق دی گئی۔</p><p>ونیسرک للیسری (8:87) ” ہم آسان دین پرچلنے کو آپ کے لئے آسان کردیں گے “۔</p><p>آپ کی ذات گرامی جو محبوب خلائق اور بلند اخلاق کی مالک تھی اور جسے ایک آسان دین کی طرف آسانی سے رہنمائی کی گئی تھی تو آپ نے لوگوں کے ساتھ ایسا ہی برتاﺅ کیا۔ اور اسی انداز سے انسانیت کو دعوت دی ، آپ کا مزاج ہی اس طرح بن گیا ، اور آپ کی ماہیت ہی دین سہل میں بدل گئی اور آپ اسی امانت کبریٰ کے اٹھانے کے قابل ہوگئے ، یہ امانت تو بہت بڑی اور بھاری تھی مگر اللہ نے اس ذمہ داری کی توفیق آپ کو دی اور آپ اس بھاری ذمہ داری اٹھانے کے قابل ہوگئے۔ آپ نے پسندیدہ طریقے سے کام کیا اور اچھے انداز سے محنت کی۔ اور خوشی اور شرح صدر سے کام کیا۔</p><p>حضور اکرم ﷺ کی تعریف میں اور آپ کے کام کی نوعیت کی تشریح کے بارے میں قرآن کریم میں کئی آیات بھی نازل ہوئی ہیں۔</p><p>وما ارسلنک .................... للعلمین (الانبیائ :108) ” اور ہم نے تمہیں اہل جہاں کے لئے صرف رحمت بنا کر بھیجا ہے “۔</p><p>الذین ........................................ علیھم (157:7) ” وہ لوگ جو اس نبی امی کی پیروی کرتے ہیں ، جسے وہ اپنے ہاں تورات وانجیل میں لکھا ہوا پاتے ہیں ، انہیں وہ معروف کا حکم دیتے ہیں ، برائی سے روکتے ہیں ، پاکیزہ چیزیں ان کے لئے حلال کرتے ہیں ، ناپاک چیزیں ان پر حرام ٹھہراتے ہیں ، اور ان کے وہ بوجھ اور طوق جو ان کی گردنوں میں پڑے ہوئے ہیں ، ان سے اتارتے ہیں “۔ لہٰذا رسول خدا ﷺ کی بعثت پوری انسانیت کے لئے رحمت تھی۔ آپ تشریف لائے اور آپ نے لوگوں کے کاندھوں سے بوجھ اتارے اور ان کے گلوں سے وہ طوق اتارے جو انہوں نے ڈال رکھے تھے اور یہ اس لئے کہ انہوں نے دین میں سختی کی تو اللہ کی طرف سے بھی ان پر سختی کی گئی۔ آپ جو دین اور جو دعوت لے کر آئے اس کے بارے میں بھی قرآن کہتا ہے :</p><p>ولقد یسرنا ........................ من مد کر (22:54) ” اور ہم نے قرآن کو نصیحت کے لئے آسان بنایا ہے ، تو ہے کوئی نصیحت حاصل کرنے والا “۔ اور ایک دوسری جگہ ہے۔</p><p>وماجعل .................... من حرج (78:22)</p><p>” اور اللہ نے تم پر دین میں کوئی تنگی نہیں رکھی “۔ اور سورة بقرہ میں ہے۔</p><p>لا یکلف .................... وسعھا (286:2) ” اللہ تعالیٰ کسی پر اس کی طاقت سے زیادہ ذمہ داری نہیں ڈالتا “۔ اور مائدہ میں ہے۔</p><p>مایرید ............................ لیطھرکم (6:5) ” اللہ تعالیٰ دین کے سلسلے میں تم پر کوئی تنگی نہیں کرنا چاہتا ، وہ تو تمہیں پاک کرنا چاہتا ہے “ غرض یہ آخری رسالت سہل ہے اور انسانی طاقت کی حدود میں ہے۔ اللہ نے لوگوں کو تنگی میں مبتلا نہیں کیا۔ نہ اللہ کا مقصود یہ ہے کہ لوگوں کی مشقت میں ڈالا جائے ، اسلام کی روح میں بھی سہولت ہے اور اسلام کے احکام میں بھی سہولت کو مدنظر رکھا گیا ہے۔ غرض یہ ایک فطری دین ہے۔ سورة روم میں ہے۔</p><p>فطرت .................... علیھا (30:30) ” جس فطرت پر اللہ نے لوگوں کو پیدا کیا ہے ، یہ اللہ کی بنائی ہوئی فطرت ہے “۔</p><p>اور جب انسان اس عقیدے کے ساتھ زندگی بسر کرنا چاہے تو وہ اس کو بہت آسان پاتا ہے۔ وہ دیکھتا ہے کہ اس میں انسانی قوت کو ملحوظ رکھا گیا ہے۔ اس میں انسان کے مختلف حالات کی رعایت بھی کی گئی ہے۔ اس میں ان حالات کا بھی خیال رکھا گیا ہے جو مختلف قسم کے معاشروں میں انسان کو پیش آتے ہیں۔ اسلامی عقیدہ بذات خود نہایت ہی سہل اور قابل فہم ہے۔ بس ایک الٰہ کا عقیدہ ہے اس جیسی کوئی چیز نہیں ہے۔ تمام مخلوقات کو اسی الٰہ نے بنایا ہے اور اسی الٰہ نے ان کو ان کی پیدائش کا مقصد بھی بتایا ہے۔ پھر اس نے رسول بھیجے ہیں اور ان رسولوں نے لوگوں کو ان کا مقصد وجود بتایا ہے۔ رسولوں نے لوگوں کو اپنے خلق کی طرف لوٹایا۔ اس کے بعد جو فرائض بھی ان پر عائد کیے گئے وہ اسی نظریہ سے نکلتے ہیں ، نہایت سیدھے سادھے طریقے سے جس میں کوئی ٹیڑھ نہیں ہے۔ اور لوگوں کو یہ حکم دیا کہ وہ ان میں سے جن احکام پر بھی عمل کرسکتے ہیں بغیر سختی اور مشقت کے عمل کریں۔ حضور ﷺ نے فرمایا : ” جب میں تمہیں حکم دوں تو اس حکم کی تعمیل اس قدر کرو جس قدر تمہاری طاقت ہو اور جس کام سے میں روکوں ، رک جاﺅ“ (بخاری ومسلم) ۔ اور جن چیزوں سے منع کیا گیا ہے ، ان میں سے بھی حالت اضطرار مستثنیٰ ہے۔</p><p>الاما .................... الیہ (119:6) ” الایہ کہ تم ان کے لئے مضطرہوجاﺅ“۔</p><p>یوں رسول آخرالزمان ﷺ کا مزاج ان کی رسالت اور دعوت کے ساتھ گھل مل گیا ہے ، اور اس دعوت اور داعی کی حقیقت ایک ہوگئی ، خصوصاً اس بنیادی صفت اور اس ممتاز رنگ میں ۔ اسی طرح اس امت کو بھی امت وسط اور سہل کہا گیا جس کے پاس رسول خدا یہ پیغام لے کر آئے تھے۔ یہ ایسی امت تھی جس پر رحمت ہوئی اور یہ رحمت اور محبت کا پیغام لے کر نہایت آسان اور سیدھا راستہ لوگوں کو بتانے کے لئے اٹھی۔ اس طرح کہ اس امت کا مراج آفاقی اور کائناتی مزاج بن گیا۔ اور اس کے مزاج اور اس وسیع کائنات کے مزاج کے اندر گہری ہم آہنگی پیدا ہوگئی۔</p><p>پھر ذرا اس کائنات کا مطالعہ کرو ، اس کی حرکت کا بہاﺅ کس قدر سہل ، رواں دواں ہے اور اس میں کوئی ٹکراﺅ اور تصادم نہیں ہے۔ اربوں کھربوں اجرام فلکی اس کائناتی فضا میں تیرتے پھرتے ہیں۔ نہایت ہم آہنگی کے ساتھ اپنے اپنے مدار میں بہتے چلے جارہے ہیں ، نہایت تناسق ، خوشگوار کشش کے ساتھ جس کے اندر کوئی اضطراب نہیں۔ کوئی ایک بھی اپنے مدار سے ادھر ادھر نہیں ہوتا۔ اربوں کھربوں زندہ مخلوقات اس کرہ ارض پر زندگی بسر کررہی ہے اور اپنے قریبی دور کے مقاصد پورے کررہی ہے اور یہ زندگی نہایت پختگی اور زبردست انتظام کے ساتھ گزر رہی ہے۔ اور ہر چیز اپنا مقصد تخلیق نہایت ہی سہولت سے پورا کررہی ہے ، اور اپنی متعین راہ پر اپنی منزل کی طرف گامزن ہے۔ اس کائنات میں اربوں کھربوں حرکات واقعات ، اور حالات چل رہے ہیں ، مجتمع بھی اور متفرق بھی۔ اور یہ سب ایک راہ پر جارہے ہیں جس طرح سازوں کا ایک گروپ اپنے اپنے آلہ سے بالکل مختلف آواز نکال رہا ہوتا ہے اور یہ سب مختلف آوازیں ایک ہی راگ تشکیل کرکے ایک طویل نغمہ بناتی ہیں۔ حقیقت یہ ہے کہ اس کائنات کے وجود ، اسلامی نظام زندگی اور سیرت رسول ﷺ کے درمیان اور امت مسلمہ کے مزاج کے درمیان ایک زبردست ہم آہنگی ہے ، کیونکہ یہ اللہ کی صنعت ہے ، اللہ کی بتائی ہوئی فطرت ہے ، اور اللہ کا راگ ہے ، اور وہ نہایت ہی حکیم صنعت کار ہے۔</p><p>فذکر .................... الذکری (9:87) لہٰذا نصیحت کرو اگر نصیحت نافع ہو “۔ اللہ نے نبی ﷺ کو پڑھایا تو ضمانت دی کہ آپ نہ بھولیں گے ، الا ماشاء اللہ۔ پھر اللہ نے نبی ﷺ کو بسہولت آسان طریقے پر چلنے کی سہولت فراہم کی تاکہ آپ اس عظیم امانت کا بار آسانی سے اٹھائیں اور لوگوں کو یاددہانی کرائیں۔ اسی لئے آپ کو تیار فرمایا اور خوشخبری دی گئی اور کہا کہ جب بھی موقعہ ملے یاددہانی کرائیں ، جب بھی آپ دلوں کے اندر بات اتارنے کی راہ پائیں ، اور تبلیغ کے ذرائع میسر ہوں۔ یہاں کہا گیا ہے۔</p><p>ان نفعت الذکری (9:87) ” اگر نصیحت فائدہ دے “۔ جب بھی یاددہانی کرائیں فائدہ ہی ہوتا رہے۔ کبھی ایسا نہیں ہوتا ہے کہ نصیحت سے کسی کو کم یا زیادہ فائدہ نہ ہو ، کبھی کوئی نسل استفادہ کرنے والوں سے خالی نہیں ہوئی۔ اگرچہ زمانہ کے اندر فساد عام ہو ، دلوں پر زنگ آگیا ہو ، اور ان پر پردے پڑگئے ہوں بہرحال تذکیر سے فائدہ ہوتا ہی ہے۔</p><p>جب ہم ان آیا کی اس ترتب پر غور کرتے ہیں تو ہمیں رسالت کی عظمت کا پتہ چلتا ہے اور یہ معلوم ہوتا ہے کہ یہ امانت کس قدر عظیم اور اہم ہے۔ کہ اس فریضہ کی ادائیگی کے لئے اللہ نے آسان طریقے کی رہنمائی فرمائی اور آسانیاں بہم پہنچائیں ، پہلے یاد کروایا ، پھر اس پیغام کی حفاظت کی ذمہ داری اٹھائی تاکہ رسول خدا اطمینان سے یاددہانی کا فریضہ سرانجام دیں اور پھر حکم دیا کہ آپ یاددہانی کرائیں اگر مفید ہو ، یہ سب سہولیات دے کہ آپ کو کام پر لگایا اور یہ دراصل عظیم زاد راہ تھا۔</p><p>جب رسول خدا ﷺ نے اپنا یہ فریضہ پورا کردیا ، تو آپ کی ڈیوٹی ختم ہوگئی۔ پھر لوگ جانیں اور ان کا کام۔ تبلیغ وتذکیر کے بعد لوگوں کے مسالک ، ان کے اہداف اور انجام مختلف ہوجاتے ہیں۔ اور یہ اللہ ہے جو کسی کو ایک انجام تک پہنچاتا ہے اور کسی کو دوسرے تک ۔ جس طرح انہوں نے رویہ اختیار کیا ، قبول کرنے کا یارد کرنے کا۔</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>سَنُقْرِئُكَ فَلَا تَنسَىٰ ۔ إِلَّا مَا شَاءَ اللَّـهُ (We will make you recite, then you will not forget, except that which Allah wills. Indeed He knows what is manifest and what is hidden....87:6-7). In the preceding verses, Allah depicted the manifestation of His Omnipotence and [ profound ] wisdom. Thereafter, a few guidelines are given to the Holy Prophet ﷺ regarding his prophetic obligation. Before putting forth the guidelines, he is given the cheerful news of making his task easier. When the Qur'an was revealed initially, and as Jibra'il (علیہ السلام) began to recite, the Holy Prophet ﷺ made haste to repeat, lest any word or sentence should be lost. He was, therefore, told not to make haste with it, and to wait until the angel had delivered the whole message, and then to repeat the words of the revelation, being assured that it was a Divine arrangement, and that nothing would be lost. On this occasion, he is still more plainly told: 'then you will not forget, except that which Allah wills.'</p><p>While Allah made the Holy Prophet ﷺ remember all of the Qur'an, there were certain verses which Allah made him forget, because they had been abrogated. This was done by Allah's command, and is not done without reason. There are several ways in which this is done. One way of doing this is that a second clear injunction is revealed contrary to the first injunction. Another way of abrogating a particular verse is to obliterate a verse from the memory of the Holy Prophet\tﷺ and the memory of all other Muslims, as stated in:</p><p>مَا نَنسَخ مِن آیَتٍ اَو نُنسِھَا</p><p>'Whenever We abrogate a verse or cause it to be forgotten. [ 2:106] '</p><p>Some scholars interpret the exceptive sentence 'except that which Allah wills' differently. They say that for some reason Allah blots out temporarily a verse from Holy Prophet's ﷺ memory, but he may remember it again, in support of which the following narrative may be adduced: One day the Holy Prophet ﷺ recited a Surah, but omitted one of the verses. Sayyidna Ubayy Ibn Ka` b ؓ ، one of the Prophet's scribes, was present. He thought it might have been abrogated. On inquiry, the Holy Prophet said that it was not abrogated, but that it was omitted by mistake. [ Qurtubi ]. In this interpretation, it may be summarised that forgetting a verse temporarily, and then remembering it again, does not go against the promise made in this verse. [ In fact, it is an exception from this promise.] Allah knows best!</p>"
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 166,
        "text": "<p>শীঘ্রই আমরা আপনাকে পাঠ করাব, ফলে আপনি ভুলবেন না [১] ,</p><p>[১] পূর্ববর্তী আয়াত সমূহে আল্লাহ্ তা‘আলা মানুষের জন্য তাঁর যে সমস্ত দুনিয়াবী নেয়ামত প্রদান করেছেন সেগুলোর কিছু বর্ণনার পর এখন কিছু দ্বীনী নেয়ামত বর্ণনা করছেন। তন্মধ্যে প্রথমেই হচ্ছে কুরআন। [সা‘দী] এ আয়াতে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম-কে সুসংবাদ জানানো হচ্ছে যে, আল্লাহ্ তাকে এমন জ্ঞান দান করবেন যে, তিনি কুরআনের কোন আয়াত বিস্মৃত হবেন না। আপনার কাছে কিতাবের যে ওহী আমরা পাঠিয়েছি আমরা সেটার হিফাযত করব, আপনার অন্তরে সেটা গেঁথে দেব, ফলে তা ভুলে যাবেন না। [ইবন কাসীর; সা‘দী]</p>"
      },
      {
        "resource_id": 92,
        "text": "سَنُقْرِئُكَ فَلَا تَنْسَى (6) قد عرفت أن الأمر بالتسبيح في قوله : { سبح اسم ربك الأعلى } [ الأعلى : 1 ] بشارة إجمالية للنبيء صلى الله عليه وسلم بخير يحصل له ، فهذا موقعُ البيان الصريح بوعده بأنه سيعصمه من نسيان ما يُقرئه فيبلِّغُه كما أوحي إليه ويحفظه من التفلت عليه ، ولهذا تكون هذه الجملة استئنافاً بيانياً لأن البشارة تنشىء في نفس النبي صلى الله عليه وسلم ترقباً لوعد بخير يأتيه فبشره بأنه سيزيده من الوحي ، مع ما فرَّع على قوله : { سنقرئك } من قوله : { فلا تنسى } .وإذ قد كانت هذه السورة من أوائل السور نزولاً . وقد ثبت في الصحيح عن ابن عباس : «أن النبي صلى الله عليه وسلم كان يعالج من التنزيل شِدة إذا نزل جبريل ، وكان ممَّا يحرك شفتيْه ولسانَه ، يريد أن يحفظه ويخشى أن يتفلت عليه فقيل له : { لا تحرّك به لسانك لتعجل به إن علينا جمعه وقرآنه } [ القيامة : 16 ، 17 ] ، إنّ علينا أن نجمعه في صدرك وقرآنه أن تقرأه : { فإذا قرأناه فاتبع قرآنه } [ القيامة : 18 ] . يقول : إذا أُنزل عليك فاستمع ، قال : فكان إذا أتاه جبريل أطرق فإذا ذهب قرأه كما قرأ جبريل كما وعده الله» وسورة القيامة التي منها { لا تحرك به لسانك } نزلت بعد سورة الأعلى فقد تعين أن قوله : سنقرئك فلا تنسى } وعد من الله بعَونه على حفظ جميع ما يُوحى إليه .وإنما ابتدىء بقوله : { سنقرئك } تمهيداً للمقصود الذي هو : { فلا تنسى } وإدماجاً للإِعلام بأن القرآن في تزايد مستمر ، فإذا كان قد خاف من نسيان بعض ما أُوحي إليه على حين قِلَّته فإنه سيتتابع ويتكاثر فلا يخش نسيانه فقد تكفل له عدم نسيانه مع تزايده .والسين علامة على استقبال مدخولها ، وهي تفيد تأكيد حصول الفعل وخاصةً إذا اقترنت بفعل حاصل في وقت التكلم فإنها تقتضي أنه يستمر ويتجدد وذلك تأكيد لحصوله وإذ قد كان قوله : { سنقرئك فلا تنسى } إقراءً ، فالسين دالة على أن الإِقراء يستمر ويتجدد .والالتفات بضمير المتكلم المعظَّم لأن التكلّم أنسب بالإِقبال على المبشَّر .وإسناد الإقراء إلى الله مجاز عقلي لأنه جاعل الكلام المقروء وآمر بإقرائه .فقوله : { فلا تنسى } خبر مراد به الوعد والتكفل له بذلك .والنسيان : عدم خطور المعلوم السابق في حافظة الإنسان برهة أو زماناً طويلاً ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 165,
        "text": "<p>অচিরেই আমি তোমাকে পাঠ করাব, ফলে তুমি ভুলবে না।[১]</p><p>[১] জিবরীল (আঃ) যখন অহী (আল্লাহর প্রত্যাদেশ) নিয়ে আসতেন, তখন তা রসূল (সাঃ) তাড়াতাড়ি পড়তে শুরু করতেন; যাতে করে ভুলে না যান। আল্লাহ তাআলা বললেন, এত তাড়াতাড়ি করার প্রয়োজন নেই। অবতীর্ণকৃত অহী তোমাকে পাঠ করাবার দায়িত্ব আমার। অর্থাৎ, তোমার মুখে তা সঞ্চালিত করব; ফলে তুমি তা ভুলবে না। তবে আল্লাহ যা চাইবেন, তা ভুলে যাবে। কিন্তু আল্লাহ তাআলা এইরূপ চাননি। এই জন্য তাঁর সমস্ত মুখস্থ ছিল। কেউ কেউ বলেন, এর অর্থ হল এই যে, যা আল্লাহ মনসূখ (রহিত) করতে চাইবেন, তা তোমাকে ভুলিয়ে দিবেন। <em>(ফাতহুল ক্বাদীর)</em></p>"
      },
      {
        "resource_id": 91,
        "text": "{ سَنُقْرِئُكَ فَلَا تَنْسَى } أي: سنحفظ ما أوحينا إليك من الكتاب، ونوعيه قلبك، فلا تنسى منه شيئًا، وهذه بشارة كبيرة من الله لعبده ورسوله محمد صلى الله عليه وسلم، أن الله سيعلمه علمًا لا ينساه."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( سَنُقْرِئُكَ فَلا تَنْسَى إِلا مَا شَاءَ اللَّهُ ) يقول تعالى ذكره: سنقرئك يا محمد هذا القرآن فلا تنساه، إلا ما شاء الله.ثم اختلف أهل التأويل في معنى قوله: ( فَلا تَنْسَى إِلا مَا شَاءَ اللَّهُ ) فقال بعضهم: هذا إخبار من الله نبيه عليه الصلاة والسلام أنه يعلمه هذا القرآن ويحفظه عليه، ونهي منه أن يعجل بقراءته كما قال جلّ ثناؤه:  لا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ * إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ  .* ذكر من قال ذلك:حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى؛ وحدثني الحارث، قال: ثنا الحسن؛ قال: ثنا ورقاء، جميعا عن ابن أبي نجيح، عن مجاهد، قوله: ( سَنُقْرِئُكَ فَلا تَنْسَى ) قال: كان يتذكر القرآن في نفسه مخافة أن ينسى، فقال قائلو هذه المقالة: معنى الاستثناء في هذا الموضع على النسيان، ومعنى الكلام: فلا تنسى، إلا ما شاء الله أن تنساه، ولا تذكُرَه، قالوا: ذلك هو ما نسخه الله من القرآن، فرفع حكمه وتلاوته.* ذكر من قال ذلك:"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 6{ سَنُقْرِئُکَ فَلَا تَنْسٰٓی۔ } ”اے نبی ﷺ ! ہم آپ کو پڑھا دیں گے ‘ پھر آپ بھولیں گے نہیں۔“ یعنی قرآن مجید میں سے کوئی چیز آپ کو بھولے گی نہیں۔ یہ وہی مضمون ہے جو سورة القیامہ کی ان آیات میں آیا ہے : { لَا تُحَرِّکْ بِہٖ لِسَانَکَ لِتَعْجَلَ بِہٖ - اِنَّ عَلَیْنَا جَمْعَہٗ وَقُرْاٰنَہٗ - فَاِذَا قَرَاْنٰــہُ فَاتَّبِعْ قُرْاٰنَہٗ۔ } ”آپ اس قرآن کے ساتھ اپنی زبان کو تیزی سے حرکت نہ دیں۔ اسے جمع کرنا اور پڑھوا دینا ہمارے ذمہ ہے۔ پھر جب ہم اسے پڑھوا دیں تو آپ اس کی قراءت کی پیروی کیجیے۔“</p>"
      },
      {
        "resource_id": 93,
        "text": "ثم بين - سبحانه - جانبا من مظاهر فضله على نبيه صلى الله عليه وسلم فقال : ( سَنُقْرِئُكَ فَلاَ تنسى .إِلاَّ مَا شَآءَ الله إِنَّهُ يَعْلَمُ الجهر وَمَا يخفى ) .والنسيان : زوال ما كان موجودا فى حافظة الإِنسان . والاستثناء مفرغ من أعم المفاعيل . ومفعول المشيئة محذوف . جريا على غالب استعماله فى كلام العرب . .أى : سنقرئك - أيها الرسول الكريم - القرآن على لسان أمين وحينا جبريل - عليه السلام - وسنجعلك حافظا وواعيا لما سيقرؤه جبريل عليك ، بحيث لا تنساه فى وقت من الأوقات ، أو فى حال من الأحوال ، إلا فى الوقت أو فى الحال الذى يشاء الله - تعالى - أن ينسيك شيئا من ذلك . فإنك ستنساه بأمره - تعالى - لأنه وحده - عز وجل - وهو العليم بما كان ظاهرا من الأشياء ، وبما كان خافيا منها .فالمقصود من هاتين الآيتين : وعد الله - تعالى - لنبيه صلى الله عليه وسلم ببيان أنه - سبحانه - كما أنه قادر على أن يقرئ الرسول صلى الله عليه وسلم قراءة لا ينساها ، فهو أيضا قادر على أن يزل من صدره ما يشاء إزلته ، عن طريق النسيان لما حفظه .فالمراد بهذا الاستثناء : بيان أنه - تعالى - لو أراد أن يصير الرسول صلى الله عليه وسلم ناسيا للقرآن لقدر على ذلك ، كما قال - سبحانه - ( وَلَئِن شِئْنَا لَنَذْهَبَنَّ بالذي أَوْحَيْنَا إِلَيْكَ . . . ) إذ هو - تعالى - على كل شئ قدير ، ولكنه لم يشأ ذلك فضلا منه وكرما .قال الإِمام الشوكانى ما ملخصه : قوله : ( سَنُقْرِئُكَ فَلاَ تنسى ) أى : سنجعلك قارئا بأن نلهمك القراءة . فلا تنسى ما تقرؤه ، والجملة مستأنفة لبيان هدايته صلى الله عليه وسلم الخاصة ، بعد بيان الهداية العامة ، وهى هدايته صلى الله عليه وسلم لحفظ القرآن ."
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : سنقرئك أي القرآن يا محمد فنعلمكه ، فلا تنسى أي فتحفظ رواه ابن وهب عن مالك . وهذه بشرى من الله تعالى بشره بأن أعطاه آية بينة ، وهي أن يقرأ عليه جبريل ما يقرأ عليه من الوحي ، وهو أمي لا يكتب ولا يقرأ ، فيحفظه ولا ينساه . وعن ابن أبي نجيح عن مجاهد ، قال : كان يتذكر مخافة أن ينسى ، فقيل : كفيتكه . قال مجاهد والكلبي : كان النبي - صلى الله عليه وسلم - إذا نزل عليه جبريل بالوحي ، لم يفرغ جبريل من آخر الآية ، حتى يتكلم النبي - صلى الله عليه وسلم - بأولها ، مخافة أن ينساها فنزلت : سنقرئك فلا تنسى بعد ذلك شيئا ، فقد كفيتكه ."
      },
      {
        "resource_id": 14,
        "text": "وقوله تعالى\" سنقرئك\" أي يا محمد\" فلا تنسي\" وهذا إخبار من الله تعالى ووعد منه له بأنه سيقرئه قراءة لا ينساها."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 7,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 16,
        "text": "سنقرئك -أيها الرسول- هذا القرآن قراءة لا تنساها، إلا ما شاء الله مما اقتضت حكمته أن ينسيه لمصلحة يعلمها. إنه - سبحانه- يعلم الجهر من القول والعمل، وما يخفى منهما."
      },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 170,
        "text": "О Мухаммад! Возрадуйся великой вести! Мы сохраним все откровения, ниспосланные тебе в Писании, соберем их в твоем сердце, и ты не забудешь ничего из этого. Но если твой Премудрый Господь решит, что тебе следует забыть часть откровения ради всеобщего блага и огромной пользы, то это произойдет. Воистину, Ему ведомо все, что приносит пользу Его рабам. Он велит все, что пожелает, и судит, как пожелает."
      },
      {
        "resource_id": 94,
        "text": "\"إلا ما شاء الله\"  أن تنساه ، وما نسخ الله تلاوته من القرآن ، كما قال : \" ما ننسخ من آية أو ننسها \" ( البقرة - 106 ) والإنساء نوع من النسخ .وقال مجاهد ، والكلبي : كان النبي - صلى الله عليه وسلم - إذا نزل عليه جبريل - عليه السلام - ، لم يفرغ من آخر الآية حتى يتكلم رسول الله - صلى الله عليه وسلم - بأولها ، مخافة أن ينساها ، فأنزل الله تعالى : \" سنقرئك فلا تنسى \" [ فلم ينس بعد ] ذلك شيئا . ( إنه يعلم الجهر ) من القول والفعل ( وما يخفى ) منهما ، والمعنى : أنه يعلم السر والعلانية ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 91,
        "text": "{ إِلَّا مَا شَاءَ اللَّهُ } مما اقتضت حكمته أن ينسيكه لمصلحة بالغة، { إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَى } ومن ذلك أنه يعلم ما يصلح عباده أي: فلذلك يشرع ما أراد، ويحكم بما يريد  ."
      },
      {
        "resource_id": 14,
        "text": "\"إلا ما شاء الله\" وهذا اختيار ابن جرير وقال قتادة كان رسول الله صلى الله عليه وسلم لا ينسى شيئا إلا ما شاء الله وقيل المراد بقوله فلا تنسى طلب وجعل معني الاستثناء على هذا ما يقع من النسخ أي لا تنسى ما نقرئك إلا ما يشاء الله رفعه فلا عليك أن تتركه. وقوله تعالى \"إنه يعلم الجهر وما يخفى\" أي يعلم ما يجهر به العباد وما يخفونه من أقوالهم وأفعالهم لا يخفى عليه من ذلك شيء."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>আল্লাহ যা ইচ্ছা করবেন তা ব্যতীত, নিশ্চয়ই তিনি ব্যক্ত ও গুপ্ত বিষয় পরিজ্ঞাত আছেন। [১]</p><p>[১] এ কথাটি ব্যাপক। 'ব্যক্ত' কুরআনের ঐ অংশকেও বলা যায়; যা নবী (সাঃ) মুখস্থ করে নেন। আর যা তাঁর অন্তর থেকে মুছে দেওয়া হয়, তা হল 'গুপ্ত' বিষয়। অনুরূপভাবে যা সশব্দে পড়া হয়, তা 'ব্যক্ত' এবং যা নিঃশব্দে পড়া হয়, তা 'গুপ্ত' এবং যে কাজ প্রকাশ্যে করা হয় তা 'ব্যক্ত' এবং যে কাজ গোপনে করা হয়, তা 'গুপ্ত' এ সকল বিষয়ের খবর আল্লাহ রাখেন।</p>"
      },
      {
        "resource_id": 93,
        "text": "وقوله : ( إِلاَّ مَا شَآءَ الله ) استثناء مفرغ من أعم المفاعيل ، أى : لا تنسى مما تقرؤه شيئا من الأشياء ، إلا ما شاء الله أن تنساه ، وهو لم يشأ - سبحانه - أن ينسى النبى صلى الله عليه وسلم شيئا كقوله - تعالى - ( خَالِدِينَ فِيهَا مَا دَامَتِ السماوات والأرض إِلاَّ مَا شَآءَ رَبُّكَ ) وقيل : \" لا \" فى قوله ( فَلاَ تنسى ) للنهى ، والألف مزيدة لرعاية الفاصلة ، كما فى قوله - تعالى - : ( فَأَضَلُّونَا السبيلا ) يعنى : فلا تغفل عن قراءته .وقال الإِمام الرازى : وهاتان الآيتان تدلان على المعجزة من وجهين :أحدهما : أن رسول صلى الله عليه وسلم كان أميا ، فحفظه لهذا الكتاب المطول عن غير دراسة ، ولا تكرار ، ولا كتبة ، خارق للعبادة فيكون معجزا . وثانيهما : أن هذه السورة من أوائل ما نزل بمكة . فهذا إخبار عن أمر عجيب غريب مخالف للعادة . سيقع فى المستقبل ، وقد وقع ، فكان هذا إخبارا عن الغيب ، فيكون معجزا . ."
      },
      {
        "resource_id": 15,
        "text": "حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة ( سَنُقْرِئُكَ فَلا تَنْسَى ) كان صلى الله عليه وسلم لا ينسى شيئًا( إِلا مَا شَاءَ اللَّهُ ) .وقال آخرون: معنى النسيان في هذا الموضع: الترك؛ وقالوا: معنى الكلام: سنقرئك يا محمد فلا تترك العمل بشيء منه، إلا ما شاء الله أن تترك العمل به، مما ننسخه.وكان بعض أهل العربية يقول في ذلك: لم يشأ الله أن تنسى شيئًا، وهو كقوله:  خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالأَرْضُ إِلا مَا شَاءَ رَبُّكَ  ولا يشاء. قال: وأنت قائل في الكلام: لأعطينك كلّ ما سألت إلا ما شئت، وإلا أن أشاء أن أمنعك، والنية أن لا تمنعه، ولا تشاء شيئًا. قال: وعلى هذا مجاري الأيمان، يستثنى فيها، ونية الحالف: اللمام.والقول الذي هو أولى بالصواب عندي قول من قال: معنى ذلك: فلا تنسى إلا أن نشاء نحن أن نُنسيكه بنسخه ورفعه.وإنما قلنا ذلك أولى بالصواب، لأن ذلك أظهر معانيه.وقوله: ( إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَى ) يقول تعالى ذكره: إن الله يعلم الجهر يا محمد من عملك ما أظهرته وأعلنته ( وَمَا يَخْفَى ) يقول: وما يخفى منه فلم تظهره مما كتمته، يقول: هو يعلم جميع أعمالك سرّها وعلانيتها؛ يقول: فاحذره أن يطلع عليك وأنت عامل في حال من أحوالك بغير الذي أذن لك به."
      },
      {
        "resource_id": 166,
        "text": "<p>আল্লাহ্ যা ইচ্ছে করেন তা ছাড়া [১]। নিশ্চয় তিনি জানেন যা প্ৰকাশ্য ও যা গোপনীয়।</p><p>[১] এই বাক্যটির কয়েকটি অর্থ হতে পারে। এক, কুরআনের কিছু আয়াত রহিত করার এক সুবিদিত পদ্ধতি হচ্ছে প্রথম আদেশের বিপরীতে পরিষ্কার দ্বিতীয় আদেশ নাযিল করা। এর আরেকটি পদ্ধতি হলো সংশ্লিষ্ট আয়াতটিই রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ও সকল মুসলিমের স্মৃতি থেকে মুছে দেয়া। এ সম্পর্কে এক আয়াতে আছে,</p><p>مَانَنْسَخْ مِنْ اٰيَةٍ اَوْنُنْسِهَا</p><p>অর্থাৎ ‘আমরা কোন আয়াত রহিত করি অথবা আপনার স্মৃতি থেকে উধাও করে দেই’ । [সূরা আল-বাকারাহ: ১০৬] তাই ‘আল্লাহ্ যা ইচ্ছা করেন তা ছাড়া’ বলে রহিত আয়াতগুলোর কথা বলা হয়েছে। দুই. অথবা আয়াতের উদ্দেশ্য, কখনো সাময়িকভাবে আপনার ভুলে যাওয়া এবং কোন আয়াত বা শব্দ আপনার কোন সময় ভুলে যাওয়া এই ওয়াদার ব্যতিক্রম। যে ব্যাপারে ওয়াদা করা হয়েছে তা হচ্ছে এই যে, আপনি স্থায়ীভাবে কুরআনের কোন শব্দ ভুলে যাবেন না। হাদীসে আছে, একদিন রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম কোন একটি সূরা তেলাওয়াত করলেন এবং মাঝখান থেকে একটি আয়াত বাদ পড়ল। ওহী লেখক উবাই ইবনে কা‘ব রাদিয়াল্লাহু ‘আনহু মনে করলেন যে, আয়াতটি বোধ হয় মনসুখ হয়ে গেছে। কিন্তু জিজ্ঞাসার জওয়াবে রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেনঃ মনসুখ হয়নি, আমিই ভুলক্রমে পাঠ করিনি। [মুসনাদে আহমাদ: ৩/৪০৭] অন্য হাদীসে এসেছে, একবার রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এক সাহাবীকে কোন আয়াত পড়তে শোনে বললেন, আল্লাহ্ তাকে রহমত করুন, আমাকে এ আয়াতটি ভুলিয়ে দেয়া হয়েছিল এখন মনে পড়েছে। [মুসলিম: ৭৮৮] অতএব, উল্লিখিত ব্যতিক্রমের সারমর্ম এই যে, সাময়িকভাবে কোন আয়াত ভুলে যাওয়া অতঃপর তা স্মরণে আসা বর্ণিত প্রতিশ্রুতির পরিপন্থী নয়। [দেখুন, কুরতুবী; ফাতহুল কাদীর]</p>"
      },
      {
        "resource_id": 92,
        "text": "إِلَّا مَا شَاءَ اللَّهُ إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَى (7)والاستثناء في قوله : { إلا ما شاء اللَّه } مفرّع من فعل { تنسى } ، و ( ما ) موصولة هي المستثنى . والتقدير : إلا الذي شاء الله أن تنساه ، فحذف مفعول فعل المشيئة جرياً على غالب استعماله في كلام العرب ، وانظر ما تقدم في قوله : { ولو شاء اللَّه لذهب بسمعهم وأبصارهم } في سورة البقرة ( 20 ) .والمقصود بهذا أن بعض القرآن ينساه النبي إذا شاء الله أن ينساه . وذلك نوعان :أحدهما } : وهو أظهرهما أن الله إذا شاء نسخ تلاوة بعض ما أنزل على النبي صلى الله عليه وسلم أمره بأن يترك قراءَته فأمر النبي صلى الله عليه وسلم المسلمين بأن لا يقرأوه حتى ينساه النبي صلى الله عليه وسلم والمسلمون .وهذا مثل ما روي عن عمر أنه قال : «كان فيما أنزل الشيخُ والشيخه إذا زنيا فارجموهما» قال عمر : لقد قرأنَاها ، وأنه كان فيما أنزل : «لا تَرغبوا عن ءابائكم فإنَّ كفراً بكم أن ترغبوا عن ءابائكم» . وهذا ما أشير إليه بقوله تعالى : { أو ننسها } في قراءة من قرأ : { نُنْسِها } في سورة البقرة ( 106 ) .النوع الثاني } : ما يعرض نسيانه للنبيء صلى الله عليه وسلم نسياناً موقتاً كشأن عوارض الحافظة البشرية ثم يقيض الله له ما يذكره به . ففي «صحيح البخاري» عن عائشة قالت : «سمع النبيءُ صلى الله عليه وسلم رجلاً يقرأ من الليل بالمسجد فقال : يرحمه الله لقد أذكَرَنِي كذا وكذا آيةً أسقطتهن أو كنت أنسيتُها من سورة كذا وكذا ، وفيه أن رسول الله صلى الله عليه وسلم أسقط آية في قراءته في الصلاة فسأله أبَيّ بن كعب أُنسِخَتْ؟ فقال : «نسيتُها» .وليس قوله : { فلا تنسى } من الخبر المستعمل في النهي عن النسيان لأن النسيان لا يدخل تحت التكليف ، أمَّا إنه ليست ( لا ) فيه ناهية فظاهر ومن زعمه تعسف لتعليل كتابة الألف في آخره .وجملة : { إنه يعلم الجهر وما يخفى } معترضة وهي تعليل لجملة : { فلا تنسى } { إلا ما شاء الله } فإن مضمون تلك الجملة ضمان الله لرسوله صلى الله عليه وسلم حفظ القرآن من النقص العارض .ومناسبة الجهر وما يخفى أن ما يقرؤه الرسول صلى الله عليه وسلم من القرآن هو من قبيل الجهر فالله يعلمه ، وما ينساه فيسقطه من القرآن هو من قبيل الخفيّ فيعلم الله أنه اختفى في حافظته حين القراءة فلم يبرز إلى النطق به ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 7{ اِلَّا مَا شَآئَ اللّٰہُ } ”سوائے اس کے کہ جو اللہ چاہے۔“  یہاں یہ کلمہ استثناء صرف اللہ تعالیٰ کی قدرت کے اظہار کے لیے آیا ہے کہ اللہ تعالیٰ ہرچیز پر قادر ہے ‘ اس کے حکم اور اذن کے بغیر کوئی کچھ بھی نہیں کرسکتا۔ اگر اللہ تعالیٰ کسی کے حافظہ سے کوئی چیز محو کرنا چاہے تو وہ لاکھ اسے یاد کرتا رہے ‘ یاد نہیں رکھ سکے گا۔ اس کا یہ مطلب ہرگز نہیں کہ قرآن مجید کی کوئی آیت حضور ﷺ بھول بھی گئے تھے۔ اس لحاظ سے اس جملے کی مثال سورة الزخرف کی اس آیت جیسی ہے : { قُلْ اِنْ کَانَ لِلرَّحْمٰنِ وَلَـدٌق فَاَنَا اَوَّلُ الْعٰبِدِیْنَ۔ } ”اے نبی ﷺ ! آپ ان سے کہیے کہ اگر رحمن کا کوئی بیٹا ہوتا تو سب سے پہلا اس کی عبادت کرنے والا میں ہوتا“۔ ظاہر ہے یہ کلام پرزور دینے کا ایک انداز ہے اور اس کا مقصد انتہائی ُ پرزور انداز میں یہ ثابت کرنا ہے کہ اللہ تعالیٰ نے ہرگز ہرگز کسی کو اپنا بیٹا نہیں بنایا۔ { اِنَّہٗ یَعْلَمُ الْجَہْرَ وَمَا یَخْفٰی۔ } ”یقینا وہ جانتا ہے اونچی آواز میں کہی گئی بات کو بھی اور جو مخفی رکھی جائے اسے بھی۔“</p>"
      },
      {
        "resource_id": 90,
        "text": "ووجه الاستثناء على هذا ، ما قاله الفراء : إلا ما شاء الله ، وهو لم يشأ أن تنسى شيئا كقوله تعالى : خالدين فيها ما دامت السماوات والأرض إلا ما شاء ربك . ولا يشاء . ويقال في الكلام : لأعطينك كل ما سألت إلا ما شئت ، وإلا أن أشاء أن أمنعك ، والنية على ألا يمنعه شيئا . فعلى هذا مجاري الأيمان يستثنى فيها ونية الحالف التمام . وفي رواية أبي صالح عن ابن عباس : فلم ينس بعد نزول هذه الآية حتى مات ، إلا ما شاء الله . وعن سعيد عن قتادة ، قال : كان رسول الله - صلى الله عليه وسلم - لا ينسى شيئا إلا ما شاء الله . وعلى هذه الأقوال قيل : إلا ما شاء الله أن ينسى ، ولكنه لم ينس شيئا منه بعد نزول هذه الآية . وقيل : إلا ما شاء الله أن ينسى ، ثم يذكر بعد ذلك فإذا قد نسي ، ولكنه يتذكر ولا ينسى نسيانا كليا . وقد روي أنه أسقط آية في [ ص: 18 ] قراءته في الصلاة ، فحسب أبي أنها نسخت ، فسأله فقال : \" إني نسيتها \" . وقيل : هو من النسيان أي إلا ما شاء الله أن ينسيك . ثم قيل : هذا بمعنى النسخ أي إلا ما شاء الله أن ينسخه . والاستثناء نوع من النسخ . وقيل : النسيان بمعنى الترك أي يعصمك من أن تترك العمل به إلا ما شاء الله أن تتركه لنسخه إياه . فهذا في نسخ العمل ، والأول في نسخ القراءة . قال الفرغاني : كان يغشى مجلس الجنيد أهل البسط من العلوم ، وكان يغشاه ابن كيسان النحوي ، وكان رجلا جليلا فقال يوما : ما تقول يا أبا القاسم في قول الله تعالى : سنقرئك فلا تنسى ؟ فأجابه مسرعا - كأنه تقدم له السؤال قبل ذلك بأوقات : لا تنسى العمل به . فقال ابن كيسان : لا يفضض الله فاك مثلك من يصدر عن رأيه . وقوله فلا : للنفي لا للنهي . وقيل : للنهي وإنما أثبتت الياء ; لأن رءوس الآي على ذلك . والمعنى : لا تغفل عن قراءته وتكراره فتنساه إلا ما شاء الله أن ينسيكه برفع تلاوته للمصلحة . والأول هو المختار ; لأن الاستثناء من النهي لا يكاد يكون إلا مؤقتا معلوما . وأيضا فإن الياء مثبتة في جميع المصاحف ، وعليها القراء . وقيل : معناه إلا ما شاء الله أن يؤخر إنزاله . وقيل : المعنى فجعله غثاء أحوى إلا ما شاء الله أن ينال بنو آدم والبهائم ، فإنه لا يصير كذلك .قوله تعالى : إنه يعلم الجهر أي الإعلان من القول والعمل . وما يخفى من السر . وعن ابن عباس : ما في قلبك ونفسك . وقال محمد بن حاتم : يعلم إعلان الصدقة وإخفاءها . وقيل : الجهر ما حفظته من القرآن في صدرك . وما يخفى هو ما نسخ من صدرك ."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 8,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 92,
        "text": "وَنُيَسِّرُكَ لِلْيُسْرَى (8)عطف على { سنقرئك فلا تنسى } [ الأعلى : 6 ] . وجملة { إنه يعلم الجهر وما يخفى } [ الأعلى : 7 ] معترضة كما علمت . وهذا العطف من عطف الأعم على الأخص في المآل وإن كان مفهوم الجملة السابقة مغايراً لمفهوم التيسير لأن مفهومها الحفظ والصيانة ومفهوم المعطوفة تيسير الخير له .والتيسير : جعل العمل يسيراً على عامله .ومفعول فعل التيسير هو الشيء الذي يُجعل يسيراً ، أي غير صعب ويذكر مع المفعول الشيءُ المجعول الفعل يسيراً لأجله مجروراً باللام كقوله تعالى : { ويسر لي أمري } [ طه : 26 ] .واليُسْرى : مؤنث الأيسر ، وصيغة فُعلى تدل على قوة الوصف لأنها مؤنث أفْعَل .والموصوف محذوف ، وتأنيث الوصف مشعر بأن الموصوف المحذوف مما يجري في الكلام على اعتبار اسمِه مؤنثاً بأن يَكون مفرداً فيه علامَة تأنيث أو يكون جمعاً إذ المجموع تَعَامَل معاملة المؤنث . فكان الوصف المؤنث منادياً على تقدير موصوف مناسب للتأنيث في لفظه ، وسياقُ الكلام الذي قبله يهدي إلى أن يكون الموصوف المقدَّر معنَى الشريعة فإن خطاب الرسول صلى الله عليه وسلم في القرآن مراعًى فيه وصفه العُنواني وهوَ أنه رسول فلا جرم أن يكون أول شؤونه هو ما أرسل به وهو الشريعة .وقوله : { ونيسرك لليسرى } إن حمل على ظاهر نظم الكلام وهو ما جرى عليه المفسرون . فالتيسير مستعار للتهيئة والتسخير ، أي قوة تمكينه صلى الله عليه وسلم من اليُسرى وتصرفه فيها بما يأمر الله به ، أي نُهيئك للأمور اليسرى في أمر الدّين وعواقبه من تيسير حفظ القرآن لك وتيسير الشريعة التي أرسلتَ بها وتيسير الخير لك في الدنيا والآخرة . وهذه الاستعارة تحسِّنها المشاكلة .ومعنى اللام في قوله : { لليسرى } العلةُ ، أي لأجل اليسرى ، أي لقبولها ، ونحوُه قول النبي صلى الله عليه وسلم \" كلٌّ مُيَسرٌ لِما خُلق له \" وتكون هذه الآية على مهيع قوله تعالى : { فسنيسره لليسرى } وقوله : { فسنيسره للعسرى } في سورة الليل ( 7 10 ) .ويجوز أن يجعل الكلام جارياً على خلاف مقتضى الظاهر بسلوك أسلوب القلب وأن الأصل : ونيسر لك اليسرى ، أي نجعلها سهلة لك فلا تشقّ عليك فيبقى فعل : «نيسرك» على حقيقته ، وإنما خولف عَمله في مفعوله والمجرورِ المتعلق به على عكس الشائع في مفعوله والمجرورِ المتعلق به .وفي وصفها ب { اليسرى } إيماء إلى استتباب تيسره لها بما أنها جُعلت يسرى ، فلم يبق إلا حفظه من الموانع التي يشق معها تلقي اليسرى .فاشتمل الكلام على تيسيرين : تيسير ما كلف به النبي صلى الله عليه وسلم أي جعله يسيراً مع وفائه بالمقصود منه ، وتيسير النبي صلى الله عليه وسلم للقيام بما كلف به .ويوجَّه العدول عن مقتضى ظاهر النظم إلى ما جاء النظم عليه ، بأنَّ فيه تنزيلَ الشيء الميسّر منزلة الشيء الميسَّر له والعكسَ للمبالغة في ثبوت الفعل للمفعول على طريقة القلب المقبوللِ كقول العرب : «عَرضْتُ الناقةَ على الحوض» ، وقول العجاج: ... وَمهْمَهٍ مُغْبَرّةٍ أرجاؤُهكأن لونَ أرضِه سماؤُه ... وقد ورد القلب في آيات من القرآن ومنها قوله تعالى : { ما إنَّ مفاتحه لتنوء بالعصبة أولي القوة } [ القصص : 76 ] ومنه القلب التشبيه المقلوب .والمعنى : وعْد الله إياه بأنه يسره لتلقي أعباء الرسالة فلا تشق عليه ولا تحرجه تطميناً له إذ كان في أول أمر إرساله مشفقاً أن لا يفي بواجباتها . أي أن الله جعله قابلاً لتلقّي الكمالات وعظائم تدبير الأمة التي من شأنها أن تشق على القائمين بأمثالها .ومن آثار هذا التيسير ما ورد في الحديث : « أن رسول الله صلى الله عليه وسلم ما خُيّر بين أمرين إلا اختار أيْسرهما » وقوله صلى الله عليه وسلم لأصحابه : « إنما بعثتم مُيَسِّرين لا مُعسِّرين » ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "ونيسرك : معطوف على سنقرئك وقوله : إنه يعلم الجهر وما يخفى اعتراض . ومعنى لليسرى أي للطريقة اليسرى وهي عمل الخير . قال ابن عباس : نيسرك لأن تعمل خيرا . ابن مسعود : لليسرى أي للجنة . وقيل : نوفقك للشريعة اليسرى وهي الحنيفية السمحة السهلة قال معناه الضحاك . وقيل : أي نهون عليك الوحي حتى تحفظه وتعمل به ."
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 165,
        "text": "<p>আমি তোমার জন্য (কল্যাণের পথকে) সহজ করে দেব। [১]</p><p>[১] এ কথাটিও ব্যাপক। যেমন, আমি তোমার জন্য অহীকে সহজ করে দেব, যাতে তা মুখস্থ করা এবং তার উপর আমল করা সহজ হয়ে যায়। তোমাকে সেই পথ প্রদর্শন করব, যা হবে সরল। যে আমল জান্নাতে নিয়ে যাবে, আমি তোমার জন্য সেই আমল সহজ করে দেব। আমি তোমার জন্য ঐ সমস্ত কর্ম ও কথাকে সহজ করে দেব, যাতে মঙ্গল নিহিত আছে এবং আমি তোমার জন্য এমন শরীয়ত নির্ধারণ করব, যা সহজ, সরল এবং মধ্যপন্থী হবে; যার মধ্যে কোন প্রকার বক্রতা, কঠিনতা ও সংকীর্ণতা নেই।</p>"
      },
      {
        "resource_id": 94,
        "text": "( ونيسرك لليسرى ) قال مقاتل : نهون عليك عمل أهل الجنة - وهو معنى قول ابن عباس - ونيسرك لأن تعمل خيرا . و \" اليسرى \" عمل الخير .وقيل : نوفقك للشريعة اليسرى وهي الحنيفية السمحة .وقيل : هو متصل بالكلام الأول معناه : إنه يعلم الجهر مما تقرؤه على جبريل إذا فرغ من التلاوة ، \" وما يخفى \" ما تقرأ في نفسك مخافة النسيان ، ثم وعده فقال : ( ونيسرك لليسرى ) أي نهون عليك الوحي حتى تحفظه وتعلمه ."
      },
      {
        "resource_id": 16,
        "text": "ونيسرك لليسرى في جميع أمورك، ومن ذلك تسهيل تَلَقِّي أعباء الرسالة، وجعل دينك يسرًا لا عسر فيه."
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  وَنُيَسِّرُكَ لِلْيُسْرَى (8)يقول تعالى ذكره: ونسهلك يا محمد لعمل الخير وهو اليُسرَى، واليُسرَى: هو الفُعلى من اليسر."
      },
      {
        "resource_id": 14,
        "text": "أي نسهل عليك أفعال الخير وأقواله ونشرع لك شرعا سهلا سمحا مستقيما عدلا لا اعوجاج فيه ولا حرج ولا عسر."
      },
      {
        "resource_id": 166,
        "text": "<p>আর আমরা আপনার জন্য সুগম করে দেব সহজ পথ [১]।</p><p>[১] অর্থাৎ আল্লাহ্ তা‘আলা আপনার জন্য সহজ সরল শরী‘আত প্ৰদান করবেন। যাতে কোন বক্রতা থাকবে না। [ইবন কাসীর]</p>"
      },
      {
        "resource_id": 91,
        "text": "{ وَنُيَسِّرُكَ لِلْيُسْرَى } وهذه أيضًا بشارة كبيرة  ، أن الله ييسر رسوله صلى الله عليه وسلم لليسرى في جميع أموره، ويجعل شرعه ودينه يسرا  ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 8{ وَنُیَسِّرُکَ لِلْیُسْرٰی۔ } ”اور ہم رفتہ رفتہ پہنچائیں گے آپ کو آسانی تک۔“ تَیْسِیْر یُسر سے باب تفعیل ہے۔ اس باب میں تدریج کے معنی پائے جاتے ہیں۔ چناچہ آیت کا مفہوم یہ ہے کہ اے نبی ﷺ ! ہم مشکلات میں سے رفتہ رفتہ آپ کے لیے راستہ بناتے چلے جائیں گے اور اس آسان راستے پر آپ ﷺ کو تدریجاً ایک بڑی آسانی کی طرف لے جائیں گے۔ اس سے مراد اس دنیا میں غلبہ دین کی جدوجہد کی کامیابی اور آخرت میں جنت اور اس کی آسائشیں ہیں۔ ہم چاہیں تو آنِ واحد میں آپ ﷺ کے تمام دشمنوں کو آپ ﷺ کے سامنے سرنگوں کردیں اور تمام جن و انس کو ایمان کی توفیق بخش دیں ‘ لیکن ہماری حکمت اور مشیت میں اس معاملے کی ایک تدریج ہے۔ چناچہ ہم آپ ﷺ کی جدوجہد کو مرحلہ وار اور رفتہ رفتہ کامیابی سے ہمکنار کریں گے۔ اس فلسفے کی مزید وضاحت آگے چل کر سورة الشمس میں آئے گی۔</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>وَنُيَسِّرُكَ لِلْيُسْرَىٰ (And We will facilitate for you [ to reach ] the easiest way....87:8). The phrase the easiest way' refers to the sacred laws of Islam. Apparently, according to the demand of the context, it should have been stated 'We will make the Shari'ah easy for you'. But the Qur'an chose, instead, to state 'And We will facilitate for you (to reach) the easiest way. [ 8] '. The reason for that, probably, is to indicate that Allah will predispose him to the sacred laws, so that they will become part of his nature, and he will become an embodiment of Shari'ah.</p>"
      },
      {
        "resource_id": 170,
        "text": "Это - еще одна благая весть о том, что Аллах облегчит Своему посланнику, да благословит его Аллах и приветствует, все дела и сделает его шариат и религию легкой."
      },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - : ( وَنُيَسِّرُكَ لليسرى ) معطوف على قوله ( سَنُقْرِئُكَ ) وجملة : ( إِنَّهُ يَعْلَمُ الجهر وَمَا يخفى ) معترضة .والتيسير بمعنى التسهيل والتخفيف ، وهو جعل العمل يسيرا على عامله بأن يهيئ الله - تعالى - للعامل الأسباب التى تهون له العسير ، وتقرب له البعيد .واليسرى : مؤنث الأيسر ، بمعنى الأسهل ، والموصوف محذوف .والمعنى : سنجعلك - أيها الرسول الكريم - صاحب ذاكرة قوية تحفظ القرآن ولا تنساه . وسنوفقك توفيقا دائما للطريقة اليسرى فى كل باب من أبواب الدين : علما وعملا ، واهتداء وهداية - وسنرزقك الأمور الحسنة التى تجعلك تعيش سعيدا فى دنياك ، وظافرا برضواننا فى أخراك .ولقد أنجز الله - تعالى - لنبيه صلى الله عليه وسلم وعده ، حيث أعطاه شريعة سمحة ، ومنحه أخلاقا كريمة ، من مظاهرها أنه صلى الله عليه وسلم ما خير بين الأمرين إلا اختار أيسرهما ، ودعا أتباعه إلى الأخذ بمبدأ التيسير ، فقال : \" يسروا ولا تعسروا ، وبشروا ولا تنفروا . . \" .فهاتان بشارتان عظيمتان للرسول صلى الله عليه وسلم أولاهما : تتمثل فى إلهامه الذاكرة الواعية الحافظة لما يوحى إليه . وثانيتهما : توفيقه صلى الله عليه وسلم إلى الشريعة اليسرى ، وإلى الأخلاق الكريمة وإلى الأخذ بما هو أرفق وأيسر فى كل أحواله ."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 9,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 168,
        "text": "<p>فَذَكِّرْ إِن نَّفَعَتِ الذِّكْرَىٰ (So, extend advice [ to people ] if advice is useful....87:9) The preceding verses described the facilities created by Allah for the Holy Prophet in performing his Prophetic obligation. This verse commands him to perform his obligation. The verse contains the conditional particle 'in' (if) that apparently makes the sentence a conditional statement. But, in fact, the command is not intended to be made conditional. It is rather an emphatic statement. This is similar to the grammatical phenomenon in many languages. The particle 'if' is sometimes used when something is always true. It is used for introducing a situation that always has the same meaning, result or effect. For example: \"If you are a 'man' [ obviously he is a man ], then you will have to do this work;\" In neither of such sentences, the particle 'if is conditional, but rather emphatic. Likewise, the verse purports to say that preaching truth and righteousness is certainly useful. Therefore, the beneficial thing should never be abandoned at anytime.</p>"
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 16,
        "text": "فعظ قومك -أيها الرسول- حسبما يسرناه لك بما يوحى إليك، واهدهم إلى ما فيه خيرهم. وخُصَّ بالتذكير من يرجى منه التذكُّر، ولا تتعب نفسك في تذكير من لا يورثه التذكر إلا عتوًّا ونفورًا."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 9{ فَذَکِّرْ اِنْ نَّفَعَتِ الذِّکْرٰی۔ } ”تو آپ ﷺ یاد دہانی کراتے رہیے ‘ اگر یاد دہانی فائدہ دے۔“ اس آیت کا یہ مطلب نہیں کہ آپ ﷺ انذار و تذکیر کا فریضہ تبھی سرانجام دیں جب مخاطب کو اس سے کچھ فائدہ ہو رہا ہو یعنی وہ اس تذکیر کا اثر قبول کر رہا ہو۔ چناچہ اگلی آیت میں اس حوالے سے وضاحت کردی گئی ہے۔</p>"
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 93,
        "text": "ثم أمره - تعالى - بدوام التذكير بدعوة الحق بدون إبطاء أو يأس فقال : ( فَذَكِّرْ إِن نَّفَعَتِ الذكرى سَيَذَّكَّرُ مَن يخشى . وَيَتَجَنَّبُهَا الأشقى . الذى يَصْلَى النار الكبرى . ثُمَّ لاَ يَمُوتُ فِيهَا وَلاَ يَحْيَا ) .والفاء فى قوله ( فذكر ) للتفريع على ما تقدم ، والأمر مستعمل هنا فى طلب المداومة على التذكير بدعوة الحق التى أرسله - سبحانه - بها ، والذكرى : بمعنى التذكير .والمعنى : إذا كان الأمر كما أخبرناك - أيها الرسول الكريم - فداوم على تذكير الناس بالهدى ودين الحق ، واتبع فى ذلك الحكمة والموعظة الحسنة والمجادلة بالتى هى أحسن اهتم فى تذكيرك بمن تتوقع منهم قبول دعوتك ، وأعرض عن الجاحدين والمعاندين والجاهلين .قال صاحب الكشاف : فإن قلت : كان الرسول صلى الله عليه وسلم مأمورا بالذكرى نفعت أو لم تنفع . . فما معنى اشتراط النفع؟ . .قلت : هو على وجهين : أحدهما . أن رسول الله صلى الله عليه وسلم قد استفرغ مجهوده فى تذكيرهم ، وما كانوا يزيدون على زيادة الذكرى إلا عتوا وطغيانا ، وكان النبى صلى الله عليه وسلم يتلظى حسرة وتلهفا ، ويزداد جدا فى تذكيرهم ، وحرصا عليه ، فقيل له : ( وَمَآ أَنتَ عَلَيْهِمْ بِجَبَّارٍ فَذَكِّرْ بالقرآن مَن يَخَافُ وَعِيدِ ) وذلك بعد إلزام الحجة بتكرير التذكير .والثانى : أن يكون ظاهره شرطا ، ومعناه ذَمّاً للمذكِّرين - بتشديد الكاف المفتوحة - وإخبارا عن حالهم ، واستبعادا لتأثير الذكرى فيهم ، وتسجيلا عليهم بالطبع على قلوبهم ، كما تقول للواعظ : عظ المكاسين إن سمعوا منك ، قاصدا بهذا الشرط ، استبعاد ذلك ، وأنه لن يكون . .وقال الإِمام الرازى ما ملخصه : جاء التعليق بالشرط فى قوله - تعالى - : ( فَذَكِّرْ إِن نَّفَعَتِ الذكرى ) مع أنه صلى الله عليه وسلم مطلوب منه أن يذكر الناس جميعا ، نفعتهم الذكرى أم لم تنفعهم - للتنبيه على أشرف الحالين ، وهو وجود النفع الذى من أجله شرعت الذكرى ، كقوله - تعالى - :( سَرَابِيلَ تَقِيكُمُ الحر ) وللإِشعار بأن المراد من الشرط : البعث على الانتفاع بالذكرى ، كما يقول الإِنسان لغيره بعد أن بين له الحق ، قد أوضحت لك الأمر إن كنت تعقل ، فيكون مراده الحض على القبول . .ويبدو لنا أن المقصود بالآية الكريمة ، تحريض النبى صلى الله عليه وسلم على المداومة على دعوة الناس إلى قبول الحق الذى جاء به ، فإن هذا التذكير إن لم ينفع الناس جميعا ، فسينفع بعضهم ، فقد اقتضت سنة الله - تعالى - أن لا تخلو الأرض ممن يستمع إلى الحق ، ويستجيب له ."
      },
      {
        "resource_id": 94,
        "text": "\"فذكر\"، عظ بالقرآن، \" إن نفعت الذكرى\"، الموعظة والتذكير. والمعنى: نفعت أو لم تنفع، وإنما لم يذكر الحالة الثانية، كقوله: \"سرابيل تقيكم الحر\"، وأراد: الحر والبرد جميعاً."
      },
      {
        "resource_id": 91,
        "text": "{ فَذَكِّرْ } بشرع الله وآياته { إِنْ نَفَعَتِ الذِّكْرَى } أي: ما دامت الذكرى مقبولة، والموعظة مسموعة، سواء حصل من الذكرى جميع المقصود أو بعضه.ومفهوم الآية أنه إن لم تنفع الذكرى، بأن كان التذكير يزيد في الشر، أو ينقص من الخير، لم تكن الذكرى مأمورًا بها، بل منهيًا عنها، فالذكرى ينقسم الناس فيها قسمين: منتفعون وغير منتفعين."
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : فذكر أي فعظ قومك يا محمد بالقرآن . إن نفعت الذكرى أي الموعظة . وروى يونس عن الحسن قال : تذكرة للمؤمن ، وحجة على الكافر . وكان ابن عباس يقول : تنفع أوليائي ، ولا تنفع أعدائي . وقال الجرجاني : التذكير واجب وإن لم ينفع . والمعنى : فذكر إن نفعت الذكرى أو لم تنفع ، فحذف كما قال : سرابيل تقيكم الحر . وقيل : إنه مخصوص بأقوام بأعيانهم . وقيل : إن إن بمعنى ما أي فذكر ما نفعت الذكرى ، [ ص: 19 ] فتكون إن بمعنى ما ، لا بمعنى الشرط ; لأن الذكرى نافعة بكل حال قال ابن شجرة . وذكر بعض أهل العربية أن إن بمعنى إذ أي إذ نفعت كقوله تعالى : وأنتم الأعلون إن كنتم مؤمنين أي إذ كنتم فلم يخبر بعلوهم إلا بعد إيمانهم . وقيل : بمعنى قد ."
      },
      {
        "resource_id": 14,
        "text": "أي ذكر حيث تنفع التذكرة ومن ههنا يؤخذ الأدب في نشر العلم فلا يضعه عند غير أهله كما قال أمير المؤمنين علي ما أنت بمحدث قوما حديثا لا تبلغه عقولهم إلا كان فتنة لبعضهم وقال حدث الناس بما يعرفون أتحبون أن يكذب الله ورسوله؟."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَى ) يقول تعالى ذكره: فذكِّر عباد الله يا محمد عظمته، وعِظْهم، وحذّرهم عقوبته ( إِنْ نَفَعَتِ الذِّكْرَى ) يقول: إن نفعت الذكرى الذين قد آيستُك من إيمانهم، فلا تنفعهم الذكرى. وقوله: ( فَذَكِّرْ ) أمر من الله لنبيه صلى الله عليه وسلم بتذكير جميع الناس، ثم قال: إن نفعت الذكرى هؤلاء الذين قد آيستك من إيمانهم."
      },
      {
        "resource_id": 92,
        "text": "فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَى (9) بعد أن ثبَّت الله رسوله صلى الله عليه وسلم تكفل له ما أزال فَرَقه من أعباء الرسالة وما اطمأنت به نفسه من دفع ما خافه من ضُعف عن أدائه الرسالةَ على وجهها وتكفل له دفع نسيان ما يوحى إليه إلا ما كان إنساؤه مراداً لله تعالى . ووعده بأنه وفقه وهيأه لذلك ويسره عليه ، إذ كان الرسول صلى الله عليه وسلم وهو في مبدأ عهده بالرسالة ( إذ كانت هذه السورة ثامنة السور ) لا يعلم ما سيتعهد الله به فيخشى أن يقصر عن مراد الله فيلحقه غضب منه أو ملام . أعقب ذلك بأنْ أمَرَه بالتذكير ، أي التبليغ ، أي بالاستمرار عليه ، إرهافاً لعزمه ، وشحذاً لنشاطه ليكون إقباله على التذكير بشراشره فإن امتثال الأمر إذا عاضده إقبال النفس على فعل المأمور به كان فيه مسرة للمأمور ، فجَمع بين أداء الواجب وإرضاء الخاطر .فالفاء للتفريع على ما تقدم تفريعَ النتيجة على المقدمات .والأمر : مستعمل في طلب الدوام .والتذكير : تبليغ الذكر وهو القرآن .والذكرى : اسم مصدر التذكير وقد تقدم في سورة عبس .ومفعول { فذكر } محذوف لقصد التعميم"
      },
      {
        "resource_id": 166,
        "text": "<p>অতঃপর উপদেশ যদি ফলপ্রসূ হয় তবে উপদেশ দিন [১] ;</p><p>[১] অর্থাৎ যেখানে স্মরণ করিয়ে দিলে কাজে লাগে সেখানে স্মরণ করিয়ে দিবেন। এর দ্বারা জ্ঞান দেয়ার আদব ও নিয়ম নীতি বোঝা যায়। সুতরাং যারা জ্ঞান গ্ৰহণ করার উপযুক্ত নয়, তাদের কাছে সেটা না দেয়া। যেমন আলী রাদিয়াল্লাহু আনহু বলেন, ‘তুমি যদি এমন কওমের কাছে কোন কথা বল যা তাদের বিবেকে ঢুকবে না, তাহলে সেটা তাদের কারও কারও জন্য বিপদের কারণ হবে। তারপর তিনি বললেন, মানুষ যা চিনে তা-ই শুধু তাদেরকে জানাও, তুমি কি চাও যে লোকেরা আল্লাহ্ ও তাঁর রাসূলের উপর মিথ্যারোপ করুক? [ইবন কাসীর]</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 170,
        "text": "Обучай людей шариату Аллаха и Его писанию, если они примут твое учение и прислушаются к твоим проповедям, независимо от того, добьешься ты своей цели целиком или частично. Из этого аята понимается, что если напоминание не приносит пользы, а лишь увеличивает вред, то его не следует сообщать людям. Напротив, Аллах запрещает поступать так."
      },
      {
        "resource_id": 165,
        "text": "<p>অতএব উপদেশ দাও; যদি উপদেশ ফলপ্রসূ হয়। [১]</p><p>[১] অর্থাৎ, সেখানে ওয়ায-নসীহত কর, যেখানে অনুমান হয় যে, তা উপকারী হবে। এই আয়াতের মাধ্যমে মহান আল্লাহ ওয়ায-নসীহত এবং শিক্ষাদানের একটি নীতি ও আদর্শ বর্ণনা করেছেন। <em>(ইবনে কাসীর)</em></p><p>ইমাম শওকানী (রঃ)এর নিকট এর অর্থ হল এই যে, 'তুমি উপদেশ দাও; যদি উপদেশ ফলপ্রসূ হয় অথবা না হয়।' কেননা, সতর্কীকরণ ও তবলীগ উভয় অবস্থাতেই তাঁর জন্য জরুরী ছিল। অর্থাৎ (শওকানীর মতে), أو لم تنفع বাক্য এখানে উহ্য আছে।</p>"
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 10,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 90,
        "text": "قوله تعالى : سيذكر من يخشى أي من يتقي الله ويخافه . فروى أبو صالح عن ابن عباس قال : نزلت في ابن أم مكتوم . الماوردي : وقد يذكر من يرجوه ، إلا أن تذكرة الخاشي أبلغ من تذكرة الراجي فلذلك علقها بالخشية دون الرجاء ، وإن تعلقت بالخشية والرجاء . وقيل : أي عمم أنت التذكير والوعظ ، وإن كان الوعظ إنما ينفع من يخشى ، ولكن يحصل لك ثواب الدعاء حكاه القشيري ."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 94,
        "text": "\"سيذكر\"، سيتعظ، \"من يخشى\"، الله عز وجل."
      },
      {
        "resource_id": 16,
        "text": "سيتعظ الذي يخاف ربه، ويبتعد عن الذكرى الأشقى الذي لا يخشى ربه، الذي سيدخل نار جهنم العظمى يقاسي حرَّها، ثم لا يموت فيها فيستريح، ولا يحيا حياة تنفعه."
      },
      {
        "resource_id": 91,
        "text": "فأما المنتفعون، فقد ذكرهم بقوله: { سَيَذَّكَّرُ مَنْ يَخْشَى } الله تعالى، فإن خشية الله تعالى، وعلمه بأن سيجازيه على أعماله  ، توجب للعبد الانكفاف عن المعاصي  والسعي في الخيرات."
      },
      {
        "resource_id": 14,
        "text": "أي سيتعظ بما تبلغه يا محمد من قلبه يخشى الله ويعلم أنه ملاقيه."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( سَيَذَّكَّرُ مَنْ يَخْشَى ) يقول جلّ ثناؤه: سَيَذَّكَّرُ يا محمد إذا ذكرت الذين أمرتك بتذكيرهم من يخشى الله، ويخاف عقابه ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 10{ سَیَذَّکَّرُ مَنْ یَّخْشٰی۔ } ”وہ نصیحت حاصل کرلے گا جو ڈرتا ہے۔“ آپ ﷺ لوگوں کو تذکیر و نصیحت کرتے جایئے ‘ جس کے دل میں اللہ کا خوف ہوگا وہ اس کا اثر ضرور قبول کرے گا اور اسے فائدہ بھی ہوگا۔ چناچہ اے نبی ﷺ جب بھی آپ پر کوئی نئی وحی آئے تو آپ وہ نیا کلام پڑھ کر لوگوں کو ضرور سنائیں۔ آپ ﷺ کے اہل ایمان ساتھیوں کے علم اور ایمان میں اس سے ضرور اضافہ ہوگا۔</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>যে ভয় করে, সে উপদেশ গ্রহণ করবে। [১]</p><p>[১] অর্থাৎ, তোমার উপদেশ নিশ্চয় ঐ সমস্ত লোকেরা গ্রহণ করবে, যাদের অন্তরে আল্লাহর ভয় আছে। আর তার মাধ্যমে তাদের মধ্যে আল্লাহ-ভীতি ও নিজেদের সংস্কার-প্রচেষ্টা বৃদ্ধি পাবে।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>যে ভয় করে সেই উপদেশ গ্ৰহণ করবে [১]।</p><p>[১] অর্থাৎ যে ব্যক্তির মনে আল্লাহ্র ভয় এবং তাঁর সাথে সাক্ষাত করতে হবে এমন ধারণা কাজ করে সে অবশ্যই আপনার উপদেশ মনোযোগ সহকারে শুনবে। [ইবন কাসীর]</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>سیذکر ................................ فصلی</p><p>آپ یاد دہانی کرائیں اور اس یاد دہانی سے استفادہ وہی شخص کرے گا جو ڈرتا ہو۔</p><p>من یخشیٰ (10:87) جس کے دل میں خدا کا خوف ہو ، اور جو خدا کے غضب اور خدا کے عذاب سے ڈرتا ہے ، اور وہی شخص ڈرتا ہے اور محتاط رہتا ہے جو زندہ ہو۔ اور یہ شخص جانتا ہو کہ اس کائنات کا ایک خالق ہے ، جس نے اس جہاں کو پیدا کرکے اسے نہایت متوازن بنایا ہے ، تقدیر مقرر کی اور لوگوں کو راہ راست کی ہدایت کی۔ اس نے لوگوں کو ویسا ہی شتر بےمہار بناکر نہیں چھوڑ دیا اور نہ مہمل پیدا کیا ہے۔ لہٰذا خیروشر کے سلسلے میں اللہ حساب لینے والا ہے اور عدل و انصاف کے ساتھ فیصلہ کرنے والا ہے۔ تو ایسا شخص اللہ سے ڈرتا ہے اور جب اسے نصیحت کی جاتی ہے تو وہ نصیحت لیتا ہے ، اسے بصیرت دی جاتی ہے تو قبول کرتا ہے اور جب اسے نصیحت کی جاتی ہے تو وہ عبرت حاصل کرتا ہے۔</p>"
      },
      {
        "resource_id": 92,
        "text": "سَيَذَّكَّرُ مَنْ يَخْشَى (10) أي فذكر الناس ودلّ عليه قوله : { سيذكر من يخشى } الآيتين .وجملة : { إن نفعت الذكرى } معترضة بين الجملتين المعلَّلة وعِلتها ، وهذا الاعتراض منظور فيه إلى العموم الذي اقتضاه حذف مفعول { فذكر } ، أي فدم على تذكير الناس كلهم إن نفعت الذكرى جميعهم ، أي وهي لا تنفع إلا البعض وهو الذي يؤخذ من قوله : { سيذكر من يخشى } الآية .فالشرط في قوله : { إن نفعت الذكرى } جملة معترضة وليس متعلقاً بالجملة ولا تقييداً لمضمونها إذ ليس المعنى : فذكر إذا كان للذكرى نفع حتى يفهم منه بطريق مفهوم المخالفة أن لا تُذَكِّر إذا لم تنفع الذكرى ، إذ لا وجه لتقييد التذكير بما إذا كانت الذكرى نافعة إذ لا سبيل إلى تعرف مواقع نفع الذكرى ، ولذلك كان قوله تعالى : { فذكر بالقرآن من يخاف وعيد } [ ق : 45 ] مؤولاً بأن المعنى فذكر بالقرآن فيتذكر من يخاف وعيد ، بل المراد فذكّر الناس كافة إنْ كانت الذكرى تنفع جميعَهم ، فالشرط مستعمل في التشكيك لأن أصل الشرط ب ( إنْ ) أن يكون غير مقطوع بوقوعه ، فالدعوة عامة وما يعلمه الله من أحوال الناس في قبول الهدى وعدمه أمر استأثر اللَّهُ بعلمه ، فأبو جهل مدعو للإِيمان والله يعلم أنه لا يؤمن لكن الله لم يخصّ بالدعوة من يرجى منهم الإِيمان دون غيرهم ، والواقعُ يكشف المقدور .وهذا تعريض بأن في القوم من لا تنفعه الذكرى وذلك يفهم من اجْتلاب حرف ( إنْ ) المقتضي عدم احتمال وقوع الشرط أو ندرة وقوعه ، ولذلك جاء بعده بقوله : { سيذكر من يخشى } فهو استئناف بياني ناشىء عن قوله : { فذكر } وما لحقه من الاعتراض بقوله : { إن نفعت الذكرى } المشعر بأن التذكير لا ينتفع به جميع المذكَّرين .وهذا معنى قول ابن عباس : تنفع أوليائي ولا تنفع أعدائي ، وفي هذا ما يريك معنى الآية واضحاً لا غُبار عليه ويدفع حيرة كثير من المفسرين في تأويل معنى ( إن ) ، ولا حاجة إلى تقدير الفراء والنحاس : إن نفعت الذكرى وإن لم تنفع وأنه اقتصر على القسم الواحد لدلالته على الثاني .ويذّكَّر : مُطاوع ذَكَّره . وأصله : يتذكر ، فقلبت التاء ذالاً لقرب مخرجيهما ليتأتى إدغامها في الذال الأخرى .و { من يخشى } : جنس لا فرد معين أي سيتذكر الذين يَخْشون . والضمير المستتر في { يخشى } مراعى فيه لفظ ( من ) فإنه لفظ مُفرد .وقد نُزِّل فعل { يخشى } منزلة اللازم فلم يقدّر له مفعول ، أي يتذكر من الخَشْيَة فكرته وجبلته ، أي من يتَوقع حصول الضر والنفع فينظر في مظان كللٍ ويتدبر في الدلائل لأنه يخشى أن يحق عليه ما أنذر به .والخشية : الخوف ، وتقدم في قوله تعالى : { لعله يتذكر أو يخشى } في سورة طه ( 44 ) . والخشية ذات مراتب وفي درجاتها يتفاضل المؤمنون ."
      },
      {
        "resource_id": 93,
        "text": "ويدل على هذا المعنى قوله - تعالى - بعد ذلك : ( سَيَذَّكَّرُ مَن يخشى ) أى : سينتفع بتذكيرك - أيها الرسول الكريم - من يخشى الله - تعالى - ويخاف عذابه ، ويرجو ثوابه ."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 11,
    "tafsirs": [
      {
        "resource_id": 90,
        "text": "قوله تعالى : ويتجنبها أي ويتجنب الذكرى ويبعد عنها . الأشقى أي الشقي في علم الله . وقيل : نزلت في الوليد بن المغيرة وعتبة بن ربيعة ."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 94,
        "text": "\"ويتجنبها\"، أي يتجنب الذكرى ويتباعد عنها، \"الأشقى\"، الشقي في علم الله."
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 93,
        "text": "( وَيَتَجَنَّبُهَا الأشقى ) أى : ويتجنب الذكرى ، ويبتعد عن الموعظة ، ويتجافى عن النصيحة ، الإِنسان الشديد الشقاوة والتعاسة ، الذى أبى إلا الإِصرار على كفره وعناده ، وخلا من خشية الله - تعالى - . والمراد بالأشقى : الجنس ، أى : يبتعد عن الانتفاع بالتذكير جميع الأشقياء وهم الكافرون .وقيل : المراد به الكافر المتوغل فى كفره كأبى جهل والوليد بن المغيرة وأشباههما ."
      },
      {
        "resource_id": 91,
        "text": "وأما غير المنتفعين، فذكرهم بقوله: { وَيَتَجَنَّبُهَا الْأَشْقَى الَّذِي يَصْلَى النَّارَ الْكُبْرَى } وهي النار الموقدة، التي تطلع على الأفئدة."
      },
      {
        "resource_id": 165,
        "text": "<p>আর নিতান্ত হতভাগ্য তা উপেক্ষা করবে। [১]</p><p>[১] অর্থাৎ, সেই উপদেশ দ্বারা তারা উপকৃত হবে না। কেননা, কুফরীতে অবিচলতা ও আল্লাহর অবাধ্যাচরণ তাদের মাঝে অব্যাহত থাকে।</p>"
      },
      { "resource_id": 14, "text": "لا يوجد تفسير لهذه الأية" },
      {
        "resource_id": 166,
        "text": "<p>আর তা উপেক্ষা করবে যে নিতান্ত হতভাগ্য,</p>"
      },
      {
        "resource_id": 92,
        "text": "وَيَتَجَنَّبُهَا الْأَشْقَى (11) والتجنب : التباعد ، وأصله تفعل لتكلف الكيْنونة بجانببٍ من شيء .والجانب : المكان الذي هو طَرَف لغيره ، وتكلفُ الكينونة به كناية عن طلب البعد أي بمكان بعيد منه ، أي يتباعد عن الذكرى الأشقَى .والتعريف في { الأشقى } تعريف الجنس ، أي الأشقَونْ .و { الأشقى } : هو الشديد الشقوة ، والشقوة والشقاء في لسان الشرع الحالة الناشئة في الآخرة عن الكفر من حالة الإهانة والتعذيب ، وعندنا أن من علِمَ إلى موته مؤمناً فليس بشقي .فالأشقى : هو الكافر لأنه أشدّ الناس شقاء في الآخرة لخلوده في النار .وتعريف { الأشقى } تعريف الجنس ، فيشمل جميع المشركين . ومن المفسرين من حمله على العهد فقال : أريد به الوليد بن المغيرة ، أو عتبة بن ربيعة ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>ویتجنبھا الا شقی (11:87) ” اور اس سے گریز کرے گا انتہائی بدبخت “۔ جو شخص بدنصیب ہوگا وہ نصیحت سے دور ہوگا۔ لہٰذا ایسا شخص نہ نصیحت کی بات سنے گا اور نہ اس سے استفادہ کرے گا وہ بدنصیب ہوگا۔ مطلق بدنصیب۔ جس کے اندر بدبختی اعلیٰ درجے پر ہو ، یعنی انتہائی بدبخت۔ اپنی گری ہوئی روح کی وجہ سے بدبخت ، اس کائنات کے حقائق کا احساس نہ کرنے کی وجہ سے بدبخت۔ اس کائنات کے اندر پائے جانے والے شواہد کو نہ سمجھنے کی وجہ سے بدبخت ، اشارات کائنات کو نہ سمجھنے کی وجہ سے بدنصیب ، جو نہایت حرص سے اس دنیا کے خقیر مفادات کے پیچھے بھاگ رہا ہو ، اس کے لئے ہلکان ہورہا ہو ، اور آخرت کا بدبخت کہ وہاں اس کے نصیب میں دائمی جہنم ہوگی جس کے زمانوں کی کوئی انتہا نہ ہوگی۔</p>"
      },
      {
        "resource_id": 15,
        "text": "( وَيَتَجَنَّبُهَا ) يقول: ويتجنَّب الذكرى ( الأشْقَى ) يعني: أشقى الفريقين ( الَّذِي يَصْلَى النَّارَ الْكُبْرَى ) وهم الذين لم تنفعهم الذكرى.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَى سَيَذَّكَّرُ مَنْ يَخْشَى ) فاتقوا الله، ما خشي الله عبد قطّ إلا ذكره ( وَيَتَجَنَّبُهَا الأشْقَى ) فلا والله لا يتنكَّب عبد هذا الذكر زهدًا فيه وبُغضًا لأهله، إلا شَقِيٌّ بَيِّن الشقاء ."
      },
      {
        "resource_id": 16,
        "text": "سيتعظ الذي يخاف ربه، ويبتعد عن الذكرى الأشقى الذي لا يخشى ربه، الذي سيدخل نار جهنم العظمى يقاسي حرَّها، ثم لا يموت فيها فيستريح، ولا يحيا حياة تنفعه."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 12,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 90,
        "text": "أي العظمى , وهي السفلى من أطباق النار قاله الفراء .وعن الحسن : الكبرى نار جهنم , والصغرى نار الدنيا وقاله يحيى بن سلام ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 93,
        "text": "وقوله : ( الذى يَصْلَى النار الكبرى ) صفة للأشقى . أى : سيبتعد عن الانتفاع بتذكيرك - أيها الرسول الكريم - الكافر لمصر على كفره ، الذى من صفاته أنه سيصلى وسيلقى فى أشد طبقات النار سعيرا وحريقا ، وهى الطبقة السفلى منها ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:13 for complete tafsir.</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>الذی .................... ولا یحی (13:87) ” جو بڑی آگ میں جائے گا اور نہ اس میں مرے گا اور نہ جئے گا “۔ یہ بڑی آگ کیا ہے ؟ جہنم کی آگ۔ جس کی شدت بڑی ہوگی ، جس کے زمانے بڑے ہوں گے ، جس کی ضخامت بڑی ہوگی جس میں رہائش طویل ہوگی۔ اس میں نہ مرمٹ سکے گا کہ احساس عذاب نہ رہے اور نہ زندہ رہے گا کہ آرام سے ہو بلکہ دائمی عذاب ہوگا اور وہاں لوگ موت کو اس طرح چاہیں گے جس طرح یہاں بڑی بڑی خواہشات کے پیچھے مرتے ہیں۔ اس کے مقابلے میں نجات ہے ، فلاح ہے ، پاکیزگی اور نصیحت ہے۔</p>"
      },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "\"الذي يصلى النار الكبرى\"، العظيمة والفظيعة، لأنها أعظم وأشد حراً من نار الدنيا."
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 91,
        "text": "وأما غير المنتفعين، فذكرهم بقوله: { وَيَتَجَنَّبُهَا الْأَشْقَى الَّذِي يَصْلَى النَّارَ الْكُبْرَى } وهي النار الموقدة، التي تطلع على الأفئدة."
      },
      { "resource_id": 14, "text": "لا يوجد تفسير لهذه الأية" },
      {
        "resource_id": 15,
        "text": "وقوله: ( الَّذِي يَصْلَى النَّارَ الْكُبْرَى ) يقول: الذي يَرِد نار جهنم، وهي النار الكبرى، ويعني بالكبرى لشدّة الحرّ والألم."
      },
      {
        "resource_id": 92,
        "text": "الَّذِي يَصْلَى النَّارَ الْكُبْرَى (12) ووصْفُ { الأشقى } ب { الذي يصلى النار الكبرى } لأن إطلاق { الأشقى } في هذه الآية في صدر مدة البعثة المحمدية فكان فيه من الإِبهام ما يحتاج إلى البيان فأتبع بوصف يبيّنه في الجملة ما نزل من القرآن من قبل هذه الآية .ومقابلة { من يخشى } ب { الأشقى } تؤذن بأن { الأشقى } من شأنه أن لا يخشى فهو سادر في غروره منغمس في لهوه فلا يتطلب لنفسه تخلصاً من شقائه .ووصفُ النار ب { الكبرى } للتهويل والإِنذار والمراد بها جهنم ."
      },
      {
        "resource_id": 16,
        "text": "سيتعظ الذي يخاف ربه، ويبتعد عن الذكرى الأشقى الذي لا يخشى ربه، الذي سيدخل نار جهنم العظمى يقاسي حرَّها، ثم لا يموت فيها فيستريح، ولا يحيا حياة تنفعه."
      },
      { "resource_id": 165, "text": "<p>সে মহা অগ্নিতে প্রবেশ করবে।</p>" },
      { "resource_id": 166, "text": "<p>যে ভয়াবহ আগুনে দগ্ধ হবে,</p>" },
      {
        "resource_id": 170,
        "text": "Люди делятся на тех, кто извлекает пользу из напоминания, и тех, кто не внимает ему. Первые страшатся Аллаха, поскольку страх перед Ним и знание о грядущем воздаянии заставляют раба отдалиться от всего, что Он ненавидит, и устремиться к добру. А вторые окажутся в пылающем Пламени, которое будет пожирать людские сердца."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 13,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 90,
        "text": "ثم لا يموت فيها ولا يحيا أي لا يموت فيستريح من العذاب ، ولا يحيا حياة تنفعه كما قال الشاعر :ألا ما لنفس لا تموت فينقضي عناها ولا تحيا حياة لها طعم وقد مضى في ( النساء ) وغيرها حديث أبي سعيد الخدري ، وأن الموحدين من المؤمنين إذا دخلوا جهنم - وهي النار الصغرى على قول الفراء - احترقوا فيها وماتوا إلى أن يشفع فيهم . خرجه مسلم . وقيل : أهل الشقاء متفاوتون في شقائهم ، هذا الوعيد للأشقى ، وإن كان ثم شقي لا يبلغ هذه المرتبة ."
      },
      {
        "resource_id": 165,
        "text": "<p>অতঃপর সে সেখানে মরবেও না, [১] বাঁচবেও না।</p><p>[১] এর বিপরীতে এক শ্রেণীর (তওহীদবাদী) জাহান্নামী এমনও হবে, যারা শুধু নিজেদের কৃতপাপের শাস্তি ভোগার জন্য কিছুকাল সাময়িকভাবে জাহান্নামে অবস্থান করবে। অতঃপর আল্লাহ তাআলা তাদেরকে এক প্রকার মৃত্যু দেবেন। এমনকি তারা আগুনে পুড়ে কয়লা হয়ে যাবে। তারপর মহান আল্লাহ নবীগণের সুপারিশে তাদেরকে একদল একদল করে বের করা হবে। অতঃপর তাদেরকে জান্নাতের (হায়াত) নহরে নিক্ষেপ করা হবে। জান্নাতীগণও তাদের উপর পানি ঢালবেন। তখন তারা এতে এমন সজীব হয়ে উঠবে যেমন শস্যদানা স্রোতবাহিত আবর্জনার উপর অঙ্কুরিত হয়ে উদগত হয়। <em>(সহীহ মুসলিম ঈমান অধ্যায়, শাফাআত প্রমাণ এবং জাহান্নাম থেকে একত্ববাদীদের বের হওয়া পরিচ্ছেদ।</em></p>"
      },
      {
        "resource_id": 92,
        "text": "ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَى (13)،وجملة { ثم لا يموت فيها ولا يحيى } عطف على جملة { يصلى النار الكبرى } فهي صِلة ثانية .و ( ثم ) للتراخي الرتبي تدل على أن معطوفها متراخي الرتبة في الغرض المسوق له الكلام وهو شدة العذاب فإن تردد حالِه بين الحياة والموت وهو في عذاب الاحتراق عذاب أشدّ ممّا أفاده أنه في عذاب الاحتراق ، ضرورة أن الاحتراق واقع وقد زيد فيه درجة أنه لا راحة منه بموت ولا مخلص منه بحياة .فمعنى { لا يموت } : لا يزول عنه الإِحساس ، فإن الموت فقدان الإِحساس مع ما في هذه الحالة من الأعجوبة وهي مما يؤكد اعتبار تراخي الرتبة في هذا التنكيل .وتعقيبه بقوله : { ولا يحيى } احتراس لدفع توهم أن يراد بنفي الموت عنهم أنهم استراحوا من العذاب لما هو متعارف من أن الاحتراق يُهلك المحرَق ، فإذا قيل : { لا يموت } توهَّم المنذَرون أن ذلك الاحتراق لا يبلغ مبلغ الإِهلاك فيبقى المحرق حياً فيظن أنه إحراق هيّن فيكون مسلاة للمهددين فلدفع ذلك عطف عليه { ولا يحيى } ، أي حياة خالصة من الآلام والقرينة على الوصف المذكور مقابلة ولا يحيى بقوله : { يصلى النار الكبرى ثم لا يموت فيها } .وليس هذا من قبيل نفي وصفين لإثبات حالةٍ وسَطٍ بينَ حالتيهما مثل : { لا شرقية ولا غربية } [ النور : 35 ] وقول إحدى نساء أم زرع : «لا حَرّ ولا قُرّ» لأن ذلك لا طائل تحته .ويجوز أن نجعل نفي الحياة كناية عن نفي الخلاص بناء على أن لازم الإِحراق الهلاك ولازم الحياة عدم الهلاك .وفي الآية مُحسِّن الطباق لأجل التضاد الظاهر بين { لا يموت } و { لا يحيى } ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 159,
        "text": "<p>آیت 13{ ثُمَّ لَا یَمُوْتُ فِیْہَا وَلَا یَحْیٰی۔ } ”پھر نہ اس میں وہ مرے گا نہ زندہ رہے گا۔“ جہنم کی یہی خصوصیت سورة المدثر میں بایں الفاظ بیان ہوئی ہے : { لَا تُبْقِیْ وَلَا تَذَرُ۔ } ”وہ انسان کو نہ تو باقی رہنے دے گی اور نہ ہی اسے چھوڑے گی۔“</p>"
      },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 93,
        "text": "فوصف النار بالكبرى ، من قبيل التهويل والإنذار للمصرين على كفرهم ( ثُمَّ لاَ يَمُوتُ فِيهَا وَلاَ يَحْيَا ) أى : ثم إن هذا الشقى بعد أن يلقى به فى النار الكبرى ، ( ثُمَّ لاَ يَمُوتُ فِيهَا ) فيستريح من العذاب ( وَلاَ يَحْيَا ) حياة طيبة فيها شئ من الراحة ، بل يبقى هكذا ( وَيَأْتِيهِ الموت مِن كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ ) وشبيه بهذه الآية قوله - تعالى - : ( والذين كَفَرُواْ لَهُمْ نَارُ جَهَنَّمَ لاَ يقضى عَلَيْهِمْ فَيَمُوتُواْ وَلاَ يُخَفَّفُ عَنْهُمْ مِّنْ عَذَابِهَا كَذَلِكَ نَجْزِي كُلَّ كَفُورٍ ) وبعد هذا البيان الذى يهز القلوب . . عن سوء عاقبة الأشقياء ز"
      },
      {
        "resource_id": 14,
        "text": "أي لا يموت فيستريح ولا يحيي حياة تنفعه بل هي مضرة عليه لأن بسببها يشعر ما يعاقب به من أليم العذاب وأنواع النكال. قال الإمام أحمد حدثنا ابن أبي عدي عن سليمان يعني التيمي عن أبي نضرة عن أبي سعيد قال: قال رسول الله صلى الله عليه وسلم \"أما أهل النار الذين هم أهلها لا يموتون ولا يحيون وأما أناس يريد الله بهم الرحمة فيميتهم في النار فيدخل عليهم الشفعاء فيأخذ الرجل الضبارة فينبتهم - أو قال - ينبتون في نهر الحيا - أو قال الحياة أو قال الحيوان أو قال نهر الجنة - فينبتون نبات الحبة في حميل السيل\" قال وقال النبي صلى الله عليه وسلم \"أما ترون الشجرة تكون خضراء ثم تكون صفراء ثم تكون خضراء ؟ \" قال: فقال بعضهم كأن النبي صلى الله عليه وسلم كان بالبادية. وقال أحمد أيضا حدثنا إسماعيل حدثنا سعيد بن يزيد عن أبي نضرة عن أبي سعيد الخدري قال: قال رسول الله صلى الله عليه وسلم \"أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن أناس - أو كما قال - تصيبهم النار بذنوبهم - أو قال بخطاياهم فيميتهم إماتة حتى إذا صاروا فحما أذن في الشفاعة فجيء بهم ضبائر ضبائر فبثوا على أنهار الجنة فيقال يا أهل الجنة أفيضوا عليهم فينبتون نبات الحبة تكون في حميل السيل\" قال: فقال رجل من القوم حينئذ كأن رسول الله صلى الله عليه وسلم كان بالبادية ورواه مسلم من حديث بشر بن المفضل وشعبة كلاهما عن أبي سلمة سعيد بن يزيد به مثله ورواه أحمد أيضا عن يزيد عن سعيد بن إياس الجريري عن أبي نضرة عن أبي سعيد عن النبي صلى الله عليه وسلم قال \"إن أهل النار الذين لا يريد الله إخراجهم لا يموتون فيها ولا يحيون وأن أهل النار الذين يريد الله إخراجهم يميتهم فيها إماته حتى يصيروا فحما ثم يخرجون ضبائر فيلقون على أنهار الجنة فيرش عليهم من أنهار الجنة فينبتون كما تنبت الحبة فى حميل السيل\". وقد قال الله تعالي إخبارا عن أهل النار ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون وقال تعالي\"لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها\" إلى غير ذلك من الآيات في هذا المعنى."
      },
      {
        "resource_id": 91,
        "text": "{ ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَا } أي: يعذب عذابًا أليمًا، من غير راحة ولا استراحة، حتى إنهم يتمنون الموت فلا يحصل لهم، كما قال تعالى: { لَا يُقْضَى عَلَيْهِمْ فَيَمُوتُوا وَلَا يُخَفَّفُ عَنْهُمْ مِنْ عَذَابِهَا } ."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( ثُمَّ لا يَمُوتُ فِيهَا وَلا يَحْيَا ) يقول: ثم لا يموت في النار الكبرى ولا يحيا، وذلك أن نفس أحدهم تصير فيها في حلقه، فلا تخرج فتفارقه فيموت، ولا ترجع إلى موضعها من الجسم فيحيا. وقيل: لا يموت فيها فيستريح، ولا يحيا حياة تنفعه.وقال آخرون: قيل ذلك؛ لأن العرب كانت إذا وصفت الرجل بوقوع في شدة شديدة، قالوا: لا هو حيّ، ولا هو ميت، فخاطبهم الله بالذي جرى به ذلك من كلامهم."
      },
      {
        "resource_id": 164,
        "text": "<p>এ সূরাটি যে মক্কী সূরা তার প্রমাণ এই যে, হযরত বারা ইবনে আযিব (রাঃ) হতে বর্ণিত, তিনি বলেনঃ “নবী করীম (সঃ)-এর সাহাবীদের মধ্যে যারা সর্ব প্রথম আমাদের নিকট (মদীনায়) আসেন তারা হলেন হযরত মুসআব ইবনে উমায়ের (রাঃ) এবং হযরত ইবনে উম্মি মাকতুম (রাঃ)। তাঁরা আমাদেরকে কুরআন পড়াতে শুরু করেন। অতঃপর হযরত বিলাল (রাঃ), হযরত আম্মার (রাঃ) এবং হযরত সা'দ (রাঃ) আগমন করেন। তারপর হযরত উমার ইবনে খাত্তাব (রাঃ) বিশজন সাহাবী সমভিব্যাহারে আমাদের কছে আসেন। তারপর নবী করীম (সঃ) আসেন। আমি মদিনাবাসীকে অন্য কোন ব্যাপারে এতো বেশী খুশী হতে দেখিনি যতোটা খুশী তারা নবী (সঃ) এবং তাঁর সহচরদের আগমনে হয়েছিলেন। ছোট ছোট শিশু ও অপ্রাপ্তবয়স্ক বালকরা পর্যন্ত আনন্দে কোলাহল শুরু করে যে, ইনি হলেন আল্লাহর রাসূল হযরত মুহাম্মদ (সঃ) রাসুলুল্লাহ্ (সঃ)-এর আগমনের পূর্বেই আমি(আরবি) সূরাটি, এ ধরনের অন্যান্য সূরাগুলোর সাথে মুখস্থ করে ফেলেছিলাম।”মুসনাদে আহমদে হযরত আলী (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ্ (সঃ) (আরবি) এই সূরাটিকে খুবই ভালবাসতেন। সহীহ্ বুখারী ও সহীহ মুসলিমে বর্ণিত হয়েছে যে, রাসূলুল্লাহ্ (সঃ) হযরত মুআয (রাঃ)-কে বলেনঃ “কেন তুমি নামাযে(আরবি) এই সূরাগুলো পড় না?” মুসনাদে আহমদে আরও বর্ণিত আছে যে, নবী করীম (সঃ) উভয় ঈদের নামাযে , (আরবি) এবং এ সূরা দুটি পাঠ করতেন। যদি ঘটনাক্রমে একই দিনে জুমআ ও ঈদের নামায পড়ে যেতো তবে তিনি উভয় নামাযেই এই সূরা দুটি পড়তেন। (এ হাদীসটি সহীহ মুসলিম, সুনানে আবী দাউদ, জামে তিরমিযী, সুনানে নাসায়ী এবং সুনানে ইবনে মাজাহতেও বর্ণিত হয়েছে)মুসনাদে আহমদে উম্মুল মুমিনীন হযরত আয়েশা (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ্ (সঃ) বেতরের নামাযে (আরবি) এবং (আরবি) এই সূরাগুলো পাঠ করতেন। অন্য একটি বর্ণনায় আরো বাড়িয়ে বলা হয়েছে যে, (আরবি) এবং(আরবি) এই সূরা দু’টিও পড়তেন। (এই হাদীসটিও নানাভাবে বহুসংখ্যক সাহাবী (রাঃ) হতে বর্ণিত আছে। তবে, এসব ব্যাপারে আল্লাহ তা'আলাই সর্বাধিক সঠিক জ্ঞানের অধিকারী)<b>১-১৩ নং আয়াতের তাফসীর</b>মুসনাদে আহমদে হযরত উকবা ইবনে আমির (রাঃ) হতে বর্ণিত আছে যে, যখন (আরবি)  অবতীর্ণ হয় তখন রাসূলুল্লাহ্ (সঃ) সাহাবীদেরকে বলেনঃ “এটাকে তোমরা রুকুর মধ্যে গ্রহণ করে নাও।” তারপর যখন (আরবি) অবতীর্ণ হলো তখন তিনি বললেনঃ “এটাকে তোমরা তোমাদের সিজদাহ্নর মধ্যে গ্রহণ কর।” (এ হাদীসটি ইমাম আবু দাউদ (রঃ) ও ইমাম ইবনে মাজা (রঃ) ও বর্ণনা করেছেন)হযরত ইবনে আব্বাস (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ্ (সঃ) যখন (আরবি) পাঠ করতেন তখন তিনি (আরবি)বলতেন। [এ হাদীসটি বর্ণনা করেছেন ইমাম আহমাদ (রঃ) ও ইমাম আবু দাউদ (রঃ)]হযরত আলী (রাঃ) হতেও এটা বর্ণিত আছে। হযরত ইবনে আব্বাস (রাঃ) হতে আরো বর্ণিত আছে যে, রাসূলুল্লাহ্ (সঃ) (আরবি) পাঠ করে বলতেন এবং যখন তিনি (আরবি)এ সূরাটি পাঠ করতেন এবং শেষে, (আরবি) পড়তেন তখন বলতেন। (এটা ইমাম ইবনে জারীর (রঃ) বর্ণনা করেছেন)আল্লাহ্ তা'আলা এখানে বলেনঃ তুমি তোমার সুমহান প্রতিপালকের নামের পবিত্রতা ও মহিমা ঘোষণা কর যিনি সমস্ত মাখলুককে সৃষ্টি করেছেন এবং সকলকে সুন্দর ও উন্নত আকৃতি দান করেছেন। যিনি মানুষকে সৌভাগ্যের বলতেন পনির্দেৰেছেন। যিনি পশুদের চারণভূমিতে তৃণ ও সবুজ ঘাসের ব্যবস্থা ফোন আল্লাহ্ তা'আলা অন্য জায়গায় বলেনঃ (আরবি)অর্থাৎ “(হযরত মুসা বললেন) আমাদের প্রতিপালক তিনি যিনি প্রত্যেক বস্তুকে তার যোগ্য আকৃতি দান করেছেন, অতঃপর পথ নির্দেশ করেছেন।” (২০ ৫০) যেমন সহীহ মুসলিমে হযরত আব্দুল্লাহ ইবনে আমর (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ “আসমান ও জমীন সৃষ্টির পঞ্চাশ হাজার বছর পূর্বে আল্লাহ্ তা'আলা তাঁর সৃষ্ট জীবের ভাগ্যলিপি নির্ধারণ করেছেন। সেই সময় তার আরশ ছিল পানির উপর।”মহান আল্লাহ বলেনঃ “যিনি তৃণাদি উৎপন্ন করেন, পরে ওকে ধূসর আবর্জনায় পরিণত করেন। আরবের কোন কোন ভাষা-বিশেষজ্ঞ বলেছেন যে, এখানে (আরবি) শব্দটিকে যদিও শেষে উল্লেখ করা হয়েছে, কিন্তু অর্থের দিক দিয়ে এটাকে প্রথমে ধরে নিতে হবে। অর্থাৎ যিনি ঘাস, তৃণ, শস্য, গাঢ় সবুজ রঙের করে সৃষ্টি করেছেন, তারপর ওকে বিশুদ্ধ করেছেন। এরপর আল্লাহ্ পাক স্বীয় নবী (সঃ)-কে সম্বোধন করে বলেনঃ হে মুহাম্মাদ (সঃ) তোমাকে আমি নিশ্চয়ই পাঠ করাবো, ফলে তুমি বিস্মৃত হবে না। তবে হ্যা যদি স্বয়ং আল্লাহ্ কোন আয়াত ভুলিয়ে দিতে চান তবে সেটা স্বতন্ত্র কথা। ইমাম ইবনে জারীর (রঃ) এ অর্থই পছন্দ করেন এবং তাতে এ আয়াতের অর্থ হবেঃ যে কুরআন আমি তোমাকে পড়াচ্ছি তা ভুলে যেয়ো না। তবে হ্যা, আমি যে অংশ মানসুখ করে দেই সেটা ভিন্ন কথা। অতঃপর আল্লাহ তাবারাকা ওয়া তা'আলা বলেনঃ আল্লাহর কাছে তাঁর বান্দাদের প্রকাশ্য ও গোপনীয় সমস্ত আমল বা কাজ এবং আকীদা বা বিশ্বাস সবই সুস্পষ্ট। হে নবী (সঃ)! আমি তোমার উপর ভাল কাজ, ভাল কথা, শরীয়তের হুকুম-আহকাম সহজ করে দিবো। এতে কোন প্রকার সংকীর্ণতা ও কাঠিন্য থাকবে না। থাকবে না কোন প্রকার বক্রতা। তুমি এমন জায়গায় উপদেশ দাও যেখানে উপদেশ হয় ফলপ্রসূ। এতে বুঝা যায় যে, অযোগ্য নালায়েকদেরকে শিক্ষাদান করা উচিত নয়। যেমন আমীরুল মুমিনীন হযরত আলী (রাঃ) বলেনঃ “যদি তোমরা কারো সাথে এমন কথা বল যা তার জন্যে বোধগম্য নয়, তবে তোমাদের কল্যাণকর কথা তার জন্যে অকল্যাণ বয়ে আনবে। তাতে ফিত্না-ফাসা ব। বরং মানুষের সাথে তোমরা তাদের বোধগম্য বিষয়ে কথা বলো, যাতে মানুষ আল্লাহ্ ও তাঁর রাসূল (সঃ)-কে মিথ্যা প্রতিপন্ন করতে না পারে।” এরপর আল্লাহ তা'আলা বলেনঃ এই কুরআন থেকে তারাই নসীহত বা উপদেশ লাভ করবে যাদের অন্তরে আল্লাহ্ ভীতি রয়েছে এবং যারা আল্লাহর সাথে সাক্ষাতের ভয় মনে পোষণ করে। পক্ষান্তরে, যারা হতভাগ্য তারা এ কুরআন থেকে কোন শিক্ষা বা উপদেশ গ্রহণ করতে পারবে না। তারা হবে জাহান্নামের অধিবাসী। যেখানে কোনরূপ আরাম-আয়েশ ও শান্তি-সুখ নেই, বরং আছে চিরস্থায়ী আযাব ও নানা প্রকার যন্ত্রণাদায়ক শাস্তি।যারা আসল জাহান্নামী তারা না মৃত্যুবরণ করবে, না শান্তিপূর্ণ জীবন যাপন করতে পাবে। তবে যাদের প্রতি আল্লাহ্ তা'আলা দয়া করার ইচ্ছা রাখেন তারা জাহান্নামের আগুনে পতিত হবার সাথে সাথেই পুড়ে মারা যাবে। তারপর সুপারিশকারী লোকেরা গিয়ে তাদের জন্যে সুপারিশ করবেন এবং তাদেরকে জাহান্নাম হতে বের করে এনে জীবনদানকারী ঝর্ণায় ফেলে দিবেন। তাদের উপর জান্নাতের ঐ ঝর্ণাধারা পানি ঢেলে দেয়া হবে। ফলে তারা সজীব হয়ে উঠবে যেমনভাবে বন্যায় নিক্ষেপিত বস্তুর (আবর্জনা স্কুপের) মাঝে বীজ গজিয়ে ওঠে।” তারপর রাসূলুল্লাহ (সঃ) বললেনঃ “তোমরা দেখো না যে, ঐ উদ্ভিদ প্রথমে সবুজ হয়, তারপর হলদে হয় এবং শেষে পূর্ণ সজীবতা লাভ করে থাকে?” তখন সাহাবীদের কোন একজন বললেনঃ “নবীপাক (সঃ), কথাগুলো এমনভাবে বললেন যে, যেন তিনি জঙ্গলেই ছিলেন।” (এ হাদীসটি মুসনাদে আহমদে হযরত আবু সাঈদ (রাঃ) হতে বর্ণিত আছে। তাছাড়া এটা বিভিন্ন শব্দে আরো বহু হাদীসগ্রন্থে বর্ণিত হয়েছে)আল্লাহ্ তা'আলা জাহান্নামবাসীদের সম্পর্কে খবর দিতে গিয়ে কুরআন কারীমে বলেছেনঃ (আরবি)অর্থাৎ “জাহান্নামীরা চীৎকার করে বলবেঃ হে (জাহান্নামের দারোগা) মালিক! আপনার প্রতিপালককে বলুন যে, তিনি যেন আমাদের মৃত্যু ঘটিয়ে দেন। তখন জবাবে তাদেরকে বলা হবেঃ তোমাদেরকে এখানেই পড়ে থাকতে হবে।” (৪৩:৭৭) আর এক জায়গায় আল্লাহ পাক বলেনঃ (আরবি)তাদের মৃত্যুও ঘটানো হবে না এবং তাদের আযাবও হালকা করা করেন। (০৫:৬)এই অর্থ সম্বলিত আরো আয়াত রয়েছে।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>তারপর সেখানে সে মরবেও না বাঁচবেও না [১]।</p><p>[১] অর্থাৎ তার মৃত্যু হবে না। যার ফলে আযাব থেকে রেহাই পাবে না। আবার বাঁচার মতো বাঁচাবেও না। যার ফলে জীবনের কোন স্বাদ-আহলাদও পাবে না। [ইবন কাসীর] হাদীসে এসেছে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, “আর যারা জাহান্নামী; তারা সেখানে মরবেও না, বাঁচবেও না। তবে এমন কিছু লোক হবে যারা গোনাহ করেছিল (কিন্তু মুমিন ছিল) তারা সেখানে মরে যাবে। তারপর যখন তারা কয়লায় পরিণত হবে তখন তাদের জন্য সুপারিশের অনুমতি দেয়া হবে; ফলে তাদেরকে টুকরা টুকরা অবস্থায় নিয়ে এসে জান্নাতের নালাসমূহে প্রসারিত করে রাখা হবে। তারপর বলা হবে, হে জান্নাতীরা তোমরা এদেরকে সিক্ত কর। এতে তারা বন্যায় ভেসে আসা বীজের ন্যায় আবার উৎপন্ন হবে।” [মুসলিম: ১৮৫] এ হাদীস থেকে বোঝা গেল যে, আলোচ্য আয়াতে শুধু কাফের মুশরিকদের ক্ষেত্রেই বলা হয়েছে যে, তারা বাঁচবেও না আবার মরবেও না। অর্থাৎ তারা আরামের বাঁচা বাঁচবে না। আবার মৃত্যুও হবে না যে, তারা আযাব থেকে মুক্তি পেয়ে যাবে। পক্ষান্তরে ঈমানদারদের ব্যাপারটি সম্পূর্ণ ভিন্ন। তারা জাহান্নামে গেলে সেখানে তাদের গোনাহ পরিমাণ শাস্তি ভোগ করার পর মৃত্যু প্রাপ্ত হবে, ফলে তারা অতিরিক্ত শাস্তি ভোগ থেকে মুক্তি পাবে। এরপর সুপারিশের মাধ্যমে সেখান থেকে বেরিয়ে আসবে।</p>"
      },
      {
        "resource_id": 170,
        "text": "Его постигнет мучительная кара, и не увидит он ни покоя, ни отдыха. Он будет желать себе смерти, но не увидит ее, как сказал Всевышний: «С ними не покончат так, чтобы они могли умереть, и их мучения не облегчатся» (35:36)."
      },
      {
        "resource_id": 94,
        "text": "\"ثم لا يموت فيها\"، فيستريح، \" ولا يحيا \"، حياة تنفعه."
      },
      {
        "resource_id": 16,
        "text": "سيتعظ الذي يخاف ربه، ويبتعد عن الذكرى الأشقى الذي لا يخشى ربه، الذي سيدخل نار جهنم العظمى يقاسي حرَّها، ثم لا يموت فيها فيستريح، ولا يحيا حياة تنفعه."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 14,
    "tafsirs": [
      {
        "resource_id": 91,
        "text": "{ قَدْ أَفْلَحَ مَنْ تَزَكَّى } أي: قد فاز وربح من طهر نفسه ونقاها من الشرك والظلم ومساوئ الأخلاق."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 94,
        "text": "( قد أفلح من تزكى ) تطهر من الشرك وقال : لا إله إلا الله . هذا قول عطاء وعكرمة ، ورواية الوالبي وسعيد بن جبير عن ابن عباس وقال الحسن : من كان عمله زاكيا .وقال آخرون : هو صدقة الفطر ، روي عن أبي سعيد الخدري في قوله : \" قد أفلح من تزكى \" قال : أعطى صدقة الفطر ."
      },
      {
        "resource_id": 16,
        "text": "قد فاز مَن طهر نفسه من الأخلاق السيئة، وذكر الله، فوحَّده ودعاه وعمل بما يرضيه، وأقام الصلاة في أوقاتها؛ ابتغاء رضوان الله وامتثالا لشرعه."
      },
      {
        "resource_id": 169,
        "text": "<h2>A Statement concerning the People of Success</h2><p>Allah says,</p><div class=\"arabic uthmani\">قَدْ أَفْلَحَ مَن تَزَكَّى </div><p>(Indeed whosoever purifies himself shall achieve success.) meaning, he purifies himself from despised characteristics and he follows what Allah has revealed to the Messenger .</p><div class=\"arabic uthmani\">وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى </div><p>(And remembers the Name of his Lord, and performs Salah.) meaning, he establishes the prayer in its appointed time, seeking the pleasure of Allah, obedience to His command, and implementation of His Law. We have already reported from the Commander of the believers, `Umar bin `Abdul-`Aziz, that he used to command the people to give the Sadaqat Al-Fitr, and he would recite this Ayah:</p><div class=\"arabic uthmani\">قَدْ أَفْلَحَ مَن تَزَكَّى - وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى </div><p>(Indeed whosoever purifies himself shall achieve success. And remembers the Name of his Lord, and performs Salah.) Abu Al-Ahwas said, \"If someone comes to any of you begging, and he wants to pray, then he should give charity (Zakah) before he prays. For verily, Allah the Exalted says,</p><div class=\"arabic uthmani\">قَدْ أَفْلَحَ مَن تَزَكَّى - وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى </div><p>(Indeed whosoever purifies himself shall achieve success. And remembers the Name of his Lord, and performs Salah.)\" Qatadah said concerning this Ayah,</p><div class=\"arabic uthmani\">قَدْ أَفْلَحَ مَن تَزَكَّى - وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى </div><p>(Indeed whosoever purifies himself shall achieve success. And remembers the Name of his Lord, and performs Salah (Fasalla).) \"He purifies his wealth and pleases his Creator.\"</p><h2>This World is Worthless in Comparison to the Hereafter</h2><p>Then Allah says,</p><div class=\"arabic uthmani\">بَلْ تُؤْثِرُونَ الْحَيَوةَ الدُّنْيَا </div><p>(Rather you prefer the life of this world.) meaning, `you give it precedence over the matter of the Hereafter, and you prefer it because of what it contains of usefulness and benefit for you in livelihood, and your returns (i.e., income, profitable gain).'</p><div class=\"arabic uthmani\">وَالاٌّخِرَةُ خَيْرٌ وَأَبْقَى </div><p>(Although the Hereafter is better and more lasting.) meaning, the reward of the final abode is better than the worldly life, and it is more lasting. For indeed, this worldly life is lowly and temporal, whereas the Hereafter is noble and eternal. Thus, how can an intelligent person prefer that which is short-lived over that which is eternal. How can he give importance to that which will soon pass away from him, while ignoring the importance of the abode of eternity and infinity. Imam Ahmad recorded from Abu Musa Al-Ash`ari that the Messenger of Allah said,</p><div class=\"arabic uthmani\">«مَنْ أَحَبَّ دُنْيَاهُ أَضَرَّ بِآخِرَتِهِ، وَمَنْ أَحَبَّ آخِرَتَهُ أَضَرَّ بِدُنْيَاهُ، فَآثِرُوا مَا يَبْقَى عَلَى مَا يَفْنَى»</div><p>(Whoever loves his worldly life, will suffer in his Hereafter, and whoever loves his worldly life, will suffer in his Hereafter, and whoever loves his Hereafter, will suffer in his worldly life. Therefore, chose that which is everlasting over that which is temporal.) Ahmad was alone in recording this Hadith.</p><h2>The Scriptures of Ibrahim and Musa</h2><p>Allah then says,</p><div class=\"arabic uthmani\">إِنَّ هَـذَا لَفِى الصُّحُفِ الاٍّولَى - صُحُفِ إِبْرَهِيمَ وَمُوسَى </div><p>(Verily, this is in the former Scriptures -- the Scriptures of Ibrahim and Musa.) This Ayah is similar to Allah's statement in Surat An-Najm,</p><div class=\"arabic uthmani\">أَمْ لَمْ يُنَبَّأْ بِمَا فِى صُحُفِ مُوسَى - وَإِبْرَهِيمَ الَّذِى وَفَّى - أَلاَّ تَزِرُ وَزِرَةٌ وِزْرَ أُخْرَى - وَأَن لَّيْسَ لِلإِنسَـنِ إِلاَّ مَا سَعَى - وَأَنَّ سَعْيَهُ سَوْفَ يُرَى - ثُمَّ يُجْزَاهُ الْجَزَآءَ الأَوْفَى - وَأَنَّ إِلَى رَبِّكَ الْمُنتَهَى </div><p>(Or is he not informed with what is in the Scriptures of Musa. And of Ibrahim who fulfilled (or conveyed) all that (Allah ordered him to do or convey): that no burdened person (with sins) shall bear the burden (sins) of another. And that man can have nothing but what he does. And that his deeds will be seen. Then he will be recompensed with a full and the best recompense. And that to your Lord is the End (Return of everything).) (53:36-42) And so forth, until the end of these Ayat. Abu `Aliyah said, \"The story of this Surah is in the earlier Scriptures.\" Ibn Jarir preferred the view that the meaning of Allah's statement,</p><div class=\"arabic uthmani\">إِنَّ هَذَآ</div><p>(Verily, this) is referring to His previous statement,</p><div class=\"arabic uthmani\">قَدْ أَفْلَحَ مَن تَزَكَّى - وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى - بَلْ تُؤْثِرُونَ الْحَيَوةَ الدُّنْيَا - وَالاٌّخِرَةُ خَيْرٌ وَأَبْقَى </div><p>(Indeed whosoever purifies himself shall achieve success. And remembers the Name of his Lord, and offers Salah. Rather you prefer the life of this world. Although the Hereafter is better and more lasting.) Then Allah says,</p><div class=\"arabic uthmani\">إِنَّ هَذَآ</div><p>(Verily, this) meaning, the content of this discussion,</p><div class=\"arabic uthmani\">إِنَّ هَـذَا لَفِى الصُّحُفِ الاٍّولَى - صُحُفِ إِبْرَهِيمَ وَمُوسَى </div><p>(in the former Scriptures, the Scriptures of Ibrahim and Musa.) This view that he (At-Tabari) has chosen is good and strong. Similar to it has been reported from Qatadah and Ibn Zayd. And Allah knows best. This is the end of the Tafsir of Surat Al-A`la (Sabbih). All praise and blessings are due to Allah, and He is the Giver of success and protection from error.</p>"
      },
      {
        "resource_id": 160,
        "text": "<p>جس نے صلوۃ کو بروقت ادا کیا اللہ تعالیٰ فرماتا ہے جس نے رذیل اخلاق سے اپنے تئیں پاک کرلیا احکام اسلام کی تابعداری کی نماز کو ٹھیک وقت پر قائم رکھا صرف اللہ تعالیٰ کی رضا مندی اور اس کی خوشنودی طلب کرنے کے لیے اس نے نجات اور فلاح پالی رسول اللہ ﷺ نے اس آیت کی تلاوت کر کے فرمایا کہ وہ شخص اللہ تعالیٰ کے وحدہ لا شریک ہونے کی گواہی دے اس کے سوال کسی کی عبادت نہ کرے اور میری رسالت کو مان لے اور پانچوں وقت کی نمازوں کی پوری طرح حفاظت کرے وہ نجات پا گیا (بزار) ابن عباس فرماتے ہیں کہ اس سے مراد پانچ وقت کی نماز ہے حضرت ابو العالیہ نے ایک مرتبہ الو خلدہ سے فرمایا کہ کل جب عید گاہ جاؤ تو مجھ سے ملتے جانا جب میں گیا تو مجھ سے کہا کچھ کھالیا ہے میں نے کہا ہاں، فرمایا نہا چکے ہو ؟ میں نے کہا ہاں فرمایا زکوٰۃ فطر ادا کرچکے ہو ؟ میں نے کہا ہاں، فرمایا بس یہی کہنا تھا کہ اس آیت میں یہی مراد ہے۔ اہل مدینہ فطرہ سے اور پانی پلانے سے افضل اور کوئی صدقہ نہیں جانتے تھے حضرت عمر بن عبدالعزیز ؒ بھی لوگوں کو فطرہ ادا کرنے کا حکم کرتے پھر اسی آیت کی تلاوت کرتے، حضرت ابو الاحواص فرماتے ہیں جب تم میں سے کوئی نماز کا ارادہ کرے اور کوئی سائل آجائے تو اسے خیرات دے دے پھر یہی آیت پڑھی۔ حضرت قتادہ فرماتے ہیں اس نے اپنے مال کو پاک کرلیا اور اپنے رب کو راضی کرلیا پھر ارشاد ہے کہ تم دنیا کی زندگی کو آخرت کی زندگی پر ترجیح دے رہے ہو اور دراصل تمہاری مصلحت تمہارا نفع اخروی زندگی کو دنیوی زندگی پر ترجیح دینے میں ہے دنیا ذلیل ہے فانی ہے آخرت شریف ہے باقی ہے کوئی عاقل ایسا نہیں کرسکتا کہ فانی کو باقی کی جگہ اختیار کرلے اور اس فانی کے انتظام میں پڑ کر اس باقی کے اہتمام کو چھوڑ دے مسند احمد میں ہے رسول اللہ ﷺ فرماتے ہیں دنیا اس کا گھر ہے جس کا آخرت میں نہ ہو دنیا اس کا مال ہے جس کا مال وہاں نہ ہو اسے جمع کرنے کے پیچھے وہ لگتے ہیں جو بیوقوف ہیں ابن جریر میں ہے کہ حضرت عرفجہ ثقفی اس سورت کو حضرت ابن مسعود ؓ کے پاس پڑھ رہے تھے جب اس آیت پر پہنچے تو تلاوت چھوڑ کر اپنے ساتھیوں سے فرمانے لگے کہ سچ ہے ہم نے دنیا کو آخرت پر ترجیح دی لوگ خاموش رہے تو آپ نے پھر فرمایا کہ اس لیے کہ ہم دنیا کے گرویدہ ہوگئے کہ یہاں کی زینت کو یہاں کی عورتوں کو یہاں کے کھانے پینے کو ہم نے دیکھ لیا آخرت نظروں سے اوجھل ہے اس لیے ہم نے اس سامنے والی کی طرف توجہ کی اور اس نظر نہ آنے والی سے آنکھیں پھیر لیں یا تو یہ فرمان حضرت عبداللہ کا بطور تواضع کے ہے یا جنس انسان کی بابت فرماتے ہیں واللہ اعلم۔ رسول اللہ ﷺ فرماتے ہیں جس نے دنیا سے محبت کی اس نے اپنی آخرت کو نقصان پہنچایا اور جس نے آخرت سے محبت رکھی اس نے دنیا کو نقصان پہنچایا تم اے لوگو ! باقی رہنے والی کو فنا ہونے والی پر ترجیح دو ، مسند احمد پھر فرماتا ہے کہ ابراہیم اور موسیٰ کے صحیفوں میں بھی یہ تھا رسول اللہ ﷺ فرماتے ہیں کہ یہ سب بیان ان صحیفوں میں بھی تھا (بزار) نسائی میں حضرت عباس سے یہ مروی ہے اور جب آیت (وَاِبْرٰهِيْمَ الَّذِيْ وَفّيٰٓ 37؀ۙ) 53۔ النجم :37) نازل ہوئی تو فرمایا کہ اس سے مراد یہ ہے کہ ایک کا بوجھ دوسرے کو نہ اٹھانا ہے سورة نجم میں ہے آیت (اَمْ لَمْ يُنَبَّاْ بِمَا فِيْ صُحُفِ مُوْسٰى 36؀ۙ) 53۔ النجم :36) آخری مضمون تک کی تمام آیتیں یعنی یہ سب احکام اگلی کتابوں میں بھی تھے اسی طرح یہاں بھی مراد سبح اسم کی یہ آیتیں ہیں بعض نے پوری سورت کہی ہے بعض نے قد افلح سے ابقی تک کہا ہے زیادہ قوی بھی یہی قول معلوم ہوتا ہے واللہ اعلم۔ الحمد اللہ سورة سبح کی تفسیر ختم ہوئی واللہ الحمد والمنہ وبہ التوفیق والعصمہ</p>"
      },
      {
        "resource_id": 93,
        "text": "ساق - سبحانه - ما يدخل البهجة والسرور على النفوس ، عن طريق بيان حسن عاقبة السعداء ، فقال : ( قَدْ أَفْلَحَ مَن تزكى . وَذَكَرَ اسم رَبِّهِ فصلى ) .أى : قد أفلح وفاز وانتفع بالتذكير ، من حاول تزكية نفسه وتطهيرها من كل سوء .ومن ذكر اسم ربه بقلبه ولسانه ، فصلى الصلوات الخمس التى فرضها الله - تعالى - عليه . وأضاف إليها ما استطاع من نوافل وسنن .وعبر - سبحانه - بقوله : ( قَدْ أَفْلَحَ ) ليجمع فى هذا التعبير البليغ ، كل معانى الخير والنفع ، لأن الفلاح معناه : وصول المرء إلى ما يطمح إليه من فوز ونفع .وجاء التبعير بالماضى المسبوق بقد ، للدلالة على تحقيق هذا الفلاح بفضل الله - تعالى - ورحمته ."
      },
      {
        "resource_id": 92,
        "text": "قَدْ أَفْلَحَ مَنْ تَزَكَّى (14) استئناف بياني لأن ذكر { من يخشى } [ الأعلى : 10 ] وذكر { الأشقى } [ الأعلى : 11 ] يثير استشراف السامع لمعرفة أثر ذلك فابتدىء بوصف أثر الشقاوة فوصف { الأشقى } بأنه { يصلى النار الكبرى } [ الأعلى : 12 ] وأخر ذكر ثواب الأتقى تقديماً للأهمّ في الغرض وهو بيان جزاء الأشقى الذي يتجنب الذكرى وبقي السامع ينتظر أن يعلم جزاء من يخشى ويتذكر . فلما وفي حق الموعظة والترهيبة استؤنف الكلام لبيان المثوبة والترغيب . فالمراد ب { من تزكى } هنا عين المراد ب «من يخشى ويذكر» فقد عرف هنا بأنه الذي ذكر اسم ربه ، فلا جرم أن ذكر اسم ربه هو التذكر بالذكرى ، فالتذكر هو غاية الذكرى المأمور بها الرسول صلى الله عليه وسلم في قوله تعالى : { فذكر } [ الأعلى : 9 ] .وقد جُمعت أنواع الخير في قوله : { قد أفلح } فإن الفلاح نجاح المرء فيما يطمح إليه فهو يجمع معنيي الفوز والنفع وذلك هو الظفر بالمبتغى من الخير ، وتقدم في قوله تعالى : { وأولئك هم المفلحون } في البقرة ( 5 ) .والإِتيان بفعل المضي في قوله أفلح } للتنبيه على المحقق وقوعه من الآخرة ، واقترانه بحرف { قد } لتحقيقه وتثنيته كما في قوله تعالى : { قد أفلح المؤمنون } [ المؤمنون : 1 ] وقوله : { قد أفلح من زكاها } [ الشمس : 9 ] لأن الكلام موجه إلى الأشقَيْنَ الذين تجنبوا الذكرى إثارة لهمتهم في الإلتحاق بالذين خشوا فأفلحوا .ومعنى { تزكَّى } : عالج أن يكون زكياً ، أي بذل استطاعته في تطهير نفسه وتزكيتها كما قال تعالى : { قد أفلح من زكاها وقد خاب من دساها } [ الشمس : 9 10 ] .فمادة التفعل للتكلف وبذل الجهد ، وأصل ذلك هو التوحيدُ والاستعداد للأعمال الصالحة التي جاء بها الإسلام ويجيء بها ، فيشمل زكاة الأموال .أخرج البزار عن جابر بن عبدالله عن النبي صلى الله عليه وسلم قال : { قد أفلح من تزكى } قال : من شهد أن لا إله إلا الله ، وخلع الأنداد ، وشهد أني رسول الله"
      },
      {
        "resource_id": 166,
        "text": "<p>অবশ্যই সাফল্য লাভ করবে যে পরিশুদ্ধ হয় [১]।</p><p>[১] এখানে পরিশুদ্ধ বা পবিত্রতার অর্থ কুফার ও শির্ক ত্যাগ করে ঈমান আনা, অসৎ আচার-আচরণ ত্যাগ করে  সদাচার অবলম্বন করা এবং অসৎকাজ ত্যাগ করে সৎকাজ করা। আর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের কাছে যা নাযিল হয়েছে তার অনুসরণ করা। আয়াতের আরেক অর্থ, ধনসম্পদের যাকাত প্ৰদান করা। তবে যাকাতকেও একারণে যাকাত বলা হয় যে, তা ধন-সম্পদকে পরিশুদ্ধ করে। এখানে تزكى শব্দের অর্থ ব্যাপক হতে পারে। ফলে ঈমানগত ও চরিত্রগত পরিশুদ্ধি এবং আর্থিক যাকাত প্ৰদান সবই এই আয়াতের অন্তর্ভুক্ত বলে বিবেচিত হবে। [দেখুন, ফাতহুল কাদীর]</p>"
      },
      {
        "resource_id": 14,
        "text": "أي طهر نفسه من الأخلاق الرذيلة وتابع ما أنزل الله على الرسول صلى الله عليه وسلم."
      },
      {
        "resource_id": 168,
        "text": "<p>قَدْ أَفْلَحَ مَن تَزَكَّىٰ (Success is surely achieved by him who purifies himself,..87:14) The word tazakka is derived from zakah, the primitive meaning of which is 'to purify'. The zakah of wealth is so called because it purifies the rest of man's wealth for him. In this context, the word tazakka is used in a general sense, which comprehends the purity of faith and character, and purity of wealth.</p><p>وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ (and pronounces the name of his Lord, then offers prayer....87:15). This covers all categories of prayer, obligatory as well as supererogatory. Some commentators say that it refers especially to Id prayers. This interpretation too can fall under the preceding category.</p><p>بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا (But you prefer the worldly life,...87:16). Sayyidna ` Abdullah Ibn Masud ؓ says that people generally prefer the worldly blessings and comforts to the blessings and comforts of the Hereafter, because the former is visible and readily available, while the latter is invisible and unavailable readily. People unaware of reality preferred the visible to the invisible, which became the cause of eternal loss. In order to spare them the eternal loss, Allah, through His Messengers ﷺ and Books, described to them the blessings and comforts of the Hereafter so clearly as if they can perceive them [ through their sense organs ]. It has been made plain to them that what they think is readily available and preferred, is actually fragile and will very soon perish. It is unwise to put one's heart into, or faith in, it and waste one's energy on it. Thus the Qur'an says:</p><p>وَالْآخِرَةُ خَيْرٌ وَأَبْقَىٰ (while the Hereafter is much better and much more durable...87:17). The verse purports to warn those who prefer this life to the Hereafter that they should use their intelligence to find out what they have preferred and what they have abandoned. They are, first of all, made to realise that the highest degree of comfort and pleasure in this life is not free from the mixture of grief and hardship. In the second place, it is not permanent. We experience in our daily life that a king of today becomes a pauper tomorrow. A vigorous youth of today becomes old tomorrow. In the Hereafter, on the other hand, there will be freedom from both these defects. All its blessings and comforts will be 'much better' and they cannot be compared to the blessings and comforts of this life. Most importantly, it is abqa 'much more durable'.</p><p>Let us consider the following scenario: It is said to a person that there are two houses in front of him, one of which is a magnificent mansion, fully furnished and another an ordinary, substandard house, not properly furnished. He has the choice to take the mansion, but only for a month or two. Thereafter, he will have to vacate the mansion. Or he may take the underdeveloped house that he will own permanently. Which of the two houses a wise person will prefer? The answer is obvious that he will prefer the second option. On this analogy, one should prefer the blessings of the Hereafter even if, for argument's sake, they are substandard, because they are permanent and eternal. But the fact is that they are not only permanent, but also much better and far more superior to the worldly comforts. In this situation only an unfortunate fool will prefer the blessings of this life to the bounties of the Hereafter.</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:19 for complete tafsir.</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>قد افلح ................................ فصلی (15:87) ” فلاح پا گیا وہ جس نے پاکیزگی اختیار کی اور اپنے رب کا نام یاد کیا پھر نماز پڑھی “۔ تزکی کے معنی ہیں ہر گندگی اور ہر گناہ سے پاکیزگی اختیار کی۔ اس آیت میں اللہ فیصلہ فرماتا ہے کہ جو پاکیزگی اختیار کرے اور اپنے دل میں رب کا جلال بسائے اور پھر نماز پڑھے یا اللہ سے ڈرے اور اطاعت کرے۔ دونوں معنوں سے اللہ کی یاد تازہ ہوتی ہے اور جلال دل میں بیٹھتا ہے اور ضمیر میں اللہ کی ہیبت پیدا ہوتی ہے۔ تو فیصلہ یہ ہے کہ وہ شخص فلاح پائے گا۔ دنیا میں بھی وہ فلاح پائے گا کہ اس کا دل اللہ سے جڑا ہوا ہوگا ، زندہ ہوگا ، اللہ کے ذکر میں وہ مٹھاس محسوس کرے گا اور اس کو باری تعالیٰ سے انس ہوگا اور آخرت میں بھی فلاح پائے گا۔ وہاں بڑی آگ سے بچے گا اور جنتوں میں نعیم مقیم میں ہوگا۔ دونوں کا انجام دے دیا گیا اور دونوں کے انجام میں بعد المشرقین ہے۔</p><p>اس خوفناک منظر میں ، جس میں نار کبریٰ دکھائی گئی ہے اور اس کے بالمقابل نجات کا منظر دکھایا گیا ہے ان لوگوں کے لئے جو پاکیزگی اختیار کرتے ہیں۔ ان مناظر کے بعد بتایا جاتا ہے لوگ بدبختی کے چنگل میں کیوں پھنس جاتے ہیں اور ان کی غفلت کا اصل سبب کیا ہے اور عبرت آموزی ، تطہیر اور فلاح ونجات سے ان کو کیا چیز روکتی ہے۔ اور وہ کیا چیز ہے جو انہیں جہنم رسید کرتی ہے اور بدبخت بنادیتی ہے۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>নিশ্চয় সে সাফল্য লাভ করে, যে নিজেকে পরিশুদ্ধ করে।[১]</p><p>[১] অর্থাৎ, যে নিজের আত্মাকে নোংরা আচরণ থেকে এবং অন্তরকে শিরক ও পাপাচারের পঙ্কিলতা থেকে পবিত্র করে।</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : قد أفلح من تزكىفيه:الأولى : قوله تعالى : قد أفلح أي قد صادف البقاء في الجنة أي من تطهر من الشرك بإيمان قاله ابن عباس وعطاء وعكرمة . وقال الحسن والربيع : من كان عمله زاكيا [ ص: 20 ] ناميا . وقال معمر عن قتادة : تزكى قال بعمل صالح . وعنه وعن عطاء وأبي العالية : نزلت في صدقة الفطر . وعن ابن سيرين قد أفلح من تزكى وذكر اسم ربه فصلى قال : خرج فصلى بعدما أدى . وقال عكرمة : كان الرجل يقول أقدم زكاتي بين يدي صلاتي . فقال سفيان : قال الله تعالى : قد أفلح من تزكى وذكر اسم ربه فصلى . وروي عن أبي سعيد الخدري وابن عمر : أن ذلك في صدقة الفطر ، وصلاة العيد . وكذلك قال أبو العالية ، وقال : إن أهل المدينة لا يرون صدقة أفضل منها ، ومن سقاية الماء . وروى كثير بن عبد الله عن أبيه عن جده ، عن النبي - صلى الله عليه وسلم - في قوله تعالى : قد أفلح من تزكى قال : ( أخرج زكاة الفطر ) ، وذكر اسم ربه فصلى قال : ( صلاة العيد ) . وقال ابن عباس والضحاك : وذكر اسم ربه في طريق المصلى فصلى صلاة العيد .وقيل : المراد بالآية زكاة الأموال كلها قال أبو الأحوص وعطاء . وروى ابن جريج قال : قلت لعطاء : قد أفلح من تزكى للفطر ؟ قال : هي للصدقات كلها . وقيل : هي زكاة الأعمال ، لا زكاة الأموال ، أي تطهر في أعماله من الرياء والتقصير ; لأن الأكثر أن يقال في المال : زكى ، لا تزكى . وروى جابر بن عبد الله قال : قال النبي - صلى الله عليه وسلم - : \" قد أفلح من تزكى أي من شهد أن لا إله إلا الله ، وخلع الأنداد ، وشهد أني رسول الله \" . وعن ابن عباس تزكى قال : لا إله إلا الله . وروى عنه عطاء قال : نزلت في عثمان بن عفان - رضي الله عنه - قال : كان بالمدينة منافق كانت له نخلة بالمدينة ، مائلة في دار رجل من الأنصار ، إذا هبت الرياح أسقطت البسر والرطب إلى دار الأنصاري ، فيأكل هو وعياله ، فخاصمه المنافق فشكا ذلك إلى رسول الله - صلى الله عليه وسلم - فأرسل إلى المنافق وهو لا يعلم نفاقه ، فقال : \" إن أخاك الأنصاري ذكر أن بسرك ورطبك يقع إلى منزله ، فيأكل هو وعياله ، فهل لك أن أعطيك نخلة في الجنة بدلها \" ؟ فقال : أبيع عاجلا بآجل لا أفعل . فذكروا أن عثمان بن عفان أعطاه حائطا من نخل بدل نخلته ففيه نزلت قد أفلح من تزكى . ونزلت في المنافق ويتجنبها الأشقى . وذكر الضحاك أنها نزلت في أبي بكر الصديق - رضي الله عنه - .الثانية : قد ذكرنا القول في زكاة الفطر في سورة ( البقرة ) مستوفى . وقد تقدم أن هذه السورة مكية في قول الجمهور ، ولم يكن بمكة عيد ولا زكاة فطر . القشيري : ولا يبعد أن يكون أثنى على من يمتثل أمره في صدقة الفطر وصلاة العيد ، فيما يأمر به في المستقبل ."
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  قَدْ أَفْلَحَ مَنْ تَزَكَّى (14)يقول تعالى ذكره: قد نجح وأدرك طلبته من تطهَّر من الكفر ومعاصي الله، وعمل بما أمره الله به، فأدّى فرائضه.وبنحو الذي قلنا في ذلك قال جماعة من أهل التأويل.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح، قال: ثني معاوية، عن عليّ، عن ابن عباس، قوله: ( قَدْ أَفْلَحَ مَنْ تَزَكَّى ) يقول: مَنْ تَزَكَّى من الشرك .حدثنا محمد بن المثنى، قال: ثنا محمد بن عبد الله الأنصاري، قال: ثنا هشام، عن الحسن، في قوله: ( قَدْ أَفْلَحَ مَنْ تَزَكَّى ) قال: من كان عمله زاكيًا .حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة ( قَدْ أَفْلَحَ مَنْ تَزَكَّى ) قال: يعمل وَرِعًا .حدثني سعد بن عبد الله بن عبد الحكم، قال: ثنا حفص بن عُمر العَدَنيّ، عن الحكم، عن عكرِمة، في قوله: ( قَدْ أَفْلَحَ مَنْ تَزَكَّى ) من قال: لا إله إلا الله .وقال آخرون: بل معنى ذلك: قد أفلح من أدّى زكاة ماله.* ذكر من قال ذلك:حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن عليّ بن الأقمر، عن أبي الأحوص ( قَدْ أَفْلَحَ مَنْ تَزَكَّى ) قال: من استطاع أن يرضَخَ فليفعل، ثم ليقم فليصلّ .حدثنا محمد بن عمارة الرازي، قال: ثنا أبو نعيم، قال: ثنا سفيان، عن علي بن الأقمر، عن أبي الأحوص ( قَدْ أَفْلَحَ مَنْ تَزَكَّى ) قال: من رَضَخَ (5) .حدثنا محمد بن عمارة، قال: ثنا عثمان بن سعيد بن مرَّة، قال: ثنا زهير، عن أبي إسحاق، عن أبي الأحوص، قال: إذا أتى أحدكم سائل وهو يريد الصلاة، فليقدّم بين يدي صلاته زكاته، فإن الله يقول: ( قَدْ أَفْلَحَ مَنْ تَزَكَّى * وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى) فمن استطاع أن يقدّم بين يدي صلاته زكاةً فليفعل .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( قَدْ أَفْلَحَ مَنْ تَزَكَّى ) تزكى رجل من ماله، وأرضى خالقه .وقال آخرون: بل عُنِي بذلك زكاة الفطر.* ذكر من قال ذلك:حدثني عمرو بن عبد الحميد الآملي، قال: ثنا مروان بن معاوية، عن أبي خلدة، قال: دخلت على أبي العالية، فقال لي: إذا غَدَوت غدًا إلى العيد فمرّ بي، قال: فمررت به، فقال: هل طَعِمت شيئا ؟ قلت: نعم، قال: أَفَضْت على نفسك من الماء؟ قلت: نعم، قال: فأخبرني ما فعلت بزكاتك؟ قلت: قد وجَّهتها، قال: إنما أردتك لهذا، ثم قرأ: (قَدْ أَفْلَحَ مَنْ تَزَكَّى * وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى) وقال: إن أهل المدينة لا يَرَونَ صدقة أفضل منها ومن سِقَاية الماء .----------------الهوامش :(5) يقال : رضخ له بشيء من ماله : إذا أعطاه شيئا يسيرا ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 14{ قَدْ اَفْلَحَ مَنْ تَزَکّٰی۔ } ”یقینا وہ کامیاب ہوگیا جس نے خود کو پاک کرلیا۔“ ان آیات میں بہت اہم اور بنیادی نوعیت کے مضامین بیان ہوئے ہیں۔ اگلی سورتوں میں مختلف مقامات پر ان مضامین کی مزید وضاحت آئے گی۔ تَزَکّٰیسے مراد یہاں روح کی پاکیزگی ہے۔ بنیادی طور پر انسان کی روح بہت بلند اور اعلیٰ چیز ہے۔ سورة التین کی اس آیت میں دراصل انسان کی روح کی تخلیق ہی کا ذکر ہے : { لَقَدْ خَلَقْنَا الْاِنْسَانَ فِیْٓ اَحْسَنِ تَقْوِیْمٍ۔ } کہ ہم نے انسان کو بہت عمدہ تخلیق پر بنایا ہے۔ لیکن جب اس روح کو جسد حیوانی میں قید کر کے دنیا میں بھیجا گیا تو وقتی طور پر روح اپنے اعلیٰ مقام سے گر کر پستی میں چلی گئی ‘ جس کا ذکر سورة التین کی اگلی آیت میں بایں الفاظ آیا ہے : { ثُمَّ رَدَدْنٰـہُ اَسْفَلَ سٰفِلِیْنَ۔ } کہ پھر ہم نے اس کو پست ترین حالت کی طرف لوٹا دیا۔ چناچہ انسان کی دنیوی زندگی کا اصل ہدف یہ ہونا چاہیے کہ وہ خود کو پستی سے نکال کر دوبارہ بلندی کی طرف لے جائے۔ اگر تو اس نے یہ ہدف حاصل کرلیا تو وہ کامیاب ہے ورنہ ناکام۔ اس کامیابی کے لیے اسے ایک طرف جسد حیوانی کے داعیات یعنی اپنی نفسانی خواہشات کو دبانا ہوگا اور دوسری طرف اپنی روح کو زیادہ سے زیادہ غذا فراہم کرنے کا سامان کرنا ہوگا۔ ظاہر ہے حیوانی داعیات کمزور ہوں گے تو تبھی روح کو تقویت ملے گی۔ ماہ ِ رمضان کے چوبیس گھنٹے کے معمولات کے ذریعے سے اہل ایمان کو دراصل اسی ”دو طرفہ“ پروگرام کی مشق کرائی جاتی ہے کہ دن کو روزہ رکھ کر حیوانی جسم اور اس کے داعیات کو کمزور کرو اور رات کو قیام اللیل کے دوران انوارِ قرآن کی بارش سے اپنی روح کو سیراب کرو تاکہ تمہاری روح کو ترفع اور اللہ کا قرب حاصل ہو سکے۔ یہ ہے تَزَکّٰی کا اصل مفہوم اور اس کا بنیادی فلسفہ۔</p>"
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 15,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 170,
        "text": "Такой человек очистил свою душу от многобожия, несправедливости и порочного нрава и украсил свое сердце частым поминанием Аллаха. Он совершал то, чем Он доволен, и, в первую очередь, совершал молитву, которая является мерилом веры. В этом состоит истинный смысл данного аята. Что же касается мнения тех, кто считает, что речь в нем идет об очистительной милостыни, которую мусульмане подают в праздник разговения, и праздничном намазе, до совершения которого мусульмане должны раздать эту милостыню, то подобное толкование, хотя и совпадает с текстом аята и является приемлемым, не отражает его смысла в полной мере."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 93,
        "text": "وقد اشتملت هاتان الآيتان على الطهارة من العقائد الباطلة ( تزكى ) وعلى استحضار معرفة الله - تعالى - ( وَذَكَرَ اسم رَبِّهِ ) وعلى أداء التكاليف الشرعية التى على رأسها الصلاة ( فصلى ) .وهذه المعانى هى التى وصلت صاحبها إلى الفلاح الذى ليس بعده فلاح ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 15{ وَذَکَرَ اسْمَ رَبِّہٖ فَصَلّٰی۔ } ”اور اس نے اپنے رب کا نام لیا اور نماز پڑھی۔“ اس آیت کے الفاظ کی عملی تصویر جمعہ کا اجتماع ہے۔ اجتماعِ جمعہ میں بھی پہلے خطبہ کی صورت میں اللہ کا ذکر کیا جاتا ہے پھر نماز پڑھی جاتی ہے۔ مسلم شریف کی ایک حدیث میں اجتماعِ جمعہ کے حوالے سے حضور ﷺ کا یہ معمول نقل ہوا ہے : کَانَ لِرَسُوْلِ اللّٰہِ ﷺ خُطْبَتَانِ کَانَ یَجْلِسُ بَیْنَھُمَا ‘ یَـقْرَأُ الْقُرْآنَ وَیُذَکِّرُ النَّاسَ 1”اللہ کے رسول ﷺ کے دو خطبے ہوتے تھے ‘ ان کے دوران آپ ﷺ بیٹھا کرتے تھے۔ آپ ﷺ قرآن حکیم پڑھ کر سناتے اور لوگوں کو نصیحت فرماتے۔“ حضور ﷺ کے دونوں خطبات بہت مختصر ہوتے تھے۔ اس لیے صاف ظاہر ہے کہ ان کے درمیان حضور ﷺ تھکان کی وجہ سے تو نہیں بیٹھتے تھے۔ میری رائے اس حوالے سے یہ ہے کہ یہ دو خطبات نماز ظہر کی دو رکعتوں کے قائم مقام ہیں۔ نماز ظہر میں فرضوں کی چار رکعتیں ہیں جبکہ نماز جمعہ میں دو رکعتیں پڑھی جاتی ہیں چناچہ اس دوران حضور ﷺ کا بیٹھنا دراصل اپنے خطاب کو باقاعدہ دو خطبوں کی شکل دینے کے لیے ہوتا تھا۔ ان خطبات میں جیسا کہ حدیث میں ذکر ہوا ہے ‘ حضور ﷺ آیاتِ قرآنی کے ذریعے تذکیر فرماتے تھے۔ آپ ﷺ کے تمام سامعین چونکہ قرآن کی زبان کو بخوبی سمجھتے تھے اس لیے ”از دل خیزد بر دل ریزد“ کے مصداق قرآن مجید کا مفہوم بغیر کسی وضاحت اور تشریح کے دلوں میں اترتا چلا جاتا تھا۔ ہمارے ہاں چونکہ عام سامعین عربی خطبہ کو نہیں سمجھ سکتے اس لیے ان کی تذکیر کے لیے خطبہ سے پہلے ”خطاب“ کا اہتمام کیا جاتا ہے۔ اجتماعِ جمعہ کے موقع پر ذکر و تذکیر کی اسلام میں کیا اہمیت ہے ‘ اس کا اندازہ درج ذیل حدیث سے ہوتا ہے۔ اجتماعِ جمعہ میں بروقت حاضری کو یقینی بنانے کی ترغیب دیتے ہوئے حضور ﷺ نے فرمایا : اِذَا کَانَ یَوْمُ الْجُمُعَۃِ کَانَ عَلٰی کُلِّ بَابٍ مِنْ اَبْوَابِ الْمَسْجِدِ الْمَلَائِکَۃُ ، یَکْتُبُوْنَ الْاَوَّلَ فَالْاَوَّلَ ، فَاِذَا جَلَسَ الْاِمَامُ طَوَوُا الصُّحُفَ ، وَجَاؤُوا یَسْتَمِعُوْنَ الذِّکْرَ 1”جب جمعہ کا دن ہوتا ہے تو مسجد کے دروازوں میں سے ہر دروازے پر فرشتے کھڑے ہوجاتے ہیں ‘ وہ پہلے آنے والوں کو پہلے لکھتے ہیں۔ پھر جب امام منبر پر بیٹھ جاتا ہے تو فرشتے اپنے رجسٹر سمیٹ لیتے ہیں اور ذکر سننے میں مشغول ہوجاتے ہیں۔“ حضور ﷺ کے دوسرے فرمان میں جمعہ کے لیے جلدی مسجد آنے والوں کے لیے درجہ بدرجہ فضیلت کی وضاحت بھی ملتی ہے : مَنِ اغْتَسَلَ یَوْمَ الْجُمُعَۃِ غُسْلَ الْجَنَابَۃِ ثُمَّ رَاحَ فَکَأَنَّمَا قَرَّبَ بَدَنَۃً ، وَمَنْ رَاحَ فِی السَّاعَۃِ الثَّانِیَۃِ فَکَاََنَّمَا قَرَّبَ بَقَرَۃً ، وَمَنْ رَاحَ فِی السَّاعَۃِ الثَّالِثَۃِ فَکَاَنَّمَا قَرَّبَ کَبْشًا أَقْرَنَ ، وَمَنْ رَاحَ فِی السَّاعَۃِ الرَّابِعَۃِ فَکَأَنَّمَا قَرَّبَ دُجَاجَۃً ، وَمَنْ رَاحَ فِی السَّاعَۃِ الْخَامِسَۃِ فَکَأَنَّمَا قَرَّبَ بَیْضَۃً فَإِذَا خَرَجَ الْاِمَامُ حَضَرَتِ الْمَلَائِکَۃُ یَسْتَمِعُوْنَ الذِّکْرَ 2”جو آدمی جمعہ کے دن غسل ِجنابت کی طرح اہتمام کے ساتھ غسل کرے پھر وہ صبح صبح مسجد میں جائے تو وہ اس طرح ہے گویا اس نے ایک اونٹ قربان کیا ‘ اور جو آدمی دوسری ساعت میں جائے تو گویا اس نے ایک گائے قربان کی ‘ اور جو آدمی تیسری ساعت میں گیا تو گویا اس نے ایک سینگوں والا مینڈھا قربان کیا ‘ اور جو چوتھی ساعت میں گیا تو گویا اس نے ایک مر غی قربان کی ‘ اور جو پانچویں ساعت میں گیا تو گویا اس نے ایک انڈا قربان کر کے اللہ کا قرب حاصل کیا۔ پھر جب امام خطبہ کے لیے نکلے تو فرشتے بھی اندراج کا سلسلہ ختم کر کے ذکر سننے کے لیے حاضر ہوجاتے ہیں۔“اس حدیث کی تشریح کرتے ہوئے علماء نے لفظ ”ساعت“ کی مختلف تاویلیں کی ہیں۔ حضرت شاہ ولی اللہ رح کی رائے اس ضمن میں یہ ہے ذاتی طور پر مجھے اس رائے سے اختلاف ہے کہ اس لفظ کا تعلق وقت کی ظاہری تقسیم سے نہیں بلکہ ان ”ساعتوں“ سے مخفی ساعتیں مراد ہیں۔ البتہ اس حدیث میں جس خطبہ کا ذکر ہوا ہے اس سے مراد مسنون خطبہ ہے۔ اس حکم کا اطلاق ہمارے ائمہ اور خطباء کی مقامی زبانوں میں کی جانے والی تقاریر پر نہیں ہوتا۔ خطبہ شروع ہونے کے بعد حاضری کا اندراج نہ ہونے کے حوالے سے شاہ ولی اللہ رح کی رائے یہ ہے کہ اس کے بعد آنے والے جمعہ کی فضیلت سے محروم رہیں گے ‘ البتہ ان کے فرض کی ادائیگی ہوجائے گی ‘ حتیٰ کہ اگر کوئی شخص خطبہ کے دوران بھی شامل ہوگا تو فرض کی ادائیگی کی حد تک اس کی حاضری بھی قبول سمجھی جائے گی۔</p>"
      },
      {
        "resource_id": 16,
        "text": "قد فاز مَن طهر نفسه من الأخلاق السيئة، وذكر الله، فوحَّده ودعاه وعمل بما يرضيه، وأقام الصلاة في أوقاتها؛ ابتغاء رضوان الله وامتثالا لشرعه."
      },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 90,
        "text": "قوله تعالى : وذكر اسم ربه فصلى أي ذكر ربه . وروى عطاء عن ابن عباس قال : يريد ذكر معاده وموقفه بين يدي الله جل ثناؤه ، فعبده وصلى له . وقيل : ذكر اسم ربه [ ص: 21 ] بالتكبير في أول الصلاة ; لأنها لا تنعقد إلا بذكره وهو قوله : الله أكبر : وبه يحتج على وجوب تكبيرة الافتتاح ، وعلى أنها ليست من الصلاة ; لأن الصلاة معطوفة عليها . وفيه حجة لمن قال : إن الافتتاح جائز بكل اسم من أسماء الله - عز وجل - . وهذه مسألة خلافية بين الفقهاء . وقد مضى القول في هذا في أول سورة ( البقرة ) . وقيل : هي تكبيرات العيد . قال الضحاك : وذكر اسم ربه في طريق المصلى فصلى أي صلاة العيد . وقيل : وذكر اسم ربه وهو أن يذكره بقلبه عند صلاته ، فيخاف عقابه ، ويرجو ثوابه ليكون استيفاؤه لها ، وخشوعه فيها ، بحسب خوفه ورجائه . وقيل : هو أن يفتتح أول كل سورة ببسم الله الرحمن الرحيم . فصلى أي فصلى وذكر . ولا فرق بين أن تقول : أكرمتني فزرتني ، وبين أن تقول : زرتني فأكرمتني . قال ابن عباس : هذا في الصلاة المفروضة ، وهي الصلوات الخمس . وقيل : الدعاء أي دعاء الله بحوائج الدنيا والآخرة . وقيل : صلاة العيد قاله أبو سعيد الخدري وابن عمر وغيرهما . وقد تقدم . وقيل : هو أن يتطوع بصلاة بعد زكاته قاله أبو الأحوص ، وهو مقتضى قول عطاء . وروي عن عبد الله قال : من أقام الصلاة ولم يؤت الزكاة فلا صلاة له ."
      },
      {
        "resource_id": 91,
        "text": "{ وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى } أي: اتصف بذكر الله، وانصبغ به قلبه، فأوجب له ذلك العمل بما يرضي الله، خصوصًا الصلاة، التي هي ميزان الإيمان، فهذا معنى الآية الكريمة، وأما من فسر قوله { تزكى } بمعني أخرج زكاة الفطر، وذكر اسم ربه فصلى، أنه صلاة العيد، فإنه وإن كان داخلًا في اللفظ وبعض جزئياته، فليس هو المعنى وحده."
      },
      {
        "resource_id": 94,
        "text": "( وذكر اسم ربه فصلى ) قال خرج إلى العيد فصلى ، فكان ابن مسعود يقول : رحم الله امرءا تصدق ثم صلى ، ثم يقرأ هذه الآية . وروى نافع : كان ابن عمر إذا صلى الغداة - يعني من يوم العيد - قال : يا نافع أخرجت الصدقة ؟ فإن قلت : نعم ، مضى إلى المصلى ، وإن قلت : لا قال : فالآن فأخرج ، فإنما نزلت هذه الآية في هذا قد أفلح من تزكى وذكر اسم ربه فصلى وهو قول أبي العالية وابن سيرين .وقال بعضهم : لا أدري ما وجه هذا التأويل ؟ لأن هذه السورة مكية ، ولم يكن بمكة عيد ولا زكاة فطر .[ قال الشيخ الإمام محيي السنة رحمه الله ] يجوز أن يكون النزول سابقا على الحكم كما قال : \" وأنت حل بهذا البلد \" فالسورة مكية ، وظهر أثر الحل يوم الفتح حتى قال عليه الصلاة والسلام : \" أحلت لي ساعة من نهار \" وكذلك نزل بمكة : \" سيهزم الجمع ويولون الدبر \" ( القمر - 45 ) قال عمر بن الخطاب : كنت لا أدري أي جمع يهزم ، فلما كان يوم بدر رأيت النبي - صلى الله عليه وسلم - يثب ، في الدرع ويقول : سيهزم الجمع ويولون الدبر \"وذكر اسم ربه فصلى \" أي : وذكر ربه فصلى ، قيل : الذكر : تكبيرات العيد ، والصلاة : صلاة العيد ، وقيل : الصلاة هاهنا الدعاء ."
      },
      {
        "resource_id": 166,
        "text": "<p>এবং তার রবের নাম স্মরণ করে ও সালাত কায়েম করে [১]।</p><p>[১] কেউ কেউ অর্থ করেছেন, তারা তাদের রবের নাম স্মরণ করে এবং সালাত আদায় করে। বাহ্যতঃ এতে ফরয ও নফল সবরকম সালাত অন্তর্ভুক্ত। কেউ কেউ ঈদের সালাত দ্বারা এর তাফসীর করে বলেছেন যে, যে যাকাতুল ফিতর এবং ঈদের সালাত আদায় করে। কোন কোন মুফাসসির বলেন, ‘নাম স্মরণ করা’ বলতে আল্লাহ্কে মনে মনে স্মরণ করা এবং মুখে তা উচ্চারণ করাও উদ্দেশ্য হতে পারে। অর্থাৎ আল্লাহ্কে মনে মনে বা মুখে উচ্চারণ করে স্মরণ করেছে, তারপর সালাত আদায় করেছে। সে শুধু আল্লাহ্র স্মরণ করেই ক্ষান্ত থাকেনি। বরং নিয়মিত সালাত আদায়ে ব্যাপৃত ছিল। মূলত: এ সবই আয়াতের অর্থ হতে কোন বাধা নেই। [ফাতহুল কাদীর]</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:19 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>এবং নিজ প্রতিপালকের নাম স্মরণ করে ও নামায আদায় করে।</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى ) اختلف أهل التأويل في تأويل قوله: ( وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى ) فقال بعضهم: معنى ذلك: وحَّد الله.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح، قال ثني معاوية، عن عليّ، عن ابن عباس ( وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى ) يقول: وحَّد الله سبحانه وتعالى.وقال آخرون: بل معنى ذلك: وذكر الله ودعاه ورغب إليه.والصواب من القول في ذلك أن يقال: وذكر الله فوحَّده، ودعاه ورغب إليه؛ لأن كلّ ذلك من ذكر الله، ولم يُخصص الله تعالى من ذكره نوعًا دون نوع.وقوله: ( فَصَلَّى ) اختلف أهل التأويل في تأويل ذلك. فقال بعضهم: عُنِي به: فصلى الصلوات الخمس.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح، قال: ثني معاوية، عن عليّ، عن ابن عباس، قوله: ( فَصَلَّى ) يقول: صلَّى الصلوات الخمس .وقال آخرون: عُنِيَ به: صلاة العيد يوم الفطر.وقال آخرون: بل عُنِيَ به: وذكر اسم ربه فدعا، وقالوا: الصلاة هاهنا: الدعاء.والصواب من القول أن يقال: عُنِيَ بقوله: ( فَصَلَّى ) : الصلوات، وذكر الله فيها بالتحميد والتمجيد والدعاء."
      },
      {
        "resource_id": 92,
        "text": "وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى (15)، { وذكر اسم ربه فصلى } قال : هي الصلوات الخمس والمحافظة عليها والاهتمام بها ، وهو قول ابن عباس وعطاء وعكرمة وقتادة .وقدم التزكّي على ذكر الله والصلاةِ لأنه أصل العمل بذلك كله فإنه إذا تطهرت النفس أشرقت فيها أنوار الهداية فعُلمت منافعها وأكثرت من الإِقبال عليها فالتزكية : الارتياض على قبول الخير والمراد تزكّى بالإِيمان .وفعل { ذكر اسم ربه } يجوز أن يكون من الذّكر اللساني الذي هو بكسر الذال فيكون كلمة { اسم ربه } مراداً بها ذكر أسماء الله بالتعظم مثل قول لا إله إلا الله ، وقول الله أكبر ، وسبحان الله ، ونحو ذلك على ما تقدم في قوله : { سبح اسم ربك الأعلى } [ الأعلى : 1 ] .ويجوز أن يكون من الذُّكر بضم الذال وهو حضور الشيء في النفس الذاكرة والمفكرة فتكون كلمة { اسم } مقحمة لتدل على شأن الله وصفات عظمته فإن أسماء الله أوصاف كمال .وتفريع { فصلى } على { ذكر اسم ربه } على كلا الوجهين لأن الذكر بمعنييه يبعث الذاكر على تعظيم الله تعالى والتقرب إليه بالصلاة التي هي خضوع وثناء .وقد رتبت هذه الخصال الثلاث على الآية على ترتيب تولدها . فأصلها : إزالة الخباثة النفسية من عقائد باطلة وحديث النفس بالمضمرات الفاسدة وهو المشار إليه بقوله : { تزكى } ، ثم استحضارُ معرفة الله بصفات كماله وحكمته ليخافه ويرجوه وهو المشار بقوله : { وذكر اسم ربه } ثم الإِقبالُ على طاعته وعبادته وهو المشار إليه بقوله : { فصلى } والصلاةُ تشير إلى العبادة وهي في ذاتها طاعة وامتثال يأتي بعده ما يشرع من الأعمال قال تعالى : { إن الصلاة تنهى عن الفحشاء والمنكر ولذكر اللَّه أكبر } [ العنكبوت : 45 ] ."
      },
      {
        "resource_id": 14,
        "text": "أى أقام الصلاة فى أوقاتها ابتغاء رضوان الله وطاعة لأمر الله وامتثالا لشرع الله. وقد قال الحافظ أبو بكر البزار حدثنا عباد بن أحمد العزرمي حدثنا عمي محمد بن عبدالرحمن عن أبيه عن عطاء بن السائب عن عبدالرحمن بن سابط عن جابر بن عبدالله عن النبي صلى الله عليه وسلم قال قد أفلح من تزكى قال \"من شهد أن لا إله إلا الله وخلع الأنداد وشهد أني رسول الله\" \"وذكر اسم ربه فصلى\" قال \"هي الصلوات الخمس والمحافظة عليها والاهتمام بها\" ثم قال لا يروي عن جابر إلا من هذا الوجه وكذا قال ابن عباس إن المراد بذلك الصلوات الخمس واختاره ابن جرير. وقال ابن جرير حدثني عمرو بن عبدالحميد الأيلي حدثنا مروان بن معاوية عن أبي خلدة قال دخلت على أبي العالية فقال لي إذا غدوت غدا إلى العيد فمر بي قال فمررت به فقال هل طعمت شيئا؟ قلت نعم قال أفضت على نفسك من الماء؟ قلت نعم قال فأخبرني ما فعلت زكاتك؟ قلت قد وجهتها قال إنما أردتك لهذه ثم قرأ \"قد أفلح من تزكى وذكر اسم ربه فصلى\" وقال إن أهل المدينة لا يرون صدقة أفضل منها ومن سقاية الماء \"قلت\" وقد روينا عن أمير المؤمنين عمر بن عبدالعزيز أنه كان يأمر الناس بإخراج صدقة الفطر ويتلو هذه الآية \"قد أفلح من تزكي وذكر اسم ربه فصلى\" وقال أبو الأحوص إذا أتي أحدكم سائل وهو يريد الصلاة فليقدم بين يدي صلاته زكاته فإن الله تعالى يقول \"قد أفلح من تزكى وذكر اسم ربه فصلى\" وقال قتادة في هذه الآية \"قد أفلح من تزكى وذكر اسم ربه فصلى\" زكي ماله وأرضى خالقه."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 16,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 16,
        "text": "إنكم -أيها الناس- تفضِّلون زينة الحياة الدنيا على نعيم الآخرة."
      },
      {
        "resource_id": 92,
        "text": "بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا (16) قرأ الجمهور { تؤثرون } بمثناة فوقية بصيغة الخطاب ، والخطاب موجه للمشركين بقرينة السياق وهو التفات ، وقرأه أبو عمرو وحدَه بالمثناة التحتية على طريقة الغيبة عائداً إلى { الأشقى الذي يصلى النار الكبرى } [ الأعلى : 11 ، 12 ] .وحرف { بَل } معناه الجامع هو الإضراب ، أي انصراف القول أو الحكم إلى ما يأتي بعد { بل } ؛ فهو إذا عَطَف المفردات كان الإضراب إبطالاً للمعطوف عليه : لغلط في ذكر المعطوف أو للاحتراز عنه فذلك انصراف عن الحكم . وإذا عطفَ الجمل فعطفه عطف كلام على كلام وهو عطف لفظي مجرد عن التشريك في الحكم ويقع على وجهين ، فتارة يقصد إبطال معنى الكلام نحو قوله تعالى : { أم يقولون به جنة بل جاءهم بالحق } [ المؤمنون : 70 ] فهو انصراف في الحُكم ، وتارة يقصد مجرد التنقل من خبر إلى آخر مع عدم إبطال الأول نحو قوله تعالى : { ولدينا كتاب ينطق بالحق وهم لا يظلمون بل قلوبهم في غمرة من هذا } [ المؤمنون : 62 ، 63 ] . فتكون { بل } بمنزلة قولهم «دع هذا» فهذا انصراف قولي . ويعرف أحد الإضرابين بالقرائن والسياق .و { بل } هنا عاطفة جملة عطفاً صُورياً فيجوز أن تكون لمجرد الانتقال من ذكر المنتفعين بالذكرى والمتجنبين لها ، إلى ذكر سبب إعراض المتجنبين وهم الأشْقَون بأنَّ السبب إيثارهم الحياة الدنيا ، وذلك على قراءة أبي عمرو ظاهر ، وأما على قراءة الجمهور فهو إضراب عن حكاية أحوال الفريقين بالانتقال إلى توبيخ أحد الفريقين وهو الفريق الأشقى فالخطاب موجه إليهم على طريقة الالتفات لتجديد نشاط السامع لكي لا تنقضي السورة كلها في الإخبار عنهم بطريق الغيبة .ويجوز أن يكون الإضراب إبطالاً لما تضمنه قوله : { قد أفلح من تزكى } [ الأعلى : 14 ] من التعريض للذين شَقُوا بتحريضهم على طلب الفلاح لأنفسهم ليلتحقوا بالذين يخشون ويتزكّون ليبطل أن يكونوا مظنة تحصيل الفلاح .والمعنى : أنهم بُعداء عن أن يظنّ بهم التنافس في طلب الفلاح لأنهم يؤثرون الحياة الدنيا ، فالمعنى : بل أنتم تؤثرون منافع الدنيا على حظوظ الآخرة ، وهذا كما يقول الناصح شخصاً يظن أنه لا ينتصح «لقد نصحتك وما أظنك تفعل» .ويجيء فيه الوجهان المتقدمان من الخطاب والغيبة على القراءتين .والإِيثار : اختيار شيء من بين متعدد .والمعنى : تؤثرون الحياة الدنيا بعنايتكم واهتمامكم .ولم يُذكر المؤثَر عليه لأن الحياة الدنيا تدل عليه ، أي لا تتأملون فيما عدَا حياتكم هذه ولا تتأمّلون في حياة ثانية ، فالمشركون لا يؤمنون بالآخرة وإذا ذُكِّروا بالحياة الآخرة وأخبروا بها لم يُعيروا سمعهم ذلك وجعلوا ذلك من الكلام الباطل وهذا مورد التوبيخ .واعلم أنّ للمؤمنين حظاً من هذه الموعظة على طول الدهر ، وذلك حظ مناسب لمقدار ما يفرِّط فيه أحدهم مما ينجيه في الآخرة إيثاراً لما يجتنيه من منافع الدنيا التي تجر إليه تَبِعةً في الآخرة على حسب ما جاءت به الشريعة ، فأما الاستكثار من منافع الدنيا مع عدم إهمال أسباب النجاة في الآخرة فذلك مَيدانٌ للهمم وليس ذلك بمحل ذم قال تعالى :{ وابتغ فيما آتاك اللَّه الدار الآخرة ولا تنس نصيبك من الدنيا } [ القصص : 77 ] ."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 157,
        "text": "<p>بل توثرون ............................ وابقی</p><p>حقیقت یہ ہے کہ دنیا پرستی ہی ہر مصیبت کی جڑ ہے۔ اسی وجہ سے انسان نصیحت سے منہ موڑتا ہے کیونکہ آخرت کا مطالبہ یہ ہوتا ہے اس کی فکر کرو اور آخرت کو ترجیح دو ۔ اور لوگ ہیں کہ دنیا کے طالب ہیں اور اس کو اولیت دیتے ہیں۔</p><p>اور اس دنیا کو دنیا ویسے نہیں کہا گیا ، بلکہ یہ دنیائے دنی ہے ، قریبی ہے اور جلد مٹنے والی ہے اور اس کے مقابلے میں آخرت اچھی اور بہتر اور باقی رہنے والی ہے۔</p><p>والاخرة ........................ وابقی (17:87) ” یہ اپنی نوعیت کے اعتبار سے باقی رہنے والی اور اچھی اور ابدالا باد تک مسلسل ہونے والی ہے۔ لہٰذا جو لوگ آخرت پر دنیا کو ترجیح دیتے ہیں وہ بڑی حماقت کا ارتکاب کررہے ہیں اور ان کا انداز غلط ہے۔ کسی عاقل اور بصیر کا یہ کام نہیں ہے۔</p><p>آخر میں یہ بتایا جاتا ہے کہ دعوت اسلامی کوئی نئی دعوت نہیں ہے ، اس کی طویل تاریخ ہے۔ آغاز کائنات سے اور وجود انسانیت سے یہ دعوت چل رہی ہے اور اس کے اصول زمان ومکان کے قیود سے ماوراء ہیں۔</p>"
      },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 90,
        "text": "قوله تعالى : بل تؤثرون الحياة الدنيا قراءة العامة بل تؤثرون بالتاء تصديقه قراءة أبي ( بل أنتم تؤثرون ) . وقرأ أبو عمرو ونصر بن عاصم ( بل يؤثرون ) بالياء على الغيبة تقديره : بل يؤثرون الأشقون الحياة الدنيا . وعلى الأول فيكون تأويلها بل تؤثرون أيها المسلمون الاستكثار من الدنيا ، للاستكثار من الثواب . وعن ابن مسعود أنه قرأ هذه الآية ، فقال : أتدرون لم آثرنا الحياة الدنيا على الآخرة ؟ لأن الدنيا حضرت وعجلت لنا طيباتها وطعامها وشرابها ، ولذاتها وبهجتها ، والآخرة غيبت عنا ، فأخذنا العاجل ، وتركنا الآجل . وروى ثابت عن أنس قال : كنا مع أبي موسى في مسير ، والناس يتكلمون ويذكرون الدنيا . قال أبو موسى : يا أنس ، إن هؤلاء يكاد أحدهم يفري الأديم بلسانه فريا ، فتعال فلنذكر ربنا ساعة . ثم قال : يا أنس ، ما ثبر الناس ما بطأ بهم ؟ قلت : الدنيا والشيطان والشهوات . قال : لا ، ولكن عجلت الدنيا ، وغيبت الآخرة ، أما والله لو عاينوها ما عدلوا ولا ميلوا ."
      },
      {
        "resource_id": 91,
        "text": "{ بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا } أي: تقدمونها على الآخرة، وتختارون نعيمها المنغص المكدر الزائل على الآخرة."
      },
      {
        "resource_id": 14,
        "text": "أي تقدمونها علي أمر الآخرة وتبدونها على ما فيه نفعكم وصلاحكم في معاشكم ومعادكم."
      },
      {
        "resource_id": 166,
        "text": "<p>কিন্তু তোমরা দুনিয়ার জীবনকে প্রাধান্য দাও,</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:19 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>বরং তোমরা পার্থিব জীবনকে প্রাধান্য দিয়ে থাক।</p>"
      },
      {
        "resource_id": 93,
        "text": "وقوله - تعالى - : ( بَلْ تُؤْثِرُونَ الحياة الدنيا . والآخرة خَيْرٌ وأبقى ) الإضراب فيه عن كلام مقدر يفهم من السياق .والمعنى : لقد بينت لكم ما يؤدى إلى فلاحكم وفوزكم . . يا بنى آدم - كثير منكم لم يستجيب لما بينته له ، لأن الدنيا ومتعها زائلة ، أما الآخرة فخيرها باق لا يزول .والخطاب لجميع الناس ، ويدخل فيه الكافرون دخولا أوليا ، وعليه يكون المراد بإيثار الحياة الدنيا بالنسبة للمؤمنين ، ما لا يخلو منه غالب الناس ، من اشتغالهم فى كثير من الأحيان بمنافع الدنيا ، وتقصيرهم فيما يتعلق بآخرتهم .ويرى كثير من العلماء : أن الخطاب للكافرين على سبيل الالتفات ، ويؤيد أن الخطاب للكافرين قراءة أبى عمرو بالياء على طريقة الغيبة .أى : بل إن الكافرين يؤثرون الحياة الدنيا على الآخرة ، مع أن الآخرة خير وأبقى ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 16{ بَلْ تُؤْثِرُوْنَ الْحَیٰوۃَ الدُّنْیَا۔ } ”بلکہ تم دنیا کی زندگی کو ترجیح دیتے ہو۔“ دراصل انسان کی اخروی کامیابی یا ناکامی کا تمام تر انحصار اس کی ترجیحات پر ہے۔ اگر تو وہ اپنے معاملات کی منصوبہ بندی کرتے ہوئے آخرت کی کامیابی کو مقدم رکھتا ہے اور دنیوی مفادات کے حوالے سے قناعت پسندی کی حکمت عملی پر کاربند رہتا ہے تو وہ کامیاب ہے اور اگر اس کا معاملہ اس کے برعکس ہے تو اس کا راستہ تباہی اور بربادی کا راستہ ہے۔ اس آیت میں اس حوالے سے ہم جیسے دنیادار مسلمانوں کے اصل مرض کی نشاندہی کردی گئی ہے کہ ہم دنیوی زندگی کے مفادات کو آخرت کے معاملات پر ترجیح دیتے ہیں۔ اس کی بنیادی وجہ یہ ہے کہ دنیا کا نفع اور نقصان ہمیں نقد نظر آتا ہے جبکہ آخرت کی راحت اور تکلیف ہمیں سامنے نظر نہیں آتی۔ اس لیے دنیا کا معمولی سا مفاد ہم آخرت کے بہت بڑے عذاب کے بدلے میں بھی حاصل کرنے کے لیے تیار ہوجاتے ہیں۔ جیسے سورة النساء کی آیت 10 میں اللہ تعالیٰ نے واضح فرما دیا ہے کہ جو لوگ ظلم و زیادتی سے یتیموں کا مال ہڑپ کر جاتے ہیں وہ اپنے پیٹوں میں آگ بھر رہے ہیں۔ لیکن آج دنیا میں جو کوئی ایسا مال کھاتا ہے اسے ایسا کرتے ہوئے تو محسوس نہیں ہو تاکہ وہ آگ کے انگارے پیٹ میں بھر رہا ہے ‘ اس لیے جب وہ ایسے مال کو اپنی پہنچ میں دیکھتا ہے تو اسے غصب کرنے سے باز نہیں رہتا۔ انسان کی اس طبعی اور جبلی کمزوری یا خامی کا ذکر سورة القیامہ میں بایں الفاظ آیا ہے : { کَلَّا بَلْ تُحِبُّوْنَ الْعَاجِلَۃَ - وَتَذَرُوْنَ الْاٰخِرَۃَ۔ } ”ہرگز نہیں ! اصل میں تم لوگ عاجلہ جلد ملنے والی چیز سے محبت کرتے ہو۔ اور تم آخرت کو چھوڑ دیتے ہو۔“</p>"
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا (16)وقوله: ( بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا )يقول للناس: بل تؤثرون أيها الناس زينة الحياة الدنيا على الآخرة ( وَالآخِرَةُ خَيْرٌ ) لكم ( وَأَبْقَى ) يقول: وزينة الآخرة خير لكم أيها الناس وأبقى، لأن الحياة الدنيا فانية، والآخرة باقية، لا تنفَدُ ولا تفنى.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة ( بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا ) فاختار الناس العاجلة إلا من عصم الله."
      },
      {
        "resource_id": 94,
        "text": "( بل تؤثرون ) قرأ أبوعمرو ، ويعقوب : [ يؤثرون ] بالياء ، يعني : الأشقين الذين ذكروا ، وقرأ الآخرون بالتاء ، دليله : قراءة أبي بن كعب \" بل أنتم تؤثرون الحياة الدنيا \" [ والمراد ب \" الأشقى \" الجمع ، وإن كان على لفظ الواحد ، لأن الشيء إذا دخله الألف واللام للجنس صار مستغرقا ، فكأنه قال : ويتجنبه الأشقون ، ثم قال : \" بل تؤثرون الحياة الدنيا \""
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 17,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 92,
        "text": "وَالْآَخِرَةُ خَيْرٌ وَأَبْقَى (17)وجملة : { والآخرة خير وأبقى } عطف على جملة التوبيخ عطفَ الخبر على الإنشاء لأن هذا الخبر يزيد إنشاءَ التوبيخ توجيهاً وتأييداً بأنهم في إعراضهم عن النظر في دلائل حياة آخرة قد أعرضوا عما هو خير وأبقَى .و { أبقى } : اسم تفضيل ، أي أطول بقاءً ، وفي حديث النهي عن جَرِّ الإزار « وليكن إلى الكعبين فإنه أتقَى وأبْقَى » ."
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : والآخرة خير وأبقى أي والدار الآخرة أي الجنة . خير أي أفضل . وأبقى أي أدوم من الدنيا . وقال النبي - صلى الله عليه وسلم - : \" ما الدنيا في الآخرة إلا كما يضع أحدكم أصبعه في اليم ، فلينظر بم يرجع \" صحيح . وقد تقدم . وقال مالك بن دينار : لو كانت الدنيا من ذهب يفنى ، والآخرة من خزف يبقى ، لكان الواجب أن يؤثر خزف يبقى ، على ذهب يفنى . قال : فكيف والآخرة من ذهب يبقى ، والدنيا من خزف يفنى ."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 94,
        "text": "( والآخرة خير وأبقى ) قال عرفجة الأشجعي : كنا عند ابن مسعود فقرأ هذه الآية ، فقال لنا : أتدرون لم آثرنا الحياة الدنيا على الآخرة ؟ قلنا : لا قال : لأن الدنيا أحضرت ، وعجل لنا طعامها وشرابها ونساؤها ولذاتها وبهجتها ، وأن الآخرة نعتت لنا ، وزويت عنا فأحببنا العاجل وتركنا الآجل ."
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 16,
        "text": "والدار الآخرة بما فيها من النعيم المقيم، خير من الدنيا وأبقى."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَالآخِرَةُ خَيْرٌ ) في الخير ( وَأَبْقَى ) في البقاء .حدثنا ابن حميد، قال: ثنا يحيى بن واضح، قال: ثنا أبو حمزة، عن عطاء، عن عَرْفَجَة الثقفي، قال: استقرأت ابن مسعود  سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى  ، فلما بلغ: ( بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا ) ترك القراءة وأقبل على أصحابه، وقال: آثرنا الدنيا على الآخرة، فسكت القوم، فقال: آثرنا الدنيا؛ لأنا رأينا زينتها ونساءها وطعامها وشرابها، وزُوِيت عنا الآخرة، فاخترنا هذا العاجل، وتركنا الآجل .واختلفت القرّاء في قراءة قوله: ( بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا ) فقرأ ذلك عامَّة قرّاء الأمصار: ( بَلْ تُؤْثِرُونَ ) بالتاء، إلا أبا عمرو فإنه قرأه بالياء، وقال: يعني الأشقياء.والذي لا أوثر عليه في قراءة ذلك التاء، لإجماع الحجة من القرّاء عليه. وذُكر أن ذلك في قراءة أُبي: ( بَلْ أَنْتُمْ تُؤْثِرُونَ ) فذلك أيضًا شاهد لصحة القراءة بالتاء."
      },
      {
        "resource_id": 93,
        "text": "وقوله - تعالى - : ( بَلْ تُؤْثِرُونَ الحياة الدنيا . والآخرة خَيْرٌ وأبقى ) الإضراب فيه عن كلام مقدر يفهم من السياق .والمعنى : لقد بينت لكم ما يؤدى إلى فلاحكم وفوزكم . . يا بنى آدم - كثير منكم لم يستجيب لما بينته له ، لأن الدنيا ومتعها زائلة ، أما الآخرة فخيرها باق لا يزول .والخطاب لجميع الناس ، ويدخل فيه الكافرون دخولا أوليا ، وعليه يكون المراد بإيثار الحياة الدنيا بالنسبة للمؤمنين ، ما لا يخلو منه غالب الناس ، من اشتغالهم فى كثير من الأحيان بمنافع الدنيا ، وتقصيرهم فيما يتعلق بآخرتهم .ويرى كثير من العلماء : أن الخطاب للكافرين على سبيل الالتفات ، ويؤيد أن الخطاب للكافرين قراءة أبى عمرو بالياء على طريقة الغيبة .أى : بل إن الكافرين يؤثرون الحياة الدنيا على الآخرة ، مع أن الآخرة خير وأبقى ."
      },
      {
        "resource_id": 14,
        "text": "أي ثواب الله في الدار الآخرة خير من الدنيا وأبقى فإن الدنيا دانية فانية والآخرة شريفة باقية فكيف يؤثر عاقل ما يفني على ما يبقى ويهتم بما يزول عنه قريبا ويترك الاهتمام بدار البقاء والخلد. قال الإمام أحمد حدثنا حسين بن محمد حدثنا دويد عن أبي إسحاق عن عروة عن عائشة قالت: قال رسول الله صلى الله عليه وسلم \"الدنيا دار من لا دار له ومال من لا مال له ولها يجمع من لا عقل له\" وقال ابن جرير حدثنا ابن حميد حدثنا يحيي بن واضح حدثنا أبو حمزة عن عطاء عن عرفجة الثقفي قال: استقرأت ابن مسعود \"سبح اسم ربك الأعلى\" - فلما بلغ - \"بل تؤثرون الحياة الدنيا\" ترك القراءة وأقبل على أصحابه وقال آثرنا الدنيا على الآخرة فسكت القوم فقال آثرنا الدنيا لأنا رأينا زينتها ونساءها وطعامها وشرابها وزويت عنا الآخرة فاخترنا هذا العاجل وتركنا الآجل. وهذا منه على وجه التواضع والهضم أو هو إخبار عن الجنس من حيث هو والله أعلم. وقد قال الإمام أحمد حدثنا سليمان بن داود الهاشمي حدثنا إسماعيل بن جعفر أخبرني عمرو بن أبي عمر وعن المطلب بن عبدالله عن أبي موسى الأشعري أن رسول الله صلى الله عليه وسلم قال \"من أحب دنياه أضر بآخرته ومن أحب آخرته أضر بدنياه فآثروا ما يبقى على ما يفنى\" تفرد به أحمد. وقد رواه أيضا عن أبي سلمة الخزاعي عن الدراوردي عن عمرو بن أبي عمرو به مثله سواء."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:19 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>অথচ পরকালের জীবনই উত্তম ও চিরস্থায়ী। [১]</p><p>[১] কেননা, পৃথিবী এবং তার সমস্ত বস্তু ধ্বংসশীল। পক্ষান্তরে পরকালের জীবনই হল চিরস্থায়ী জীবন। বলা বাহুল্য, জ্ঞানী ব্যক্তি কোন দিন চিরস্থায়ী বস্তুর উপর ধ্বংসশীল ক্ষণস্থায়ী বস্তুকে অগ্রাধিকার দেয় না।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>অথচ আখিরাতই উৎকৃষ্ট [১] ও স্থায়ী [২]।</p><p>[১] হাদীসে এসেছে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, “আখেরাতের তুলনায় দুনিয়া তো শুধু এমন যেন তোমাদের কেউ সমূদ্রে তার আঙ্গুল ডুবিয়েছে। তারপর সে যেন দেখে নেয় সে আঙ্গুল কি নিয়ে আসতে সক্ষম হয়েছে?” [মুসলিম:২৮৫৮]</p><p>[২] অর্থাৎ আখেরাত দু’দিক দিয়ে দুনিয়ার মোকাবিলায় অগ্ৰাধিকার পাওয়ার যোগ্য। প্রথমত তার সুখ, স্বাচ্ছন্দ, আরাম-আয়েশ দুনিয়ার সমস্ত নিয়ামতের চাইতে অনেক বেশী ও অনেক উচ্চ পর্যায়ের। দ্বিতীয়ত দুনিয়া ধ্বংসশীল এবং আখেরাত চিরস্থায়ী। [ইবন কাসীর]</p>"
      },
      {
        "resource_id": 170,
        "text": "Вы ставите жизнь здешнюю выше Последней жизни и тем самым меняете жизнь отравленную, беспокойную и преходящую на жизнь вечную. Она превосходит мирскую жизнь по всем качествам и длится целую вечность, тогда как здешний мир непременно разрушится и исчезнет. Сознательный и верующий человек никогда не предпочтет скверное прекрасному и не согласиться вечно страдать за удовольствие, которое можно испытать в течение короткого часа. Поэтому причиной всех несчастий является именно любовь к этому миру и предпочтение его миру вечному."
      },
      {
        "resource_id": 91,
        "text": "{ وَالْآخِرَةُ خَيْرٌ وَأَبْقَى } وللآخرة خير من الدنيا في كل وصف مطلوب، وأبقى لكونها دار خلد وبقاء وصفاء، والدنيا دار فناء، فالمؤمن العاقل لا يختار الأردأ على الأجود، ولا يبيع لذة ساعة، بترحة الأبد، فحب الدنيا وإيثارها على الآخرة رأس كل خطيئة."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 18,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 90,
        "text": "قوله تعالى : إن هذا لفي الصحف الأولى قال قتادة وابن زيد : يريد قوله والآخرة خير وأبقى . وقالا : تتابعت كتب الله - جل ثناؤه - كما تسمعون أن الآخرة خير وأبقى من الدنيا . وقال الحسن : إن هذا لفي الصحف الأولى قال : كتب الله - جل ثناؤه - كلها . الكلبي : إن هذا لفي الصحف الأولى من قوله : قد أفلح إلى آخر السورة لحديث أبي ذر على ما يأتي . وروى عكرمة عن ابن عباس : إن هذا لفي الصحف الأولى قال : هذه السورة . وقال الضحاك : إن هذا القرآن لفي الصحف الأولى أي الكتب الأولى ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 168,
        "text": "<p>إِنَّ هَـٰذَا لَفِي الصُّحُفِ الْأُولَىٰ صُحُفِ إِبْرَاهِيمَ وَمُوسَىٰ (Indeed this is [ written ] in the earlier divine scripts, the scripts of Ibrahim and Musa....87:18, 19] In other words, either all the themes of this Surah or its last theme, that the Hereafter is much better and much more durable than this life, was written in the earlier Divine scriptures. It is further explicated that this theme was written in the scriptures of Prophets Ibrahim and Musa (علیہما السلام) . Probably, it refers to other scriptures that were given to Prophet Musa (علیہ السلام) before Torah. It is also possible that it refers to Torah itself.</p><p>Themes of the Scripts of Prophet Ibrahim (علیہ السلام)</p><p>Ajurri transmits a narration from Sayyidna Abu Dharr Al-Ghifari ؓ that he inquired from the Prophet ﷺ as to the contents of the scripts of Prophet Ibrahim (علیہ السلام) and the Holy Prophet ﷺ replied that they contained educating parables . A story is told in it about a tyrant king where he is addressed and told: You haughty, arrogant and oppressive ruler! I did not give you kingdom so that you may amass wealth, but I had given you power so that you may let the supplication of the oppressed against the oppressor reach me, because my law does not reject the supplication of an oppressed, even though it may be uttered by an unbeliever.</p><p>Another parable addresses the general public thus: A wise person should divide his time into three parts. One part should be reserved for the worship of his Lord and supplication to Him. The second part should be reserved for self-assessment of his deeds, and reflection on the Omnipotence and creation of Allah. The third part should be allocated for acquisition of livelihood and fulfilling the natural needs. It further imparts that a wise person should keep himself abreast of the circumstances of his time, and keep himself busy in performing his intended work. He should take care of his tongue. He who takes speech as one of his works, his speech will be confined only to the things of real need.</p><p>Themes of the Scripts of Prophet Musa (علیہ السلام)</p><p>Sayyidna Abu Dharr Al-Ghifari ؓ says that he then inquired from the Holy Prophet ﷺ as to the contents of the scripts of Prophet Musa (علیہ السلام) and the Holy Prophet\tﷺ replied</p><p>that they contained lessons of wisdom. Some of them are as follows:</p><p>§\tI am surprised at the person who believes that he will certainly die, and yet he lives happily.</p><p>•\tI am surprised at the person who believes in Divine destiny, and yet he is despondent and aggrieved.</p><p>•\tI am surprised at the person who experiences the vicissitudes of life and rise and fall of nations, and yet he is content with the world.</p><p>•\tI am surprised at the person who believes in the Reckoning of the Hereafter, and yet he abandons [ good ] deeds.</p><p>Sayyidna Abu Dharr Al-Ghifari ؓ says that he asked the Holy Prophet ﷺ whether anything from these scriptures was revealed to him, he replied in the affirmative and asked Sayyidna Abu Dharr Ghifari ؓ to recite verses 14-19 of this Surah. [ Qurtubi ]</p><p>Alhamdulillah</p><p>The Commentary on</p><p>Surah Al-A` la</p><p>Ends here</p>"
      },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 157,
        "text": "<p>ان ھذا ............................ موسیٰ</p><p>اس سورت میں جو مضامین آئے ہیں وہ اس عظیم عقیدہ کے بنیادی اصول ہیں اور یہ وہی بنیادی اصول دعوت ہیں اور اصول دین ہیں جو حضرت موسیٰ (علیہ السلام) اور حضرت ابراہیم (علیہ السلام) کی کتابوں اور صحیفوں میں مذکور ہوئے تھے۔</p><p>یہ کہ سچائی ایک ہے ، عقیدہ ایک ہے ، اصول دین ایک ہے یہ اس بات کی شہادت ہے کہ یہ سب ادیان ایک اللہ کی طرف سے ہیں۔ وہ ایک ہی ارادہ اور مشیت ہے جس نے ابراہیم اور مولیٰ (علیہما السلام) کو اور پھر حضرت محمد ﷺ کی بعثت کا ارادہ کیا ہے۔ سچائی ایک ہے ، تو اس کا سرچشمہ بھی ایک ہے۔ ہاں ادیان میں فروعی اختلاف ہیں لیکن وہ اس لئے کہ شریعت و قانون میں اللہ نے وقت کے حالات اور تقاضوں کے مطابق تبدیلی فرمائی۔ البتہ تمام شرائع کی اصل ایک ہے اور ایک ہی سرچشمہ سے تمام شریعتیں نکلیں یعنی اسی رب اعلیٰ کی طرف سے آئیں جس نے انسان کو پیدا کیا اور اسے متناسب بنایا اور جس نے ہر چیز کو مقدر کیا ، تقدیر بنائی اور ہر چیز کو ہدایت دی۔</p>"
      },
      {
        "resource_id": 94,
        "text": "( إن هذا ) يعني ما ذكر من قوله : \" قد أفلح من تزكى \" [ إلى تمام ] أربع آيات ، ( لفي الصحف الأولى ) أي في الكتب الأولى التي أنزلت قبل القرآن ، ذكر فيها فلاح المتزكي والمصلي ، وإيثار الخلق الحياة الدنيا على الآخرة ، وأن الآخرة خير وأبقى ."
      },
      {
        "resource_id": 16,
        "text": "إن ما أخبرتم به في هذه السورة هو مما ثبت معناه في الصُّحف التي أنزلت قبل القرآن، وهي صُحف إبراهيم وموسى عليهما السلام."
      },
      {
        "resource_id": 14,
        "text": "يقول تعالى: {قد أفلح من تزكى} أي طهر نفسه من الأخلاق الرذيلة، واتبع ما أنزل اللّه على الرسول صلوات اللّه وسلامه عليه، {وذكر اسم ربه فصلى} أي أقام الصلاة في أوقاتها ابتغاء رضوان اللّه وامتثالاً لشرع اللّه، روي عن جابر بن عبد اللّه يرفعه {قد أفلح من تزكى} قال: من شهد أن لا إله إلا اللّه، وخلع الأنداد، وشهد أني رسول اللّه {وذكر اسم ربه فصلى} قال: (هي الصلوات الخمس والمحافظة عليها والاهتمام بها) \"\"أخرجه الحافظ البزار\"\". وكذا قال ابن عباس أن المراد بذلك الصلوات الخمس، واختاره ابن جرير، وعن عمر بن عبد العزيز أنه كان يأمر الناس بإخراج صدقة الفطر، ويتلو هذه الآية: {قد أفلح من تزكى. وذكر اسم ربه فصلى}، وقال قتادة في هذه الآية: {قد أفلح من تزكى. وذكر اسم ربه فصلى} زكى ماله وأرضى خالقه، ثم قال تعالى: {بل تؤثرون الحياة الدنيا} أي تقدمونها على أمر الآخرة، وتبدّونها على ما فيه نفعكم وصلاحكم في معاشكم ومعادكم، {والآخرة خير وأبقى} أي ثواب اللّه في الدار الآخرة، خير من الدنيا وأبقى، فإن الدنيا دانية فانية، والآخرة شريفة باقية، فكيف يؤثر عاقل ما يفنى على ما يبقى، ويهتم بما يزول عنه قريباً ويترك الاهتمام بدار البقاء والخلد؟ وقد قال رسول اللّه صلى اللّه عليه وسلم:(الدنيا دار من لا دار له، ومال من لا مال له، ولها يجمع من لا عقل له) \"\"أخرجه أحمد عن عائشة مرفوعاً\"\" عن عجرفة الثقفي قال: استقرأت ابن مسعود: {سبح اسم ربك الأعلى} فلما بلغ {بل تؤثرون الحياة الدنيا} ترك القراءة وأقبل على أصحابه وقال: آثرنا الدنيا على الآخرة، فسكت القوم، فقال: آثرنا الدنيا لأنا رأينا زينتها ونساءها وطعامها وشرابها، وزويت عنا الآخرة، فاخترنا هذا العاجل وتركنا الآجل، وهذا منه على وجه التواضع والهضم، وفي الحديث: (من أحب دنياه أضر بآخرته، ومن أحب آخرته أضر بدنياه فآثروا ما يبقى على ما يفنى) \"\"أخرجه أحمد عن أبي موسى الأشعري مرفوعاً\"\"، وقوله تعالى: {إن هذا لفي الصحف الأولى. صحف ابراهيم وموسى} كقوله في سورة النجم: {أم لم ينبأ بما في صحف موسى وإبراهيم الذي وفى. ألا تزر وازرة وزر أُخْرَى. وأن ليس للإنسان إلا ما سعى. وأن سعيه سوف يرى. ثم يجزاه الجزاء الأوفى. وأن إلى ربك المنتهى} الآيات إلى آخرهن؛ وهكذا قال عكرمة في قوله تعالى: {إن هذا لفي الصحف الأولى. صحف إبراهيم وموسى} يقول: الآيات التي في {سبح اسم ربك الأعلى}، وقال أبو العالية: قصة هذه السورة في الصحف الأولى، واختار ابن جرير أن المراد بقوله: {إنّ هذا} إشارة إلى قوله: {قد أفلح من تزكى. وذكر اسم ربه فصلى. بل تؤثرون الحياة الدنيا. والآخرة خير وأبقى}، ثم قال تعالى: {إن هذا} أي مضمون الكلام {لفي الصحف الأولى. صحف إبراهيم وموسى} وهذا الذي اختاره حسن قوي، وقد روي عن قتادة وابن زيد نحوه، واللّه أعلم."
      },
      {
        "resource_id": 91,
        "text": "{ إِنَّ هَذَا } المذكور لكم في هذه السورة المباركة، من الأوامر الحسنة، والأخبار المستحسنة { لَفِي الصُّحُفِ الْأُولَى}"
      },
      {
        "resource_id": 92,
        "text": "إِنَّ هَذَا لَفِي الصُّحُفِ الْأُولَى (18) تذييل للكلام وتنويه به بأنه من الكلام النافع الثابت في كتب إبراهيم وموسى عليهما السلام ، قصد به الإِبلاغ للمشركين الذين كانوا يعرفون رسالة إبراهيم ورسالة موسى ، ولذلك أكّد هذا الخبر ب { إنَّ } ولام الابتداء لأنه مسوق إلى المنكرين . 6والإِشارة بكلمة { هذا } إلى مجموع قوله { قد أفلح من تزكى إلى قوله وأبقى } [ الأعلى : 14 17 ] فإن ما قَبْل ذلك من أول السورة إلى قوله : { قد أفلح من تزكى } [ الأعلى : 14 ] ، ليس مما ثَبت معناه في صحف إبراهيم وموسى عليهما السلام .روى ابن مردويه والآجُري عن أبي ذر قال : «قلت يا رسول الله هل أُنزل عليك شيء مما كان في صحف إبراهيم وموسى؟ قال : نعم { قد أفلح من تزكى وذكر اسم ربه فصلى بل تؤثرون الحياة الدنيا والأخرة خير وأبقى } [ الأعلى : 14 17 ] . ولم أقف على مرتبة هذا الحديث .ومعنى الظرفية من قوله : { لفي الصحف } أن مماثله في المعنى مكتوب في الصحف الأولى ، فأطلقت الصحف على ما هو مكتوب فيها على وجه المجاز المرسل كما في قوله تعالى : { وقالوا ربنا عجل لنا قطنا } [ ص : 16 ] ، أي ما في قِطِّنا وهو صك الأعمال .و { الصحف } : جمع صحيفة على غير قياس لأن قياس جمعه صحائف ، ولكنه مع كونه غير مقيس هو الأفصح كما قالوا : سُفُن في جمع سفينة ، ووجه جمع الصحف أن إبراهيم كانت له صحف وأن موسى كانت له صحف كثيرة وهي مجموع صحف أسفار التوراة ."
      },
      {
        "resource_id": 93,
        "text": "ثم ختم - سبحانه - السورة بقوله : ( إِنَّ هذا لَفِي الصحف الأولى . صُحُفِ إِبْرَاهِيمَ وموسى ) أى : إن هذا الذى ذكرناه من فلاح من تزكى ، ومن إيثاركم الحياة الدنيا على الآخرة ، لكائن وثابت ومذكور فى الصحف الأولى ، التى هى صحف إبراهيم وموسى ، التى أنزلها - سبحانه - على هذين النبيين الكريمين ، ليعلما الناس ما اشتملت عليه من آداب وأحكام ومواعظ . وفى إبهام هذه الصحف ، ووصفها بالقدم ، ثم بيان أنها لنبيين كريمين من أولى العزم من الرسل ، تنويه بشأنها ، وإعلاء من قدرها .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 87:19 for complete tafsir.</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 18{ اِنَّ ہٰذَا لَفِی الصُّحُفِ الْاُوْلٰی۔ } ”یقینا یہی بات اگلے صحیفوں میں بھی۔“ یعنی تذکیر اور ہدایت کا اصل جوہر اور خلاصہ یہی ہے کہ انسان آخرت کو دنیا پر ترجیح دے ‘ کیونکہ دنیا فانی اور وقتی ہے جبکہ آخرت اس سے کہیں بہتر اور ہمیشہ رہنے والی ہے۔ ہدایت کے حوالے سے یہ بنیادی نکتہ پہلے آسمانی صحیفوں میں بھی مذکور تھا۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>নিশ্চয়ই এটা পূর্ববর্তী গ্রন্থসমূহে (বিদ্যমান) আছে।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>নিশ্চয় এটা আছে পূর্ববর্তী সহীফাসমূহে---</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( إِنَّ هَذَا لَفِي الصُّحُفِ الأولَى ) اختلف أهل التأويل في الذي أشير إليه بقوله هذا، فقال بعضهم: أُشير به إلى الآيات التي في  سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى  .* ذكر من قال ذلك:حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن أبيه، عن عكرِمة ( إِنَّ هَذَا لَفِي الصُّحُفِ الأُولَى * صُحُفِ إِبْرَاهِيمَ وَمُوسَى) يقول: الآيات التي في  سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى  .وقال آخرون: قصة هذه السورة.* ذكر من قال ذلك:حدثنا ابن حميد، قال: ثنا مهران، عن أبي جعفر، عن الربيع، عن أبي العالية ( إِنَّ هَذَا لَفِي الصُّحُفِ الأُولَى * صُحُفِ إِبْرَاهِيمَ وَمُوسَى) قال: قصة هذه السورة لفي الصحف الأولى .وقال آخرون: بل معنى ذلك: إن هذا الذي قصّ الله تعالى في هذه السورة ( لَفِي الصُّحُفِ الأولَى ) .* ذكر من قال ذلك:حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة، في قوله: ( إِنَّ هَذَا لَفِي الصُّحُفِ الأولَى ) قال: إن هذا الذي قصّ الله في هذه السورة، لفي الصحف الأولى ( صُحُفِ إِبْرَاهِيمَ وَمُوسَى ) .وقال آخرون: بل عُنِي بذلك أن قوله: ( وَالآخِرَةُ خَيْرٌ وَأَبْقَى ) في الصحف الأولى.* ذكر من قال ذلك:حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( إِنَّ هَذَا لَفِي الصُّحُفِ الأولَى ) قال: تتابعت كتب الله كما تسمعون أن الآخرة خير وأبقى ."
      }
    ]
  },
  {
    "index": 87,
    "sura": 87,
    "verse": 19,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 14,
        "text": "وقوله تعالى إن هذا لفي الصحف الأولى صحف إبراهيم وموسى قال الحافظ أو بكر البزار حدثنا نصر بن علي حدثنا معتمر بن سليمان عن أبيه عن عطاء بن السائب عن عكرمة عن ابن عباس قال لما نزلت إن هذا لفي الصحف الأولى صحف إبراهيم وموسى قال النبي صلى الله عليه وسلم \"كان كل هذا - أو كان هذا - فى صحف إبراهيم وموسى\" ثم قال لا نعلم أسند الثقات عن عطاء بن السائب عن عكرمة عن ابن عباس غير هذا وحديثا آخر رواه مثل هذا وقال النسائي أخبرنا زكريا بن يحيي أخبرنا نصر بن علي حدثنا المعتمر بن سليمان عن أبيه عن عطاء بن السائب عن عكرمة عن ابن عباس قال لما نزلت سبح اسم ربك الأعلى قال كلها في صحف إبراهيم وموسى ولما نزلت وإبراهيم الذي وفى قال وفى إبراهيم ألا تزر وازرة وزر أخرى يعني أن هذه الآية كقوله تعالى في سورة النجم أم لم ينبأ بما في صحف موسى وإبراهيم الذي وفى ألا تزر وازرة وزر أخرى وأن ليس للأنسان إلا ما سعى وأن سعيه سوف يرى ثم يجزاه الجزاء الأوفى وأن إلى ربك المنتهى الآيات إلي آخرهن. وهكذا قال عكرمة فيما رواه ابن جرير عن ابن حميد عن مهران عن سفيان الثوري عن أبيه عن عكرمة في قوله تعالى \"إن هذا لفي الصحف الأولى صحف إبراهيم وموسى\" يقول الآيات التي في \"سبح اسم ربك الأعلى\" وقال أبو العالية قصة هذه السورة في الصحف الأولى واختار ابن جرير أن المراد بقوله \"إن هذا\" إشارة إلى قوله\"قد أفلح من تزكى وذكر اسم ربه فصلى بل تؤثرون الحياة الدنيا والآخرة خير وأبقى\" ثم قال تعالي \"إن هذا\" أي مضمون هذا الكلام \"لفي الصحف الأولى صحف إبراهيم وموسى\" وهذا الذي اختاره حسن قوي وقد روي عن قتادة وابن زيد نحوه والله أعلم آخر تفسير سورة سبح. ولله الحمد والمنة وبه التوفيق والعصمة."
      },
      {
        "resource_id": 91,
        "text": "[ صُحُفِ إِبْرَاهِيمَ وَمُوسَى } اللذين هما أشرف المرسلين، سوى  النبي محمد صلى الله وسلم عليه وسلم.فهذه أوامر في كل شريعة، لكونها عائدة إلى مصالح الدارين، وهي مصالح في كل زمان ومكان.تم تفسير سورة سبح، ولله الحمد  "
      },
      {
        "resource_id": 381,
        "text": "<p><b> নামকরণ ও ফযীলত: </b></p><p>الْأَعْلَي মহান আল্লাহর একটি সিফাত বা গুণবাচক নাম, যার অর্থ সুউচ্চ। প্রথম আয়াতে উল্লিখিত গুণবাচক নাম থেকেই সূরার নামকরণ করা হয়েছে।</p><p>সাহাবী বারা বিন আযিব (রাঃ) হতে বর্ণিত, তিনি বলেন : নাবী (সাঃ)-এর সাহাবীদের মধ্যে প্রথম যারা আমাদের নিকট মদীনায় আসেন তারা হলেন মুসআব বিন উমাইর, ইবনু উম্মে মাকতুম । তারা আমাদেরকে কুরআন পড়াতে শুরু করেন। তারপর আম্মার, বেলাল, সা‘দ আগমন করেন। অতঃপর উমার বিন খাত্তাব (রাঃ) বিশজন সাহাবীসহ আগমন করেন। তারপর নাবী (সাঃ) আসেন। আমি মদীনাবাসীকে অন্য কোন ব্যাপারে এতো বেশি খুশি হতে দেখিনি যতটা খুশি তারা নাবী (সাঃ) এবং তাঁর সহচরদের আগমনে হয়েছিল। ছোট ছোট শিশু ও অপ্রাপ্ত বয়স্ক বালকরা পর্যন্ত আনন্দে কোলাহল শুরু করে যে, ইনি হলেন আল্লাহ তা‘আলার রাসূল মুহাম্মাদ (সাঃ)। রাসূলুল্লাহ (সাঃ)-এর আগমনের পূর্বেই আমি</p><p>(سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَي)</p><p>সূরাটি এ ধরনের অন্যান্য সূূরাগুলোর সাথে মুখস্থ করেছিলাম। (সহীহ বুখারী হা. ৪৯৪১)</p><p>সূরা ইনফিতারে এ সূরার গুরুত্ব সম্পর্কে আলোচনা করা হয়েছে। সহীহ মুসলিমে এসেছে নাবী (সাঃ) দু ঈদ ও জুমু‘আর সালাতে সূরা আ‘লা ও সূরা গাশিয়াহ পাঠ করতেন। আয়িশাহ (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ (সাঃ) বিতরের সালাতে সূরা আ‘লা, সূরা কাফিরূন এবং সূরা ইখলাস পাঠ করতেন। আয়িশাহ (রাঃ) বৃদ্ধি করে বলেন : সূরা ফালাক ও সূরা নাসও পাঠ করতেন। (তিরমিযী হা. ৪৬২-৬৩, মিশকাত হা. ১২৬৯, সহীহ)</p><p>আব্দুল্লাহ ইবনু আব্বাস (রাঃ) বলেন : রাসূলুল্লাহ (সাঃ)</p><p>(سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَي)</p><p>পাঠ করার পর</p><p class='arabic uthmani'>سبحان ربي الأعلي</p><p>(পবিত্র আমার প্রতিপালক, যিনি সর্বোচ্চ) বলতেন। (আবূ দাঊদ হা. ৮৮৩, মিশকাত হা. ৮৮৩, সহীহ)</p><p><b> ১-১৯ নম্বর আয়াতের তাফসীর: </b></p><p>উকবা বিন আমের আল জুহানী (রাঃ) বলেন : যখন</p><p class='arabic uthmani'>(فسَبِّحِ اسْمَ رَبِّكَ العَظِيم)</p><p>অবতীর্ণ হলো তখন রাসূলুল্লাহ (সাঃ) বললেন :</p><p class='arabic uthmani'>اجعلوها في ركوعكم</p><p>এটা তোমরা রুকূতে (পাঠ করার জন্য) গ্রহণ করে নাও। তারপর যখন</p><p>(سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَي)</p><p>অবতীর্ণ হলো তখন রাসূলুল্লাহ (সাঃ) বললেন :</p><p class='arabic uthmani'>اجعلوها في سجودكم</p><p>এটা তোমরা সিজদায় (পাঠ করার জন্য) গ্রহণ করে নাও। (আহমাদ ৪/১৫৫, আবূ দাঊদ হা. ৮৬৯, দুর্বল)</p><p class='arabic uthmani'>نزه اسم ربك الأعلي عن الشريك والنقائص تنزيها يليق بعظمته</p><p><b>অর্থ:</b></p><p>‘তোমার সর্বোচ্চ প্রভুর নামের পবিত্রতা ঘোষণা কর সব শরীক ও অপূর্ণাঙ্গ গুণাবলী হতে তাঁর শান মহত্ত্বের উপযোগী। (তাফসীর মুয়াসসার), ইবনু আব্বাস (রাঃ) বলেন : এর অর্থ হল তোমার মহান পালনকর্তার বড়ত্ব ঘোষণা কর। (কুরতুবী) অর্থাৎ আল্লাহ তা‘আলা সকল দোষত্রুটি, অপূর্ণতা থেকে ঊর্ধ্বে। তিনি তাঁর নাম, গুণাবলী, কাজ ও কথায় পরিপূর্ণ, সর্বোচ্চ। এখানে নাবী (সাঃ)-কে উদ্দেশ্য করে নির্দেশ দেওয়া হলেও মূলত সব উম্মতকে বুঝানো হয়েছে। সুতরাং প্রত্যেক মুসলিম আল্লাহ তা‘আলাকে যাবতীয় শিরক এবং তাঁর শানে ও মহত্ত্বে অশোভনীয় এমন কথা ও কাজ থেকে বিরত থাকবে। শব্দ এটাও প্রমাণ করে যে, আল্লাহ তা‘আলা সুউচ্চ ও সুমহান, তিনি সর্বত্র বিরাজমান নন। বরং তিনি স্বসত্তায় আরশের সমুন্নত আছেন।</p><p>রাসূলুল্লাহ (সাঃ) তাসবীহ পাঠ সম্পর্কে বলেন : আল্লাহ তা‘আলার নিকট সর্বাধিক প্রিয় বাক্য হল চারটি: সুবহানাল্লাহ, আল হামদুলিল্লাহ, লা ইলাহা ইল্লাল্লাহ, আল্লাহু আকবার। (সহীহ মুসলিম হা. ২১৩৭, মিশকাত হা. ২২৯৪) রাসূলুল্লাহ (সাঃ) আরো বলেছেন : যে ব্যক্তি দৈনিক ১০০ বার সুবহানাল্লাহি ওয়া বিহামদিহী পাঠ করবে, তার সকল (সগীরাহ) গুনাহ মাফ করে দেওয়া হবে, যদিও তা সাগরের ফেনা সমতুল্য হয়। (সহীহ বুখারী হা. ৬৪০৫, সহীহ মুসলিম হা. ২৬৯১) তিনি আরো বলেছেন: আল হামদুল্লিাহ মিযানের পাল্লা ভরে দেয়, সুবহানাল্লাহ ও আল হামদুলিল্লাহ আকাশসমূহ ও পৃথিবীর মধ্যবর্তী স্থানকে নেকী দিয়ে পূর্ণ করে দেয়। (সহীহ মুসলিম হা. ২২৩, মিশকাত হা. ২৮১)</p><p>পরের আয়াতে আল্লাহ তা‘আলা চারটি বিষয় তুলে ধরেছেন সৃষ্টি করা, সুবিন্যস্ত করা, পরিমিত করা এবং পথ প্রদর্শন করা। মানুষসহ সকল মাখলূকের মাঝে এ চারটি বিষয় বিদ্যমান। প্রত্যেক প্রাণীর দৈহিক গঠন, আকার-আকৃতি ও অঙ্গ-প্রত্যঙ্গের মধ্যে বিশেষ মিল ও সামঞ্জস্য বিধান করে আল্লাহ তা‘আলা তাকে অস্তিত্ব দান করেছেন। সাথে সাথে তাকে যে কাজের জন্য সৃষ্টি করেছেন তাকে পরিমাণ মত সে কাজের যোগ্যতা দান করেছেন ও সে কাজের জন্য পথ প্রদর্শন করেছেন।</p><p>فَسَوّٰي সূরা ইনফিতারের ৭ নম্বর আয়াতের টীকায় আলোচনা করা হয়েছে।</p><p class='arabic uthmani'>(وَالَّذِيْ قَدَّرَ فَهَدٰي)</p><p>অর্থাৎ তিনি মানুষের তাকদীর নির্ধারণ করেছেন এবং ভাল মন্দের দিক নির্দেশনা দিয়েছেন। এ আয়াত আল্লাহ তা‘আলার ঐ কথার মত যেমন মূসা (আঃ) ফির‘আউনকে বলেছিলেন:</p><p class='arabic uthmani'>(قَالَ رَبُّنَا الَّذِيْٓ أَعْطٰي كُلَّ شَيْءٍ خَلْقَه۫ ثُمَّ هَدٰي)‏</p><p>“মূসা বলল : ‘আমাদের প্রতিপালক তিনি, যিনি প্রত্যেক বস্তুকে তার আকৃতি দান করেছেন, অতঃপর পথনির্দেশ করেছেন।” (সূরা ত্ব-হা ২০ : ৫০)</p><p>রাসূলুল্লাহ (সাঃ) বলেন :</p><p class='arabic uthmani'>كتب الله مقادير الخلائق قبل أن يخلق السماوات والأرض بخمسين ألف سنة، قال : وعرشه علي الماء</p><p>আল্লাহ তা‘আলা আকাশ-জমিন সৃষ্টি করার পঞ্চাশ হাজার বছর পূর্বে সৃষ্টি জীবের তাকদীর নির্ধারণ করে রেখেছিলেন। তখন তার আরশ ছিল পানির ওপর। (সহীহ মুসলিম হা. ২৬৫৩)</p><p class='arabic uthmani'>(أَخْرَجَ الْمَرْعٰي)</p><p>অর্থাৎ আকাশ থেকে বৃষ্টি বর্ষণ করে বিভিন্ন প্রকারের তৃণলতা উৎপন্ন করেছেন।</p><p class='arabic uthmani'>(غُثَا۬ءً أَحْوٰي)</p><p>ঘাস শুকিয়ে গেলে তাকে غُثَا۬ءً বলা হয়। أَحْوٰي শব্দের অর্থ হলো কালো করে দিয়েছেন। অর্থাৎ তাজা সবুজ ঘাসকে শুকিয়ে কালো করে দিয়েছেন। ইমাম কুরতুবী (রহঃ) বলেন: অতীব শুষ্ক হওয়ায় বা পুড়ে যাওয়ার কারণে সবুজ ঘাসপাতা যখন কালো রং ধারণ করে।</p><p>(سَنُقْرِئُكَ فَلَا تَنْسٰيٓ)</p><p>অত্র আয়াতে স্বীয় রাসূলকে কুরআন মুখস্থ করানোর সম্পূর্ণ দায়িত্ব নিয়েছেন বলে রাসূলুল্লাহ (সাঃ)-কে আশ্বস্ত করেছেন। সুতরাং রাসূলুল্লাহ (সাঃ) কুরআন ভুলবেন না, মানুষ যেমন সাধারণত মুখস্থ বিদ্যা ভুলে যায়। জিবরীল (আঃ) যখন ওয়াহী নিয়ে আসতেন তখন তা রাসূলুল্লাহ (সাঃ) তাড়াতাড়ি পড়তে শুরু করতেন যাতে ভুলে না যান। আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(لاَ تُحَرِّكْ بِه۪ لِسَانَكَ لِتَعْجَلَ بِه۪ إِنَّ عَلَيْنَا جَمْعَه۫ وَقُرْاٰنَه۫ فَإِذَا قَرَأْنٰهُ فَاتَّبِعْ قُرْاٰنَه۫)</p><p>“তাড়াতাড়ি ওয়াহী আয়ত্ত করার জন্য তুমি তোমার জিহ্বা ওর সাথে দ্রুত সঞ্চালন কর‎ না।” তা সংরক্ষণ ও পাঠ করাবার দায়িত্ব আমারই। সুতরাং যখন আমি তা (জিবরীল-এর মাধ্যমে) পাঠ করি তুমি তখন সেই পাঠের অনুসরণ কর। (সূরা কিয়ামাহ ৭৫: ১৬)</p><p>অতএব কুরআন হেফাযত করে আল্লাহ তা‘আলা রাসূলের অন্তরে বদ্ধমূল করে দিয়েছেন। ফলে তিনি তা ভুলবেন না। তবে আল্লাহ তা‘আলার হিকমত যা চাইবে ভুলে যাওয়ার তা ভুলে যাবেন। কিন্তু আল্লাহ তা‘আলা এরূপ চাননি যার কারণে সমস্ত কুরআন রাসূলুল্লাহ (সাঃ)-এর মুখস্থ ছিল। কেউ কেউ বলেছেন : এর অর্থ হলো যা আল্লাহ তা‘আলা রহিত করার ইচ্ছা করবেন কেবল তাই ভুলিয়ে দেবেন। (ফাতহুল কাদীর)</p><p class='arabic uthmani'>(يَعْلَمُ الْـجَهْرَ وَمَا يَخْفٰي)</p><p>অর্থাৎ প্রকাশ্য ও অপ্রকাশ্য আল্লাহ তা‘আলা সবকিছু জানেন। তাই কোন্ কথা রাসূলকে ভুলিয়ে দিলে তা জনসাধারণের কল্যাণ হবে তাও আল্লাহ তা‘আলা জানেন।</p><p>(وَنُيَسِّرُكَ لِلْيُسْرٰي)</p><p>এটাও নাবী (সাঃ)-এর জন্য আরো একটি সুসংবাদ যে, আল্লাহ তা‘আলা তাঁর রাসূলের জন্য সকল কাজ সহজ করে দেবেন এবং তার দীন ও শরীয়তকেও সহজ করে দেবেন। সে কথাই রাসূলুল্লাহ (সাঃ) বলছেন :</p><p class='arabic uthmani'>إِنَّ الدِّينَ يُسْرٌ، وَلَنْ يُشَادَّ الدِّينَ أَحَدٌ إِلَّا غَلَبَهُ</p><p>নিশ্চয়ই দীন সহজ, কেউ দীনের ব্যাপারে কঠোরতা করলে দীন তার ওপর জয়ী হয়ে যাবে। (সহীহ বুখারী হা. ৩৯) এ অনুগ্রহ শুধু রাসূলুল্লাহ (সাঃ)-এর সাথে সীমাবদ্ধ নয় বরং প্রত্যেক নেককার বান্দার জন্যও উন্মুক্ত করেছেন। আল্লাহ তা‘আলা বলেন :</p><p class='arabic uthmani'>(فَأَمَّا مَنْ أَعْطٰي وَاتَّقٰي وَصَدَّقَ بِالْـحُسْنٰي فَسَنُيَسِّرُه۫ لِلْيُسْرٰي) ‏</p><p>“অতএব যে দান করে, আল্লাহভীরু হয়, এবং উত্তম বিষয়কে সত্য মনে করে, আমি তাকে সুখের বিষয়ের জন্য সহজ পথ দান করব।” (সূরা লাইল ৯২: ৫-৭) হাদীসে এসেছে : রাসূলুল্লাহ (সাঃ) বলেন: তোমরা কাজ করে যাও কেননা প্রত্যেক ব্যক্তির জন্য ঐ কাজ সহজ করে দেওয়া হয় যার জন্য তাকে সৃষ্টি করা হয়েছে। (সহীহ বুখারী হা. ৪৯৪৯, সহীহ মুসলিম হা. ২৬৪৭) অর্থাৎ যারা সঠিক তাওহীদ ও ঈমানের ওপর অটল থাকবে তাদের জন্য এ সুসংবাদ।</p><p>(فَذَكِّرْ إِنْ نَّفَعَتِ الذِّكْرٰي)</p><p>অর্থাৎ যতক্ষণ উপদেশ কাজে আসে ততক্ষণ মানুষকে উপদেশ দাও। চাই উদ্দেশ্য সম্পূর্ণ অর্জন হোক আর না হোক। (তাফসীর সাদী) অর্থাৎ নবীর দায়িত্ব হল দাওয়াতী কার্যক্রম চালিয়ে যাওয়া ও মানুষকে নসীহত করা যতক্ষণ তা কাজে আসবে। যত নসীহত বর্জন করে ততই তাদেরকে সৎ পথে আনার জন্য নসীহত করেই যেতে হবে এমন নয়। যেমন আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَإِذَا رَأَيْتَ الَّذِيْنَ يَخُوْضُوْنَ فِيْٓ اٰيٰتِنَا فَأَعْرِضْ عَنْهُمْ حَتّٰي يَخُوْضُوْا فِيْ حَدِيْثٍ غَيْرِه۪)</p><p>“তুমি যখন দেখ, তারা আমার আয়াতসমূহ সম্বন্ধে উপহাসমূলক আলোচনায় মগ্ন তখন তুমি তাদের হতে সরে পড়, যে পর্যন্ত না তারা অন্য প্রসঙ্গে প্রবৃত্ত হয়” (সূরা আন‘আম ৬: ৬৮) রাসূলুল্লাহ (সাঃ) বলেন: দীন হল নসীহত করা। (সহীহ মুসলিম হা. ২০৫) সুতরাং স্থান-কাল ও পাত্র ভেদে নসীহত করা কখনও ফরয, কখনও মুস্তাহাব হয়ে থাকে। তবে সাধারণ নির্দেশ হল সকলকে নসীহত করতে হবে। হিদায়াতের মালিক আল্লাহ তা‘আলা।</p><p class='arabic uthmani'>(وَيَتَجَنَّبُهَا الْأَشْقَي)</p><p>অর্থাৎ যারা দীন ইসলাম থেকে মুখ ফিরিয়ে নেবে তারাই হতভাগা তাদের জন্যই জাহান্নাম।</p><p>অন্যত্র আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(فَاَمَّا الَّذِیْنَ شَقُوْا فَفِی النَّارِ لَھُمْ فِیْھَا زَفِیْرٌ وَّشَھِیْقٌ﮹ خٰلِدِیْنَ فِیْھَا مَا دَامَتِ السَّمٰوٰتُ وَالْاَرْضُ اِلَّا مَا شَا۬ئَ رَبُّکَﺚ اِنَّ رَبَّکَ فَعَّالٌ لِّمَا یُرِیْدُ﮺ وَاَمَّا الَّذِیْنَ سُعِدُوْا فَفِی الْجَنَّةِ خٰلِدِیْنَ فِیْھَا مَا دَامَتِ السَّمٰوٰتُ وَالْاَرْضُ اِلَّا مَا شَا۬ئَ رَبُّکَﺚ عَطَا۬ئً غَیْرَ مَجْذُوْذٍ)</p><p>“অতঃপর যারা হতভাগা তারা থাকবে অগ্নিতে এবং সেথায় তাদের জন্য থাকবে চীৎকার ও আর্তনাদ, সেথায় তারা স্থায়ী হবে যতদিন আকাশসমূহ ও পৃথিবী বিদ্যমান থাকবে যদি না তোমার প্রতিপালক অন্যরূপ ইচ্ছা করেন; নিশ্চয়ই তোমার প্রতিপালক তাই করেন যা তিনি ইচ্ছা করেন। পক্ষান্ত‎রে যারা ভাগ্যবান তারা থাকবে জান্নাতে সেথায় তারা স্থায়ী হবে, যত দিন আকাশসমূহ ও পৃথিবী বিদ্যমান থাকবে, যদি না তোমার প্রতিপালক অন্যরূপ ইচ্ছা করেন; এটা এক নিরবচ্ছিন্ন পুরস্কার।” (সূরা হূদ ১১: ১০৬-১০৮)</p><p class='arabic uthmani'>(النَّارَ الْكُبْرٰي)</p><p>‘মহা অগ্নি’ রাসূলুল্লাহ (সাঃ) বলেন :</p><p class='arabic uthmani'>نَارُكُمْ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ</p><p>তোমাদের এ আগুন জাহান্নামের আগুনের ৭০ ভাগের এক ভাগ মাত্র। (সহীহ বুখারী হা. ৩২৬৫) অর্থাৎ দুনিয়ার আগুনের চেয়ে তা ৬৯ গুণ বেশি উত্তাপের অধিকারী এবং সে কারণে এখানে জাহান্নামের আগুনকে মহা অগ্নি বলা হয়েছে। সুতরাং এমন আগুনে যাতে যেতে না হয় সেজন্য সাধ্যমত সৎকাজ করতে হবে।</p><p class='arabic uthmani'>(لَا يَمُوْتُ فِيْهَا وَلَا يَحْيٰي)</p><p>অর্থাৎ যেসব দুর্ভাগা উপদেশ বর্জন করবে তারা জাহান্নামে যাবে, যেখানে তারা মারাও যাবেনা, জীবিতও থাকে না। অর্থাৎ মারা যাবে না যাতে শাস্তি থেকে বেঁচে যায় বা আরাম না পায়, আবার ভালভাবে জীবিতও থাকবে না যাতে আরাম পায়। মোট কথা সবর্দা আযাবে হাবুডুবু খাবে। এ সম্পর্কে সূরা ত্বহার ৭৪ নম্বর আয়াতে আলোচনা করা হয়েছে।</p><p>تَزَكّٰي অর্থাৎ যারা নিজেদের আত্মাকে খারাপ চরিত্র এবং পাপ ও শিরক থেকে পবিত্র করতে পেরেছে তারাই সফলকাম।</p><p>(وَذَكَرَ اسْمَ رَبِّه۪ فَصَلّٰي)</p><p>অর্থাৎ আল্লাহ তা‘আলার স্মরণে মগ্ন থাকে, তাঁর একত্বতা ঘোষণা করে, একমাত্র তাঁকেই ডাকে এবং তাঁর সন্তুষ্টির জন্য আমল করে। فَصَلّٰي অর্থাৎ আল্লাহ তা‘আলার সন্তুষ্টির জন্য শরীয়ত বাস্তবায়ন লক্ষ্যে যথাসময়ে সালাত আদায় করে। (তাফসীর মুয়াসসার)</p><p>আর যারা তাফসীর করে থাকেন تَزَكّٰي অর্থ ফিতরা আদায় করা এবং আল্লাহ তা‘আলাকে স্মরণ করা, আর فَصَلّٰي অর্থ ঈদের সালাত আদায় করাÑতাদের কথা যদিও শব্দের অর্থের মাঝে অন্তর্ভুক্ত এবং আংশিকের ওপর প্রমাণ বহন করে কিন্তু শুধু এটুকুর মাঝে আয়াতের অর্থ সীমাবদ্ধ নয়। (তাফসীর সা‘দী)</p><p>সুতরাং যে ব্যক্তি সকল প্রকার দুনিয়াবী স্বার্থ মানুষের সন্তুষ্টি হাসিল থেকে নিজেকে পরিশুদ্ধ করতে পারল এবং সকল প্রকার শিরক ও বিদআত থেকে মুক্ত থেকে আল্লাহ তা‘আলার সন্তুষ্টির জন্য সঠিক পদ্ধতিতে আমল করল সে ব্যক্তিই সফলকাম।</p><p class='arabic uthmani'>(بَلْ تُؤْثِرُوْنَ الْـحَيٰوةَ الدُّنْيَا)</p><p>অর্থাৎ হে মানব জাতি! তোমরা দুনিয়ার চাকচিক্যময় জীবনকেই আখেরাতের নেয়ামতের ওপর প্রাধান্য দিয়ে থাকো অথচ আখেরাত ও তার নেয়ামতরাজি সব চিরস্থায়ী এবং দুনিয়া থেকে উত্তম। আনাস (রাঃ) বলেন : আমরা একদা আবূ মূসা আশআরী (রাঃ)-এর সাথে ছিলাম। তিনি সবাইকে বললেন : এসো আমরা কিছুক্ষণ আমাদের প্রভুকে স্মরণ করি। অতঃপর তিনি বলেন : হে আনাস! তুমি কি জান কোন বস্তু মানুষকে আখিরাত থেকে আটকে রাখে? আমি বললাম; দুনিয়া, শয়তান ও কুপ্রবৃত্তি। তিনি বলেন : না। বরং দুনিয়া নগদ পাওয়া যায় আর আখেরাত অদৃশ্যে থাকে। আল্লাহ তা‘আলার কসম! যদি তারা আখেরাতকে চোখের সামনে দেখতে পেত তাহলে তারা পিঠ ফেরাতো না বা ইতস্তত করত না। (তাফসীর কুরতুবী) আল্লাহ তা‘আলা বলেন :</p><p class='arabic uthmani'>(إِنَّهُمْ يَرَوْنَه۫ بَعِيْدًا وَّنَرَاهُ قَرِيْبًا)</p><p>“নিশ্চয়ই তারা ঐ দিনকে অনেক দূরে মনে করে, কিন্তু আমি তা দেখছি নিকটে।” (সূরা মাআরিজ ৭০ : ৬-৭)</p><p>সুতরাং আখেরাতের তুলনায় দুনিয়াকে প্রাধ্যান্য দেওয়া ঈমানের দুর্বলতা ছাড়া আর কিছুই না। অথচ রাসূলুল্লাহ (সাঃ) বলেন : আখেরাতের তুলনায় দুনিয়া অনুরূপ তুচ্ছ, যেরূপ তোমাদের কেউ সাগরে আঙ্গুল ডুবালে তাতে যৎসামান্য পানি উঠে আসে। (সহীহ মুসলিম হা. ২৮৫৮, মিশকাত হা. ৫১৫৬)</p><p>(اِنَّ ھٰذَا لَفِی .....)</p><p>অর্থাৎ অত্র সূরায় যেসব উত্তম বিধি-বিধান ও সংবাদ উল্লেখ করা হলো এ সব কিছুর অর্থ ইবরাহীম ও মূসা (আঃ)-এর ওপর অবতীর্ণ সহীফায় উল্লেখ ছিল। ইমাম ইবনু কাসীর (রহঃ) বলেন : ১৪-১৭ নম্বর আয়াতে বর্ণিত বক্তব্য হল বিগত ইলাহী ধর্ম ও আসমানী কিতাবসমূহের শিক্ষার সারনির্যাস। যা মানুষকে দুনিয়াবী লোভ-লালসার কলুষ হতে মুক্ত করে এবং আখেরাতের স্বচ্ছ গুণাবলীতে আলোকিত করে।</p><p><b> আয়াত হতে শিক্ষণীয় বিষয়: </b></p><p>১. সূরার গুরুত্ব জানতে পারলাম।</p><p>২. মাখলূক সৃষ্টি করার পঞ্চাশ হাজার বছর পূর্বে আল্লাহ তা‘আলা তাকদীর নির্ধারণ করে রেখেছেন।</p><p>৩. সূরার প্রথম আয়াত পড়ে سبحان ربي الأعلي বলা মুস্তাহাব।</p><p>৪. অত্র সূরা ও সূরা গাশিয়াহ জুমু‘আ ও ঈদের সালাতে এবং বিতর সালাতে পাঠ করা সুন্নাত।</p><p>৫. যতক্ষণ দাওয়াতী কাজে উপকার আসবে ততক্ষণ তা বহাল রাখা আবশ্যক।</p><p>৬. দুনিয়ার চাকচিক্যকে আখেরাতের উপর প্রাধান্য দেয়া ঈমানের দুর্বলতা।</p><p>৭. আল্লাহ তা‘আলাকে যাবতীয় শির্ক, ত্রুটিপূর্ণ গুণ ও অসঙ্গতিপূর্ণ কথা থেকে পবিত্র করা আবশ্যক। তাঁর শানে অশোভনীয় কোন কথা বলা উচিত নয়।</p>"
      },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "ثم بين الصحف فقال : ( صحف إبراهيم وموسى ) قال عكرمة والسدي : هذه السورة في صحف إبراهيم وموسى .أخبرنا الإمام أبوعلي الحسين بن محمد القاضي أخبرنا أبو بكر أحمد بن الحسن الحيري أخبرنا محمد بن أحمد بن معقل الميداني ، حدثنا محمد بن يحيى [ بن أيوب حدثنا سعيد بن كثير حدثنا ] يحيى بن أيوب عن يحيى بن سعيد عن عمرة بنت عبد الرحمن عن عائشة رضي الله عنها قالت : كان النبي - صلى الله عليه وسلم - يقرأ في الركعتين اللتين يوتر بعدهما ب \" سبح اسم ربك الأعلى \" و \" قل يا أيها الكافرون \" وفي الوتر ب \" قل هو الله أحد \" و \" قل أعوذ برب الفلق \" و \" قل أعوذ برب الناس \" ."
      },
      {
        "resource_id": 164,
        "text": "<p><b>১৪-১৯ নং আয়াতের তাফসীর</b>আল্লাহ্ তাবারাকা ওয়া তা'আলা বলেনঃ যে ব্যক্তি চরিত্রহীনতা হতে নিজেকে পবিত্র করে নিয়েছে, ইসলামের হুকুম আহকামের পুরোপুরি তাবেদারী করেছে এবং নামায প্রতিষ্ঠিত করেছে শুধুমাত্র আল্লাহর আদেশ পালন ও তাঁর সন্তুষ্টি অর্জনের উদ্দেশ্যে, সে মুক্তি ও সাফল্য লাভ করেছে।হযরত জাবির ইবনে আবদিল্লাহ্ (রাঃ) হতে বর্ণিত আছে যে, নবী করীম (সঃ) (আরবি) এ আয়াতের তাফসীরে বলেনঃ “যে ব্যক্তি সাক্ষ্য প্রদান করেছে, সে মুক্তি ও সাফল্য লাভ করেছে। আর (আরবি) এ আয়াতের তাফসীরে বলেনঃ “এটা হলো পাঁচ ওয়াক্ত নামায পড়া এবং এর উপর পুরোপুরি যত্নবান থাকা।”হযরত ইবনে আব্বাস (রাঃ) বলেন যে, এখানে দৈনন্দিনের পাঁচ ওয়াক্ত নামাযকে বুঝানো হয়েছে।হযরত আবুল আলিয়া (রঃ) একবার ঈদের পূর্বের দিন আবূ খালদা (রঃ)-কে বলেনঃ “কাল ঈদগাহে যাওয়ার সময় আমার সাথে সাক্ষাৎ করে যেয়ো।” আবূ খালদা' (রঃ) বলেনঃ আমি তার কথামত তাঁর কাছে গেলে তিনি আমাকে জিজ্ঞেস করলেনঃ “তুমি কি কিছু খেয়েছো?” আমি উত্তরে বললামঃ হ্যা (খেয়েছি)। তিনি প্রশ্ন করলেনঃ “গোসল করেছো?” আমি জবাব দিলামঃ হ্যা (করেছি)। তিনি জিজ্ঞেস করলেনঃ “ফিত্রা’ আদায় করেছো?” আমি জবাবে বললামঃ হ্যা (করেছি)। তিনি তখন বললেনঃ “আমি তোমাকে এ কথা বলার জন্যেই ডেকেছিলাম। এ আয়াতের অর্থও এটাই বটে।\" মদীনাবাসী ফিত্রা’ আদায় করা এবং পানিপান করানোর চেয়ে উত্তম কোন সাদকার কথা জানতেন হযরত উমার ইবনে আবদিল আযীযও (রঃ) লোকদেরকে ফিত্রা’ আদায়ের আদেশ করতেন এবং এ আয়াত পাঠ করে শুনাতেন।হযরত আবুল আহওয়াস (রঃ) বলতেনঃ “যদি তোমাদের মধ্যে কেউ নামায পড়ার ইচ্ছা করে এবং এই অবস্থায় কোন ভিক্ষুক এসে পড়ে তবে যেন সে তাকে কিছু দান করে।” অতঃপর তিনি (আরবি)  আয়াত দু’টি পাঠ করতেন। হযরত কাতাদা (রঃ) বলেন যে, এ আয়াতদ্বয়ের ভাবার্থ হলোঃ যে নিজের মালকে পবিত্র করেছে এবং স্বীয় সৃষ্টিকর্তাকে সন্তুষ্ট করেছে (সে সফলকাম হয়েছে)।এরপর আল্লাহ তা'আলা বলেনঃ কিন্তু তোমরা পার্থিব জীবনকে প্রাধান্য দিয়ে থাকো। অর্থাৎ তোমরা আখেরাতের উপর পার্থিব জীবনকেই প্রাধান্য দিচ্ছ, অথচ প্রকৃতপক্ষে আখেরাতের জীবনকে দুনিয়ার জীবনের উপর প্রাধান্য দেয়ার মধ্যেই তোমাদের কল্যাণ নিহিত রয়েছে। দুনিয়া তো হলো ক্ষণস্থায়ী, ভঙ্গুর অমর্যাদাকর। পক্ষান্তরে, আখেরাতের জীবন হলো চিরস্থায়ী ও মর্যাদাকর। কোন বুদ্ধিমান লোক অস্থায়ীকে স্থায়ীর উপর এবং মর্যাদাহীনকে মর্যাদাসম্পন্নের উপর প্রাধান্য দিতে পারে না। দুনিয়ার জীবনের জন্যে আখেরাতের জীবনের প্রস্তুতি পরিত্যাগ করতে পারে না।মুসনাদে আহমদে হযরত আয়েশা (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ “দুনিয়া ঐ ব্যক্তির ঘর যার (আখেরাতে কেনি) ঘর নেই, দুনিয়া ঐ ব্যক্তির সম্পদ যার (আখেরাতে কোন) সম্পদ নেই এবং দুনিয়ার জন্যে ঐ ব্যক্তি (মালধন) জমা করে যার বিবেক বুদ্ধি নেই।”হযরত আ’রফাজা’ সাকাফী (রাঃ) হতে বর্ণিত, তিনি বলেনঃ আমি হযরত ইবনে মাসউদ (রাঃ) কাছে (আরবি) এই সূরাটির পাঠ শুনতে শুনতে চাচ্ছিলাম। যখন তিনি (আরবি) পর্যন্ত পৌঁছলেন তখন তিনি এর পাঠ ছেড়ে দিয়ে স্বীয় সঙ্গীদেরকে বললেনঃ “আমরা পার্থিব জীবনকে আখেরাতের জীবনের উপর প্রাধান্য দিয়েছি। তার এ কথায় জনগণ নীরব থাকলে তিনি বলেনঃ আমরা দুনিয়ার মোহে পড়ে গেছি। দুনিয়ার সৌন্দর্য নারী, খাদ্য ও পানীয় ইত্যাদি আমরা দেখতে পাচ্ছি। আর আখেরাত আমাদের দৃষ্টির অন্তরালে রয়েছে। তাই আমরা আমাদের সামনের জিনিসের প্রতি মনোযোগ দিয়েছি এবং দূরের জিনিস হতে চক্ষু ফিরিয়ে নিয়েছি।” (এটা ইমাম ইবনে জারীর (রঃ) বর্ণনা করেছেন) হযরত আবদুল্লাহ (ইবনে মাসউদ (রাঃ) এ কথাগুলো বিনয় প্রকাশের জন্যে বলেছেন, না মানুষের স্বভাব হিসেবে বলেছেন তা আল্লাহ পাকই ভাল জানেন।মুসনাদে আহমদে হযরত আবু মূসা আশআরী (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ “যে ব্যক্তি দুনিয়াকে ভালবেসেছে সে তার আখেরাতের ক্ষতি করেছে, আর যে ব্যক্তি আখেরাতকে ভালবেসেছে, সে তার দুনিয়ার ক্ষতি করেছে। হে জনমণ্ডলী! যা বাকী থাকবে তাকে যা বাকী থাকবে না তার উপর প্রাধান্য দাও।” এরপর আল্লাহ তা'আলা বলেনঃ “এটা তো পূর্ববর্তী সহীফাসমূহে ইবরাহীম (আঃ) এবং মূসা (আঃ)-এর সহীফাসমূহে রয়েছে। হযরত ইবনে আব্বাস (রাঃ) বলেন যে, যখন (আরবি) এই আয়াত অবতীর্ণ হয় তখন নবী করীম (সঃ) বলেনঃ “এর প্রত্যেকটাই হযরত ইবরাহীম (আঃ)ও হযরত মূসা (আঃ)-এর সহীফাসমূহে বিদ্যমান ছিল।” (এ হাদীসটি হাফিয আবু বকর আল বাযযার (রঃ) বর্ণনা করেছেন)সুনানে নাসাঈতে হযরত ইবনে আব্বাস (রাঃ) হতে বর্ণিত আছে যে, যখন(আরবি) অবতীর্ণ হয় তখন বলেন “এর প্রত্যেকটাই হযরত ইবরাহীম (আঃ) ও হযরত মূসা (আঃ)-এর সহীফাসমূহে রয়েছে। আর যখন (আরবি) (৫৩:৩৭) অবতীর্ণ হয় তখন বলেনঃ হযরত ইবরাহীম (আঃ) তাঁর দায়িত্ব পুরোপুরি পালন করেছিলেন। (আরবি) (কোন বহনকারী অপরের বোঝা বহন করবে না। (১৭:১৫) অর্থাৎ এই আয়াত সুরা নাজমের নিম্নের আয়াতগুলোর মতঃ (আরবি)অর্থাৎ “তাকে কি অবগত করা হয়নি যা আছে মূসা (আঃ) এর কিতাবে? এবং ইব্রাহীম (আঃ) এর কিতাবে, যে পালন করেছিল তার দায়ীত্ব? তা এই যে, কোন বহনকারী অপরের বোঝা বহন করবে না। আর এই যে, মানুষ তাই পায় যা সে করে। আর এই যে, তার কর্ম অচিরেই দেখানো হবে। অতঃপর তাকে দেয়া হবে পূর্ণ প্রতিদান। আর এই যে, সবকিছুর সমাপ্তি তো তোমার প্রতিপালকের নিকট [শেষ পর্যন্ত আয়াতগুলো]।” (৫৩ ৪ ৩৬-৪২) অর্থাৎ সমস্ত হুকুম-আহকাম পূর্ববর্তী আয়াতসমূহেও লিপিবদ্ধ ছিল। একইভাবে (আরবি) সূরার আয়াতগুলোতেও ঐ সব হুকুম আহকামের কথা বুঝানো হয়েছে। কেউ কেউ বলেছেন যে, সমগ্র সূরাটিতেই এগুলোর বর্ণনা রয়েছে। আবার কারো কারো মতে(আরবি) হতে (আরবি) পর্যন্ত আয়াতগুলোতে এর বর্ণনা রয়েছে। প্রথম উক্তিটিই বেশী সবল। এটাকেই হাসান (রঃ) পছন্দ করেছেন। এ সব ব্যাপারে আল্লাহ তাআলাই সর্বাধিক সঠিক জ্ঞানের অধিকারী।</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 19{ صُحُفِ اِبْرٰہِیْمَ وَمُوْسٰی۔ } ”یعنی ابراہیم اور موسیٰ e کے صحیفوں میں۔“ حضرت موسیٰ علیہ السلام کے صحائف تو آج بھی کسی نہ کسی شکل میں موجود ہیں ‘ البتہ حضرت ابراہیم علیہ السلام کے صحائف کا آج بظاہر کہیں نشان نہیں ملتا۔ اس حوالے سے میری رائے یہ ہے اور میں اپنی اس رائے کا اظہار قبل ازیں بھی متعدد بار کرچکا ہوں کہ ہندوئوں کے اپنشد حضرت ابراہیم علیہ السلام کے صحائف ہی کی بگڑی ہوئی شکلیں ہیں۔</p>"
      },
      { "resource_id": 165, "text": "<p>ইব্রাহীম ও মূসার গ্রন্থসমূহে।</p>" },
      {
        "resource_id": 166,
        "text": "<p>ইব্রাহীম ও মূসার সহীফাসমূহে [১]।</p><p>[১] অর্থাৎ এই সূরার সব বিষয়বস্তু অথবা সর্বশেষ বিষয়বস্তু (আখেরাত উৎকৃষ্ট ও চিরস্থায়ী হওয়া) পূর্ববর্তী ইব্রাহীম ও মূসা আলাইহিস্ সালাম-এর সহীফাসমূহে লিখিত আছে। [ইবন কাসীর]</p>"
      },
      {
        "resource_id": 15,
        "text": "حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله: ( إِنَّ هَذَا لَفِي الصُّحُفِ الأُولَى * صُحُفِ إِبْرَاهِيمَ وَمُوسَى) قال: في الصحف التي أنـزلها الله إبراهيم وموسى أن الآخرة خير من الأولى .وأولى الأقوال في ذلك بالصواب، قول من قال: إن قوله: ( قَدْ أَفْلَحَ مَنْ تَزَكَّى * وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّى * بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا * وَالآخِرَةُ خَيْرٌ وَأَبْقَى) لفي الصحف الأولى، صحف إبراهيم خليل الرحمن، وصحف موسى بن عمران.وإنما قلت: ذلك أولى بالصحة من غيره؛ لأن هذا إشارة إلى حاضر، فلأن يكون إشارة إلى ما قرب منها أولى من أن يكون إشارة إلى غيره. وأما الصحف: فإنها جمع صحيفة، وإنما عُنِي بها: كتب إبراهيم وموسى.حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، عن أبي الخلد، قال: نـزلت صحف إبراهيم في أوّل ليلة من رمضان، وأنـزلت التوراة لستّ ليال خلون من رمضان، وأنـزل الزبور لاثنتي عشرة ليلة، وأنـزل الإنجيل لثماني عشرة، وأنـزل الفرقان لأربع وعشرين .آخر تفسير سورة سبح اسم ربك الأعلى"
      },
      {
        "resource_id": 16,
        "text": "إن ما أخبرتم به في هذه السورة هو مما ثبت معناه في الصُّحف التي أنزلت قبل القرآن، وهي صُحف إبراهيم وموسى عليهما السلام."
      },
      {
        "resource_id": 170,
        "text": "Упомянутые в этой благословенной суре прекрасные заповеди и повествования, записаны в свитках Ибрахима и Мусы - свитках двух самых славных посланников после Мухаммада. Эти заповеди были ниспосланы в законах всех пророков, ибо они касаются преуспеяния в обеих жизнях и приносят пользу в любую эпоху и в любом месте. Хвала же за это надлежит одному Аллаху!"
      },
      {
        "resource_id": 93,
        "text": "ثم ختم - سبحانه - السورة بقوله : ( إِنَّ هذا لَفِي الصحف الأولى . صُحُفِ إِبْرَاهِيمَ وموسى ) أى : إن هذا الذى ذكرناه من فلاح من تزكى ، ومن إيثاركم الحياة الدنيا على الآخرة ، لكائن وثابت ومذكور فى الصحف الأولى ، التى هى صحف إبراهيم وموسى ، التى أنزلها - سبحانه - على هذين النبيين الكريمين ، ليعلما الناس ما اشتملت عليه من آداب وأحكام ومواعظ . وفى إبهام هذه الصحف ، ووصفها بالقدم ، ثم بيان أنها لنبيين كريمين من أولى العزم من الرسل ، تنويه بشأنها ، وإعلاء من قدرها .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم ."
      },
      {
        "resource_id": 92,
        "text": "صُحُفِ إِبْرَاهِيمَ وَمُوسَى (19)وجاء نظم الكلام على أسلوب الإِجمال والتفصيل ليكون لهذا الخبر مزيد تقرير في أذهان الناس فقوله : { صحف إبراهيم وموسى } بدل من { الصحف الأولى } .و { الأولى } : وصف لصُحف الذي هو جمع تكسير فله حكم التأنيث . و { الأولى } صيغة تفضيل . واختلف في الحروف الأصلية للفظ أوّل فقيل : حروفه الأصول همزة فواو ( مكررة ) فلام ذكره في «اللسان» فيكون وزن أول : أَأَوَل ، فقلبت الهمزة الثانية واواً وأدغمت في الواو . وقيل : أُصوله : وَاوَان ولام وأن الهمزة التي في أوله مزيدة فوزن أول : أفعل وإدغام إحدى الواوين ظاهر .وقيل : حروفه الأصلية واو وهمزة ولام فأصل أول أوْ ألْ بوزن أفعل قلبت الهمزة التي بعد الواو واواً وأدغما .و { الأولى } : مؤنث أفعل من هذه المادة فإما أن نقول : أصلها أُوْلى سكنت الواو سكوناً ميتاً لوقوعها إثر ضمة ، أو أصلها : وُوْلَى بواو مضمومة في أوله وسكنت الواو الثانية أيضاً ، أو أصلها : وُألَى بواو مضمومة ثم همزة ساكنة فوقع فيه قلب ، فقيل : أولى فوزنها على هذا عُفْلَى .والمراد بالأولية في وصف الصحف سبق الزمان بالنسبة إلى القرآن لا التي لم يسبقها غيرها لأنه قد روي أن بعض الرسل قبل إبراهيم أنزلت عليه صحف فهو كوصف { عاد بالأولى } في قوله : { وأنه أهلك عاداً الأولى } [ النجم : 50 ] وقوله تعالى : { هذا نذير من النذر الأولى } [ النجم : 56 ] وفي حديث البخاري : \" إنَّ مما أدرك الناسُ من كلام النبوءة الأولى إذَا لم تستح فاصنع ما شئت \" .وأخرج عبدُ بن حميد وابن مردويه وابن عساكر وأبو بكر الآجُري عن أبي ذرّ عن رسول الله صلى الله عليه وسلم أن صحف إبراهيم كانت عشر صحائف ."
      },
      {
        "resource_id": 90,
        "text": "صحف إبراهيم وموسى يعني الكتب المنزلة عليهما . ولم يرد أن هذه الألفاظ بعينها في تلك الصحف ، وإنما هو على المعنى أي إن معنى هذا الكلام وارد في تلك الصحف . وروى الآجري من حديث أبي ذر قال : قلت يا رسول الله ، فما كانت صحف إبراهيم ؟ قال : كانت أمثالا كلها : أيها الملك المتسلط المبتلى المغرور ، إني لم أبعثك لتجمع الدنيا بعضها على بعض ، ولكن بعثتك لترد عني دعوة المظلوم . فإني لا أردها ولو كانت من فم كافر . وكان فيها أمثال : وعلى العاقل أن يكون له ثلاث ساعات : ساعة يناجي فيها ربه ، وساعة يحاسب فيها نفسه ، يفكر فيها في صنع الله - عز وجل - إليه ، وساعة يخلو فيها لحاجته من المطعم والمشرب . وعلى العاقل ألا يكون ظاعنا إلا في ثلاث : تزود لمعاد ، ومرمة لمعاش ، ولذة في غير محرم . وعلى العاقل أن يكون بصيرا بزمانه ، مقبلا على شأنه ، حافظا للسانه . ومن عد كلامه من عمله قل كلامه إلا فيما يعنيه . قال : قلت يا رسول الله ، فما كانت صحف موسى ؟ قال : كانت عبرا كلها : عجبت لمن أيقن بالموت كيف يفرح ! وعجبت لمن أيقن بالقدر كيف ينصب . وعجبت لمن رأى الدنيا وتقلبها بأهلها كيف يطمئن إليها ! وعجبت لمن أيقن بالحساب [ ص: 23 ] غدا ثم هو لا يعمل ! . قال : قلت يا رسول الله ، فهل في أيدينا شيء مما كان في يدي إبراهيم وموسى ، مما أنزل الله عليك ؟ قال : \" نعم اقرأ يا أبا ذر : قد أفلح من تزكى وذكر اسم ربه فصلى بل تؤثرون الحياة الدنيا والآخرة خير وأبقى إن هذا لفي الصحف الأولى صحف إبراهيم وموسى \" وذكر الحديث ."
      }
    ]
  }
]
