[
  {
    "index": 104,
    "sura": 104,
    "verse": 1,
    "tafsirs": [
      {
        "resource_id": 168,
        "text": "<p>Warning against dreadful end of those committing three obnoxious sins</p><p>This Surah warns of the severe punishment on three grave sins, and then highlights the nature of that severe punishment. The three sins are backbiting, deriding and selfish hoarding of wealth. The words hamz and lamz are used in several senses. Most commentators agree that the word hamz, from which is derived the word humazah, means to 'backbite', that is, to speak ill of a person behind his back. The word lamz, from which is derived the word lumazah, means to 'slander' or 'to deride', that is, to speak ill of a person to his face. Both these sins are morally and socially obnoxious and deadly. The Qur'an and the Sunnah have sounded a stern warning against these sins. However, 'backbiting' is, from one perspective, worse than 'slander'. 'Backbiting' is worse because the ill of a person is spoken behind his back; the victim is not present to defend himself and put an end to it; thus the sin continues to be committed to a greater and increasing degree. 'Slander', on the other hand, though an obnoxious sin in itself, is relatively less in degree than backbiting, because the victim is present to defend himself and put an end to face-to-face insulting or fault-finding with him. From another perspective 'slander' is worse than 'backbiting', because to speak ill of a person to his face is tantamount to insulting him and denigrating him. This is morally and socially more harmful and hurting, and therefore its punishment is more dreadful. According to a Hadith, the Holy Prophet ﷺ has said,</p><p>شِرارُ عِبَادِ اللہِ تَعَالٰی المَشَّاءُونَ بِالنَّمِیمَۃِ المُفَرِّقُونَ بَینَ الاَحبَّۃِ البَاعُونَ البُرَآَءَ العنت</p><p>\"The worst servants of Allah are those who speak ill of someone, creating enmity between friends and finding fault with innocent people.\"</p>"
      },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله جل ثناؤه وتقدست أسماؤه:  وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ (1)يعني تعالى ذكره بقوله:( وَيْلٌ لِكُلِّ هُمَزَةٍ ) الوادي يسيل من صديد أهل النار وقيحهم,( لِكُلِّ هُمَزَةٍ ) : يقول: لكل مغتاب للناس, يغتابهم ويبغضهم, كما قال زياد الأعجم:تُــدلِي بــوُدِّي إذا لاقَيْتَنِـي كَذِبـاوَإنْ أُغَيَّــبْ فـأنتَ الهـامِزُ اللُّمَـزَهْ (1)ويعني باللمزة: الذي يعيب الناس, ويطعن فيهم.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثنا مسروق بن أبان, قال: ثنا وكيع, عن رجل لم يسمه, عن أبي الجوزاء, قال: قلت لابن عباس: من هؤلاء هم الذين بدأهم الله بالويل ؟ قال: هم المشاءون بالنميمة, المفرقون بين الأحبة, الباغون أكبر العيب.حدثنا أبو كريب, قال: ثنا وكيع, عن أبيه, عن رجل من أهل البصرة, عن أبي الجوزاء, قال: قلت: لابن عباس: من هؤلاء الذين ندبهم الله إلى الويل ؟ ثم ذكر نحو حديث مسروق بن أبان.حدثنا ابن حُميد, قال: ثنا مهران, عن سفيان, عن ابن أبي نجيح, عن مجاهد ( وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ ) قال: الهمزة يأكل لحوم الناس, واللمزة: الطعان.وقد رُوي عن مجاهد خلاف هذا القول, وهو ما حدثنا به أبو كُرَيب, قال: ثنا وكيع, عن سفيان, عن ابن أبي نجيح, عن مجاهد ( وَيْلٌ لِكُلِّ هُمَزَةٍ ) قال: الهمزة: الطعان, واللمزة: الذي يأكل لحوم الناس.حدثنا مسروق بن أبان الحطاب, قال: ثنا وكيع, قال: ثنا سفيان, عن ابن أبي نجيح, عن مجاهد, مثله.ورُوي عنه أيضا خلاف هذين القولين, وهو ما حدثنا به ابن بشار, قال: ثنا يحيى, قال: ثنا سفيان, عن ابن أبي نجيح, عن مجاهد ( وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ ) قال: أحدهما الذي يأكل لحوم الناس, والآخر الطعان. وهذا يدلّ على أن الذي حدث بهذا الحديث قد كان أشكل عليه تأويل الكلمتين, فلذلك اختلف نقل الرواة عنه فيما رووا على ما ذكرت.حدثنا بشر, قال: ثنا يزيد, قال: ثنا سعيد, عن قتادة ( وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ ) أما الهمزة: فأكل لحوم الناس, وأما اللمزة: فالطعان عليهم.حدثنا ابن حميد, قال: ثنا مهران, عن سعيد بن أبي عروبة, عن قتادة, قال: الهمزة: آكل لحوم الناس: واللمزة: الطعان عليهم.حدثنا ابن حميد, قال: ثنا مهران, عن سفيان, عن ابن خثيم, عن سعيد بن جبير, عن ابن عباس: ( وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ ) قال: ويل لكلّ طعان مغتاب.حدثنا ابن حميد, قال: ثنا مهران, عن أبي جعفر, عن الربيع, عن أبي العالية, قال: الهمزة: يهمزه في وجهه, واللمزة: من خلفه.حدثنا ابن عبد الأعلى, قال: ثنا ابن ثور, عن معمر, عن قتادة, قال: يهمزه ويلمزه بلسانه وعينه, ويأكل لحوم الناس, ويطعن عليهم.حدثني الحارث, قال: ثنا الحسن, قال: ثنا ورقاء، جميعا, عن ابن أبي نجيح, عن مجاهد, قال: الهمزة باليد, واللمزة باللسان.وقال آخرون في ذلك ما حدثني به يونس, قال: أخبرنا ابن وهب, قال: قال ابن زيد, في قول الله: ( وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ ) قال: الهمزة: الذي يهمز الناس بيده, ويضربهم بلسانه, واللمزة: الذي يلمزهم بلسانه ويعيبهم.واختلف في المعنى بقوله: ( وَيْلٌ لِكُلِّ هُمَزَةٍ ) فقال بعضهم: عني بذلك: رجل من أهل الشرك بعينه, فقال بعض من قال هذا القول: هو جميل بن عامر الجُمَحِيّ. وقال آخرون منهم: هو الأخنس بن شريق.* ذكر من قال: عُنِي به مشرك بعينه.حدثني محمد بن سعد, قال: ثني أبي, قال: ثني عمي, قال: ثني أبي, عن أبيه, عن ابن عباس, قوله: ( وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ ) قال: مشرك كان يلمز الناس ويهمزهم.حدثني محمد بن عمرو, قال: ثنا أبو عاصم, قال: ثنا عيسى, وحدثني الحارث, قال: ثنا الحسن, قال: ثنا ورقاء، جميعا عن ابن أبي نجيح, عن رجل من أهل الرقة قال: نـزلت في جميل بن عامر الجمحي.حدثني الحارث, قال: ثنا الحسن, قال: ثنا ورقاء, في قوله ( هُمَزَةٍ لُمَزَةٍ ) قال: ليست بخاصة لأحد, نـزلت في جميع بني عامر; قال ورقاء: زعم الرقاشي.وقال بعض أهل العربية: هذا من نوع ما تذكر العرب اسم الشيء العام, وهي تقصد به الواحد, كما يقال في الكلام, إذا قال رجل لأحد: لا أزورك أبدا: كل من لم يزرني, فلست بزائره, وقائل ذلك يقصد جواب صاحبه القائل له: لا أزورك أبدا.وقال آخرون: بل معنيّ به, كل من كانت هذه الصفة صفته, ولم يقصد به قصد آخر.* ذكر من قال ذلك:حدثني محمد بن عمرو. قال: ثنا أبو عاصم, قاله: ثنا عيسى; وحدثني الحارث, قال: ثنا الحسن, قال: ثنا ورقاء، جميعا عن ابن أبي نجيح, عن مجاهد, في قول الله: ( وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ ) قال: ليست بخاصة لأحد.والصواب من القول في ذلك: أن يقال: إن الله عمّ بالقول كلّ همزة لمزة, كلّ من كان بالصفة التي وصف هذا الموصوف بها, سبيله سبيله كائنا من كان من الناس."
      },
      {
        "resource_id": 90,
        "text": "تفسير سورة الهمزة مكية بإجماع . وهي تسع آياتبسم الله الرحمن الرحيمويل لكل همزة لمزةقد تقدم القول في الويل في غير موضع ، ومعناه الخزي والعذاب والهلكة . وقيل : واد في جهنم . لكل همزة لمزة قال ابن عباس : هم المشاءون بالنميمة ، المفسدون بين الأحبة ، الباغون للبرآء العيب ; فعلى هذا هما بمعنى . وقال النبي - صلى الله عليه وسلم - : شرار عباد الله تعالى المشاءون بالنميمة ، المفسدون بين الأحبة ، الباغون للبرآء العيب . وعن ابن عباس أن الهمزة : الذي يغتاب واللمزة : العياب . وقال أبو العالية والحسن ومجاهد وعطاء بن أبي رباح : الهمزة : الذي يغتاب ويطعن في وجه الرجل ، واللمزة : الذي يغتابه من خلفه إذا غاب ; ومنه قول حسان :همزتك فاختضعت بذل نفس بقافية تأجج كالشواظواختار هذا القول النحاس ، قال : ومنه قوله تعالى ومنهم من يلمزك في الصدقات . وقال مقاتل ضد هذا الكلام : إن الهمزة : الذي يغتاب بالغيبة ، واللمزة : الذي يغتاب في الوجه . وقال قتادة ومجاهد : الهمزة : الطعان في الناس ، واللمزة : الطعان في [ ص: 164 ] أنسابهم . وقال ابن زيد : الهامز : الذي يهمز الناس بيده ويضربهم ، واللمزة : الذي يلمزهم بلسانه ويعيبهم . وقال سفيان الثوري يهمز بلسانه ، ويلمز بعينيه . وقال ابن كيسان : الهمزة الذي يؤذي جلساءه بسوء اللفظ ، واللمزة : الذي يكسر عينه على جليسه ، ويشير بعينه ورأسه وبحاجبيه . وقال مرة : هما سواء ; وهو القتات الطعان للمرء إذا غاب . وقال زياد الأعجم :تدلي بودي إذا لاقيتني كذبا     وإن أغيب فأنت الهامز اللمزهوقال آخر :إذا لقيتك عن سخط تكاشرني     وإن تغيبت كنت الهامز اللمزهالسخط : البعد . والهمزة : اسم وضع للمبالغة في هذا المعنى ; كما يقال : سخرة وضحكة : للذي يسخر ويضحك بالناس . وقرأ أبو جعفر محمد بن علي والأعرج همزة لمزة بسكون الميم فيهما . فإن صح ذلك عنهما ، فهي في معنى المفعول ، وهو الذي يتعرض للناس حتى يهمزوه ويضحكوا منه ، ويحملهم على الاغتياب . وقرأ عبد الله بن مسعود وأبو وائل والنخعي والأعمش : ويل للهمزة اللمزة . وأصل الهمز : الكسر ، والعض على الشيء بعنف ; ومنه همز الحرف . ويقال : همزت رأسه . وهمزت الجوز بكفي كسرته . وقيل لأعرابي : أتهمزون ( الفارة ) ؟ فقال : إنما تهمزها الهرة . الذي في الصحاح : وقيل لأعرابي أتهمز الفارة ؟ فقال السنور يهمزها . والأول قاله الثعلبي ، وهو يدل على أن الهر يسمى الهمزة . قال العجاج :ومن همزنا رأسه تهشماوقيل : أصل الهمز واللمز : الدفع والضرب . لمزه يلمزه لمزا : إذا ضربه ودفعه . وكذلك همزه : أي دفعه وضربه . قال الراجز :ومن همزنا عزه تبركعا     على استه زوبعة أو زوبعاالبركعة : القيام على أربع . وبركعه فتبركع ; أي صرعه فوقع على استه ; قاله في الصحاح . والآية نزلت في الأخنس بن شريق ، فيما روى الضحاك عن ابن عباس . وكان يلمز الناس ويعيبهم : مقبلين ومدبرين . وقال ابن جريج : في الوليد بن المغيرة ، وكان يغتاب النبي - صلى الله عليه وسلم - من ورائه ، ويقدح فيه في وجهه . وقيل : نزلت في أبي بن خلف . وقيل : في جميل بن عامر الثقفي . وقيل : إنها مرسلة على العموم من غير تخصيص ; وهو قول الأكثرين . قال مجاهد : ليست بخاصة لأحد ، بل لكل من كانت هذه صفته . وقال الفراء : يجوز أن يذكر [ ص: 165 ] الشيء العام ويقصد به الخاص ، قصد الواحد إذا قال : لا أزورك أبدا . فتقول : من لم يزرني فلست بزائره ; يعني ذلك القائل ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 169,
        "text": "<h2>Which was revealed in Makkah</h2><div class=\"arabic uthmani\">بِسْمِ اللَّهِ الرَّحْمَـنِ الرَّحِيمِ </div><p>In the Name of Allah, the Most Gracious, the Most Merciful.</p><div class=\"arabic uthmani\">هَمَّازٍ مَّشَّآءِ بِنَمِيمٍ </div><p>(Hammaz, going about with slander) (68:11) Ibn `Abbas said, \"Humazah Lumazah means one who reviles and disgraces (others).\" Mujahid said, \"Al-Humazah is with the hand and the eye, and Al-Lumazah is with the tongue.\" Then Allah says,</p><div class=\"arabic uthmani\">الَّذِى جَمَعَ مَالاً وَعَدَّدَهُ </div><p>(Who has gathered wealth and counted it.) meaning, he gathers it piling some of it on top of the rest and he counts it up. This is similar to Allah's saying,</p><div class=\"arabic uthmani\">وَجَمَعَ فَأَوْعَى </div><p>(And collect (wealth) and hide it.) (70:18) This was said by As-Suddi and Ibn Jarir. Muhammad bin Ka`b said concerning Allah's statement,</p><div class=\"arabic uthmani\">جَمَعَ مَالاً وَعَدَّدَهُ</div><p>(gathered wealth and counted it.) \"His wealth occupies his time in the day, going from this to that. Then when the night comes he sleeps like a rotting corpse.\" Then Allah says,</p><div class=\"arabic uthmani\">يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ </div><p>(He thinks that his wealth will make him last forever!) meaning, he thinks that gathering wealth will make him last forever in this abode (the worldly life).</p><div class=\"arabic uthmani\">كَلاَّ</div><p>(But no!) meaning, the matter is not as he claims, nor as he reckons. Then Allah says,</p><div class=\"arabic uthmani\">لَيُنبَذَنَّ فِى الْحُطَمَةِ</div><p>(Verily, he will be thrown into Al-Hutamah.) meaning, the person who gathered wealth and counted it, will be thrown into Al-Hutamah, which is one of the descriptive names of the Hellfire. This is because it crushes whoever is in it. Thus, Allah says,</p><div class=\"arabic uthmani\">وَمَآ أَدْرَاكَ مَا الْحُطَمَةُ - نَارُ اللَّهِ الْمُوقَدَةُ - الَّتِى تَطَّلِعُ عَلَى الاٌّفْئِدَةِ </div><p>(And what will make you know what Al-Hutamah is The fire of Allah, Al-Muqadah, which leaps up over the hearts.) Thabit Al-Bunani said, \"It will burn them all the way to their hearts while they are still alive.\" Then he said, \"Indeed the torment will reach them.\" Then he cried. Muhammad bin Ka`b said, \"It (the Fire) will devour every part of his body until it reaches his heart and comes to the level of his throat, then it will return to his body.\"</p><h2>Concerning Allah's statement,</h2><div class=\"arabic uthmani\">إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌ </div><p>(Verily, it shall Mu'sadah upon them.) meaning, covering, just as was mentioned in the Tafsir of Surat Al-Balad (see 90:20). Then Allah says,</p><div class=\"arabic uthmani\">فِى عَمَدٍ مُّمَدَّدَةِ </div><p>(In pillars stretched forth. ) \"Atiyah Al-`Awfi said, \"Pillars of Iron.\" As-Suddi said, \"Made of fire.\" Al-`Awfi reported from Ibn `Abbas, \"He will make them enter pillars stretched forth, meaning there will be columns over them, and they will have chains on their necks, and the gates (of Hell) will be shut upon them.\" This is the end of the Tafsir of Surat Al-Humazah, and all praise and thanks are due to Allah.</p>"
      },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 94,
        "text": "مكية( ويل لكل همزة لمزة ) قال ابن عباس : هم المشاءون بالنميمة ، المفرقون بين الأحبة ، الباغون للبرآء العيب ، ومعناهما واحد وهو العياب .وقال مقاتل : \" الهمزة \" : الذي يعيبك في الغيب ، و \" اللمزة \" : الذي يعيبك في الوجه . وقال أبو العالية والحسن بضده .وقال سعيد بن جبير ، وقتادة : \" الهمزة \" الذي يأكل لحوم الناس ويغتابهم ، و \" اللمزة \" : الطعان عليهم .وقال ابن زيد : \" الهمزة \" الذي يهمز الناس بيده ويضربهم ، و \" اللمزة \" : الذي يلمزهم بلسانه ويعيبهم .وقال سفيان الثوري : ويهمز بلسانه ويلمز بعينه . ومثله قال ابن كيسان : \" الهمزة \" الذي يؤذي جليسه بسوء اللفظ و \" اللمزة \" الذي يومض بعينه ويشير برأسه ، ويرمز بحاجبه وهما نعتان للفاعل ، نحو سخرة وضحكة : للذي يسخر ويضحك من الناس [ والهمزة واللمزة ، ساكنة الميم ، الذي يفعل ذلك به ] .وأصل الهمز : الكسر والعض على الشيء بالعنف .واختلفوا فيمن نزلت هذه الآية ؟ قال الكلبي : نزلت في الأخنس بن شريق بن وهب الثقفي كان يقع في الناس ويغتابهم .وقال محمد بن إسحاق : ما زلنا نسمع أن سورة الهمزة [ نزلت في أمية بن خلف الجمحي ] .وقال مقاتل : نزلت في الوليد بن المغيرة ، كان يغتاب النبي - صلى الله عليه وسلم - من ورائه ويطعن عليه في وجهه .وقال مجاهد : هي عامة في حق كل من هذه صفته ."
      },
      { "resource_id": 16, "text": "شر وهلاك لكل مغتاب للناس، طعان فيهم." },
      {
        "resource_id": 14,
        "text": "الهماز بالقول واللماز بالفعل يعني يزدري الناس وينتقص بهم وقد تقدم بيان ذلك في قوله تعالى \"هماز مشاء بنميم\" قال ابن عباس همزة لمزة طعان معياب. وقال الربيع بن أنس الهمزة يهمزه في وجهه واللمزة من خلفه. وقال قتادة الهمزة واللمزة لسانه وعينه ويأكل لحوم الناس ويطعن عليهم. وقال مجاهد الهمزة باليد والعين واللمزة باللسان وهكذا قال ابن زيد. وقال مالك عن زيد بن أسلم همزة لحوم الناس ثم قال بعضهم المراد بذلك الأخنس بن شريق وقيل غيره وقال مجاهد هي عامة."
      },
      {
        "resource_id": 91,
        "text": "{ وَيْلٌ } أي: وعيد، ووبال، وشدة عذاب { لِكُلِّ هُمَزَةٍ لُمَزَةٍ } الذي يهمز الناس بفعله، ويلمزهم بقوله، فالهماز: الذي يعيب الناس، ويطعن عليهم بالإشارة والفعل، واللماز: الذي يعيبهم بقوله."
      },
      {
        "resource_id": 92,
        "text": "وَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ (1) { بالصبر } { أَخْلَدَهُ } .كلمة ( ويل له ) دُعاء على المجرور اسمُه باللام بأن يناله الويل وهو سوء الحال كما تقدم غير مرة منها قوله تعالى : { فويل للذين يكتبون الكتاب بأيديهم ثم يقولون هذا من عند اللَّه } في سورة البقرة ( 79 ) .والدعاء هنا مستعمل في الوعيد بالعقاب .وكلمة ( كُلّ ) تشعر بأن المهددين بهذا الوعيد جماعة وهم الذين اتخذوا همز المسلمين ولمزهم ديدناً لهم أولئك الذين تقدم ذكرهم في سبب نزول السورة .وهُمَزَة ولُمزة : بوزن فُعَلَة صيغة تدل على كثرة صدور الفعل المصاغ منه . وأنه صار عادة لصاحبه كقولهم : ضُحَكَة لكثير الضحك ، ولُعَنَة لكثير اللعن ، وأصلها : أن صيغة فُعَل بضم ففتح ترد للمبالغة في فَاعل كما صرح به الرضيّ في شرح الكافية } يقال : رجل حُطَم إذا كان قليل الرحمة للماشية ، أي والدواب .ومنه قولهم : خُتع ( بخاء معجمة ومثناة فوقية ) وهو الدليل الماهر بالدلالة على الطريق فإذا أريدت زيادة المبالغة في الوصف أُلحق به الهاء كما أُلحقت في : علاّمة ورحَّالة ، فيقولون : رجل حُطمة وضُحكة ومنه هُمزة ، وبتلك المبالغة الثانية يفيد أن ذلك تفاقم منه حتى صار له عادة قد ضري بها كما في «الكشاف» ، وقد قالوا : إن عُيَبَة مساوٍ لعيابة ، فمن الأمثلة ما سمع فيه الوصف بصيغتي فُعَل وفُعَلَة نحو حُطم وحطمة بدون هاء وبهاء ، ومن الأمثلة ما سمع فيه فُعلة دون فُعل نحو رجل ضُحَكة ، ومن الأمثلة ما سمع فيه فُعَل دون فُعَلَة وذلك في الشتم مع حرف النداء يا غُدَر ويا فُسق ويا خُبَث ويا لُكع .قال المرادي في «شرح التسهيل» قال : بعضهم ولم يسمع غيرها ولا يقاس عليها ، وعن سيبويه أنه أجاز القياس عليها في النداء اه . قلت : وعلى قول سيبويه بنى الحريري قوله في «المقامة السابعة والثلاثين» : «صَهْ يا عُقَق ، يا من هو الشّجَا والشَرَق» .وهُمزة : وصف مشتق من الهَمز . وهو أن يعيب أحدٌ أحداً بالإِشارة بالعين أو بالشِّدق أو بالرأس بحضرته أو عند توليه ، ويقال : هَامز وهمَّاز ، وصيغة فُعلة يدل على تمكن الوصف من الموصوف .ووقع { همزة } وصفاً لمحذوف تقديره : ويل لكل شَخْص هُمزة ، فلما حذف موصُوفه صار الوصف قائماً مقامه فأضيف إليه ( كُلّ ) .ولمزة : وصف مشتق من اللمز وهو المواجعة بالعيب ، وصيغته دالة على أن ذلك الوصف ملكة لصاحبه كما في هُمزة .وهذان الوصفان من معاملة أهل الشرك للمؤمنين يومئذ ، ومَن عامَلَ من المسلمين أحداً من أهل دينه بمثل ذلك كان له نصيب من هذا الوعيد .فمن اتصف بشيء من هذا الخُلق الذميم من المسلمين مع أهل دينه فإنها خصلة من خصال أهل الشرك . وهي ذميمة تدخل في أذى المسلم وله مراتب كثيرة بحسب قوة الأذى وتكرره ولم يُعد من الكبائر إلا ضربُ المسلم .وسبُّ الصحابة رضي الله عنهم وإدمان هذا الأذى بأن يتخذه ديدناً فهو راجع إلى إدمان الصغائر وهو معدود من الكبائر ."
      },
      {
        "resource_id": 93,
        "text": "الويل : لفظ يدل على الذم وعلى طلب العذاب والهلكة . . وقيل : اسم لواد فى جهنم .والهُمَزة من الهَمْز ، بمعنى الطعن فى أعراض الناس ، ورميهم بما يؤذيهم . .واللُّمَزة من اللمز ، بمعنى السخرية من الغير ، عن طريق الإِشارة باليد أو العين أو غيرهما .قال الجمل : الهمزة واللمزة : هم المشاؤون بالنميمة ، المفرقون بين الأحبة الباغون العيب للبرئ ، فعلى هذا هما بمعنى واحد .وقيل : الهمزة الذى يعيبك فى الغيب ، واللمزة الذى يعيبك فى الوجه وقيل : العكس .وحاصل هذه الأقوال يرجع إلى أصل واحد ، وهو الطعن وإظهار العيب ، ويدخل فى ذلك من يحاكى الناس فى أقوالهم وأفعالهم وأصواتهم ليضحكوا منه . .ولفظ \" ويل \" مبتدأ وساغ الابتداء مع كونه نكرة ، لأنه دعاء عليهم ، وقوله : ( لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ ) خبره ، وهمزة ولمزة وصفان لموصوف محذوف .أى : عذاب شديد ، وخزى عظيم ، لكل من يطعن فى أعراض الناس ، ويغض من شأنهم ، ويحقر أعمالهم وصفاتهم ، وينسب إليهم ما هم برآء منه من عيوب .والتعبير بقوله : ( هُمَزَةٍ لُّمَزَةٍ ) يدل على أن تلك الصفات القبيحة ، كانت عادة متأصلة فيهم ، لأن اللفظ الذى بزنة فُعَلَة - بضم الفاء وفتح العين - يؤتى به للدلالة على أن الموصوف به ديدنه ودأبه الإِتيان بهذا الوصف ، ومنه قولهم : فلان ضُحَكة : إذا كان يكثر من الضحك .كما أن لفظ \" فُعْلَة \" - بضم الفاء وسكون العين - يؤتى به للدلالة على أن الموصوف به ، يكثر أن يفعل به ذلك ، ومنه قولهم : فلان ضُحْكة ، إذا كان الناس يكثرون الضحك منه ."
      },
      {
        "resource_id": 165,
        "text": "<p>দুর্ভোগ প্রত্যেকের, যে পশ্চাতে ও সম্মুখে লোকের নিন্দা করে। [১]</p><p>[১] কিছু উলামা هُمَزَة ও لُمَزَة এর একই অর্থ বলেছেন। আর কিছু সংখ্যক উলামা উভয়ের মাঝে কিছুটা পার্থক্য করে বলেন, هُمَزَة বলা হয় সেই ব্যক্তিকে, যে সামনা-সামনি নিন্দা গায়। আর لُمَزَة বলা হয় সেই ব্যক্তিকে, যে পশ্চাতে গীবত (পরর্চ্চা) করে। আবার কেউ এর বিপরীত অর্থ করেন। অনেকের মতে هَمز চোখ ও হাতের ইশারায় নিন্দা প্রকাশ করা এবং لَمز জিহ্বা দ্বারা পরনিন্দা করাকে বলা হয়।</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>দুর্ভোগ প্রত্যেকের, যে পিছনে ও সামনে লোকের নিন্দা করে [১] ,</p><p>[১] আয়াতে ‘হুমাযাহ’ ও ‘লুমাযাহ’ দু’টি শব্দ ব্যবহার করা হয়েছে। অধিকাংশ তাফসীরকারের মতে همز এর অর্থ গীবত অর্থাৎ পশ্চাতে পরনিন্দা করা এবং لمز এর অর্থ সামনাসামনি দোষারোপ করা ও মন্দ বলা। এ দুটি কাজই জঘন্য গোনাহ। [আদ্ওয়াউল বায়ান]। তাফসীরকারগণ এ শব্দ দু’টির আরও অর্থ বর্ণনা করেছেন। তাদের বর্ণিত তাফসীর অনুসারে উভয় শব্দ মিলে এখানে যে অর্থ দাঁড়ায় তা হচ্ছে: সে কাউকে লাঞ্ছিত ও তুচ্ছ তাচ্ছিল্য করে। কারোর প্রতি তাচ্ছিল্য ভরে অংগুলি নির্দেশ করে। চোখের ইশারায় কাউকে ব্যঙ্গ করে কারো বংশের নিন্দা করে। কারো ব্যক্তি সত্তার বিরূপ সমালোচনা করে। কারো মুখের ওপর তার বিরুদ্ধে মন্তব্য করে। কারো পেছনে তার দোষ বলে বেড়ায়। কোথাও এর কথা ওর কানে লাগিয়ে বন্ধুদেরকে পরস্পরের বিরুদ্ধে লেলিয়ে দেয়। কোথাও ভাইদের পারস্পরিক ঐক্যে ফাটল ধরায়। কোথাও লোকদের নাম বিকৃত করে খারাপ নামে অভিহিত করে। কোথাও কথার খোঁচায় কাউকে আহত করে এবং কাউকে দোষারোপ করে। এসব তার অভ্যাসে পরিণত হয়েছে। অথচ এসবই মারাত্মক গোনাহ। [পশ্চাতে পরনিন্দার শাস্তির কথা কুরআন ও হাদীসে বর্ণিত হয়েছে। এর কারণ এরূপ হতে পারে যে, এ গোনাহে মশগুল হওয়ার পথে সামনে কোন বাধা থাকে না। যে এতে মশগুল হয়, সে কেবল এগিয়েই চলে। ফলে গোনাহ বৃহৎ থেকে বৃহত্তর ও অধিকতর হতে থাকে। সম্মুখের নিন্দা এরূপ নয়। এতে প্রতিপক্ষও বাধাদিতে প্রস্তুত থাকে। ফলে গোনাহ দীর্ঘ হয় না। এছাড়া কারও পশ্চাতে নিন্দা করা এ কারণেও বড় অন্যায় যে, সংশ্লিষ্ট ব্যক্তি জানতেও পারে না যে, তার বিরুদ্ধে কি অভিযোগ উত্থাপন করা হচ্ছে। ফলে সে সাফাই পেশ করার সুযোগ পায় না। আবার একদিক দিয়ে لمز তথা সম্মুখের নিন্দা গুরুতর। যার মুখোমুখি নিন্দা করা হয়, তাকে অপমানিত ও লাঞ্ছিত করা হয়। এর কষ্টও বেশি, ফলে শাস্তি ও গুরুতর। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, “আল্লাহ্র বান্দাদের মধ্যে নিকৃষ্টতম তারা, যারা পরোক্ষ নিন্দা করে, বন্ধুদের মধ্যে বিচ্ছেদ সৃষ্টি করে এবং নিরপরাধ লোকদের দোষ খুঁজে ফিরে।” [মুসনাদে আহমাদ: ৪/২২৭] [দেখুন, কুরতুবী]</p>"
      },
      {
        "resource_id": 160,
        "text": "<p>وزنی بیڑیاں اور قید و بند کو یاد رکھو :اللہ تعالیٰ فرماتا ہے زبان سے لوگوں کی عیب گیری کرنے والا اپنے کاموں سے دوسروں کی حقارت کرنے والا، خرابی والا شخص ہے۔ ھماز مشآء بنمیم کی تفسیر بیان ہوچکی ہے حضرت ابن عباس کا قول ہے کہ اس سے مراد طعنہ دینے والا غیبت کرنے والا ہے ربیع بن انس کہتے ہیں سامنے برا کہنا تو ہمز ہے اور پیٹھ پیچھے عیب بیان کرنا لمز ہے۔ قتادہ کہتے ہیں زبان سے اور آنکھ کے اشاروں سے بندگان اللہ کو ستنا اور چڑانا مراد ہے کہ کبھی تو ان کا گوشت کھائے یعنی غیب کرے اور کبھی ان پر طعنہ زنی کرے مجاہد فرماتے ہیں ہمز ہاتھ اور آنکھ سے ہوتا ہے اور لمز زبان سے بعض کہتے ہیں اس سے مراد اخنس بن شریف کافر ہے مجاہد فرماتے ہیں آیت عام ہے پھر فرمایا جو جمع کرتا ہے اور گن گن کر رکھتا جاتا ہے جیسے اور جگہ ہے جمع فاوعیٰ حضرت کعب فرماتے ہیں دن بھر تو مال کمانے کی ہائے وائے میں لگا رہا اور رات کو سڑی بھسی لاش کی طرح پڑ رہا اس کا خیال یہ ہے کہ اس کا مال اسے ہمیشہ دنیا میں رکھے گا حالانکہ واقعہ یوں نہیں بلکہ یہ بخیل اور لالچی انسان جہنم کے اس طبقے میں گے گا جو ہر اس چیز کو جو اس میں گرے چور چور کردیتا ہے پھر فرماتا ہے یہ توڑ پھوڑ کرنے والی کیا چیز ہے ؟ اس کا حال اے نبی ﷺ تمہیں معلوم نہیں یہ اللہ کی سلگائی ہوئی آگ ہے جو دلوں پر چڑھ جاتی ہے جلا کر بھسم کردیتی ہے لیکن مرتے نہیں حضرت ثابت بنائی جب اس آیت کی تلاوت کر کے اس کا یہ معنی بیان کرتے تو رو دیتے اور کہتے انہیں عذاب نے بڑا ستایا محمد بن کعب فرماتے ہیں آگ جلاتی ہوئی حلق تک پہنچ جاتی ہے پھر لوٹتی پھر پہنچی ہے یہ آگ ان پر چاروں طرف سے بند کردی گئی ہے جیسے کہ سورة بلد کی تفسیر میں گذرا۔ ایک مرفوع حدیث میں بھی ہے اور دوسرا طریق اس کا موقوف ہے لوہا جو مثل آگ کے ہے اس کے ستونوں میں بہ لمبے لمبے دروازے ہیں حضرت عبداللہ بن مسعود کی قرأت میں بعمد مروی ہے ان دوزخیوں کیگ ردنوں میں زنجیریں ہوگی یہ لمبے لمبے ستونوں میں جکڑے ہوئے ہوں گے اور اوپر سے دروازے بند کر دئیے جائیں گے ان آگ کے ستونوں میں انہیں بدترین عذاب کیے جائیں گے ابو صالح فرماتے ہیں یعنی وزنی بیڑیاں اور قیدوبند ان کے لیے ہوں گی اس سورت کی تفسیر بھی اللہ کے فضل و کرم سے پوری ہوئی فالحمداللہ۔</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 1{ وَیْلٌ لِّکُلِّ ہُمَزَۃٍ لُّمَزَۃِ۔ } ”بڑی خرابی ہے ہر اس شخص کے لیے جو لوگوں کے عیب ُ چنتا رہتا ہے اور طعنے دیتا رہتا ہے۔“ ہُمَزَۃ اور لُمَزَۃ دونوں الفاظ معنی کے اعتبار سے باہم بہت قریب ہیں۔ بعض اہل لغت کے نزدیک روبرو طعنہ زنی کرنے والے کو ہُمَزَۃ اور پس پشت عیب جوئی کرنے والے کو لُمَزَۃ کہتے ہیں ‘ جبکہ بعض اہل لغت نے ان کا معنی برعکس بیان کیا ہے۔ حضرت عبداللہ بن عباس - کا قول ہے کہ ہر چغلی کھانے والے ‘ دوستوں میں جدائی اور تفرقہ ڈالنے والے ‘ بےقصور اور بےعیب انسانوں میں نقص نکالنے والے کو ہُمَزَۃ اور لُمَزَۃ کہتے ہیں۔</p>"
      }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 2,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 170, "text": "" },
      { "resource_id": 16, "text": "الذي كان همُّه جمع المال وتعداده." },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - : ( الذى جَمَعَ مَالاً وَعَدَّدَهُ ) زيادة تشنيع وتقبيح للهمزة اللمزة . .ومعنى \" عدده \" : جعله عدته وذخيرته ، وأكثر من عده وإحصائه لحرصه عليه ، والجملة الكريمة فى محل نصب على الذم .أى : عذاب وهلاك لكل إنسان مكثر من الطعن فى أعراض الناس ، ومن صفاته الذميمة أنه فعل ذلك بسبب أنه جمع مالا كثيرا ، وأنفق الأوقات الطويلة فى عده مرة بعد أخرى ، حبا له وشغفا به وتوهما منه أن هذا المال الكثير هو مناط التفاضل بين الناس .وقرأ ابن عامر وحمزة والكسائى ( جمَّع ) - بتشديد الميم - وهو مبالغة فى ( جمع ) بتخفيف الميم ."
      },
      {
        "resource_id": 92,
        "text": "الَّذِي جَمَعَ مَالًا وَعَدَّدَهُ (2) وأتبع { الذي جمع مالاً وعدده } لزيادة تشنيع صفتيه الذميمتين بصفة الحرص على المال . وإنما ينشأ ذلك عن بخل النفس والتخوف من الفقر ، والمقصود من ذلك دخول أولئك الذين عُرفوا بهمز المسلمين ولمزهم الذين قيل إنهم سبب نزول السورة لتعيينهم في هذا الوعيد .واسم الموصول من قوله : { الذي جمع مالاً } نعت آخر ولم يعطف { الذي } بالواو لأن ذكر الأوصاف المتعددة للموصوف الواحد يجوز أن يكون بدون عطف نحو قوله تعالى : { ولا تطع كل حلاف مهين هماز مشاء بنميم مناع للخير معتد أثيم عتل بعد ذلك زنيم } [ القلم : 10 13 ] .والمال : مكاسب الإِنسان التي تنفعه وتكفي مؤونة حاجته من طعام ولباس وما يتخذ منه ذلك كالأنعام والأشجار ذات الثمار المثمرة . وقد غلب لفظ المال في كل قوم من العرب على ما هو الكثير من مشمولاتهم فغلب اسم المال بين أهل الخيام على الإِبل قال زهير: ... فكُلاّ أراهم أصبحوا يعقلونهصحيحاتتِ مال طالعات بمخرم ... يريد إبل الدية ولذلك قال : طالعات بمخرم .وهو عند أهل القرى الذين يتخذون الحوائط يغلب على النخل يقولون خرج فلان إلى مَاله ، أي إلى جناته ، وفي كلام أبي هريرة : \" وإن أخواني الأنصار شغلهم العمل في أموالهم \" وقال أبو طلحة : «وإن أحب أموالي إليَّ بئرُ حاء» .وغلب عند أهل مكة على الدراهم لأن أهل مكة أهل تجر ومن ذلك قول النبي صلى الله عليه وسلم للعباس : \" أينَ المال الذي عند أم الفضل \" .وتقدم في قوله تعالى : { لن تنالوا البر حتى تنفقوا مما تحبون } سورة آل عمران ( 92 ) .ومعنى : عدده } أكْثر من عدِّه ، أي حسابه لشدة ولعه بجمعه فالتضعيف للمبالغة في ( عدَّ ) ومعاودته .وقرأ الجمهور { جمع مالاً } بتخفيف الميم ، وقرأه ابن عامر وحمزة والكسائي وأبو جعفر ورويس عن يعقوب وخلفٌ بتشديد الميم مزاوجاً لقوله : { عدده } وهو مبالغة في { جمع } . وعلى قراءة الجمهور دل تضعيف { عدده } على معنى تكلف جمعه بطريق الكناية لأنه لا يكرر عده إلا ليزيد جمعه .ويجوز أن يكون { عدده } بمعنى أكثر إعداده ، أي إعداد أنواعه فيكون كقوله تعالى : { والقناطير المقنطرة من الذهب والفضة والخيل المسومة والأنعام والحرث } [ آل عمران : 14 ] ."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( الَّذِي جَمَعَ مَالا وَعَدَّدَهُ )يقول: الذي جمع مالا وأحصى عدده, ولم ينفقه في سبيل الله, ولم يؤد حق الله فيه, ولكنه جمعه فأوعاه وحفظه.واختلفت القرّاء في قراءة ذلك, فقرأه من قرّاء أهل المدينة أبو جعفر, وعامة قرّاء الكوفة سوى عاصم: \" جَمَّعَ\" بالتشديد, وقرأ ذلك عامة قرّاء المدينة والحجاز, سوى أبي جعفر وعامة قرّاء البصرة, ومن الكوفة عاصم, \" جَمَعَ\" بالتخفيف, وكلهم مجمعون على تشديد الدال من ( وَعَدَّدَهُ ) على الوجه الذي ذكرت من تأويله. وقد ذكر عن بعض المتقدمين بإسناد غير ثابت, أنه قرأه: \" جَمَعَ مَالا وَعَدَدَهُ\" تخفيف الدال, بمعنى: جمع مالا وجمع عشيرته وعدده. هذه قراءة لا أستجيز القراءة بها, بخلافها قراءة الأمصار, وخروجها عما عليه الحجة مجمعة في ذلك.وأما قوله: ( جَمَعَ مَالا ) فإن التشديد والتخفيف فيهما صوابان, لأنهما قراءتان معروفتان في قراءة الأمصار, متقاربتا المعنى, فبأيتهما قرأ القارئ فمصيب."
      },
      {
        "resource_id": 91,
        "text": "ومن صفة هذا الهماز اللماز، أنه لا هم له سوى جمع المال وتعديده والغبطة به، وليس له رغبة في إنفاقه في طرق الخيرات وصلة الأرحام، ونحو ذلك،"
      },
      {
        "resource_id": 166,
        "text": "<p>যে সম্পদ জমায় ও তা বার বার গণনা করে [১] ;</p><p>[১] অর্থাৎ নিজের অগাধ ধনদৌলতের অহংকারে সে মানুষকে এভাবে লাঞ্ছিত ও অপমানিত করে। যেসব বদভ্যাসের কারণে আয়াতে শাস্তির কথা উচ্চারণ করা হয়েছে, তন্মধ্যে এটি হচ্ছে তৃতীয়। যার মূল কথা হচ্ছে অর্থালিপ্সা। আয়াতে একে এভাবে ব্যক্ত করা হয়েছে—অর্থালিপ্সার কারণে সে তা বার বার গণনা করে। গুণে গুণে রাখা বাক্য থেকে সংশ্লিষ্ট ব্যক্তির কার্পণ্য ও অর্থ লালসার ছবি চোখের সামনে ভেসে ওঠে। তবে অন্যান্য আয়াত ও হাদীস সাক্ষ্য দেয় যে, অর্থ সঞ্চয় করা সর্বাবস্থায় হারাম ও গোনাহ নয়। তাই এখানেও উদ্দেশ্য সেই সঞ্চয় হবে, যাতে জরুরি হক আদায় করা হয় না, কিংবা গর্ব ও অহমিকা লক্ষ্য হয় কিংবা লালসার কারণে দ্বীনের জরুরি কাজ বিঘ্নিত হয়। [আদ্ওয়াউল বায়ান]</p>"
      },
      {
        "resource_id": 14,
        "text": "قوله تعالى \"الذي جمع مالا وعدده\" أي جمعه بعضه على بعض وأحصى عدده كقوله تعالى \"وجمع فأوعى\" قاله السدي وابن جرير وقال محمد بن كعب في قوله \"جمع مالا وعدده\" ألهاه ماله بالنهار هذا إلى هذا فإذا كان الليل نام كأنه جيفة منتنة."
      },
      {
        "resource_id": 94,
        "text": "ثم وصفه فقال : ( الذي جمع مالا ) قرأ أبو جعفر ، وابن عامر ، وحمزة ، والكسائي : \" جمع \" بتشديد الميم على التكثير ، وقرأ الآخرون بالتخفيف . ( وعدده ) أحصاه ، وقال مقاتل : استعده وادخره وجعله عتادا له ، يقال : أعددت [ الشيء ] وعددته إذا أمسكته ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 2{ نِ الَّذِیْ جَمَعَ مَالًا وَّعَدَّدَہٗ۔ } ”جو مال جمع کرتا رہا اور اس کو گنتا رہا۔“ جس نے اپنی زندگی اور زندگی کی ساری جدوجہد مال کمانے اور اس کا حساب رکھنے میں برباد کردی۔ وہ یہی سوچ سوچ کر خوش ہوتا رہا کہ اس ماہ میرے اکائونٹس میں اتنے فیصد اضافہ ہوگیا ہے اور پچھلے سال کے مقابلے میں اس سال میرے اثاثہ جات اس قدر بڑھ گئے ہیں۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>যে অর্থ জমায় ও তা গণনা করে রাখে। [১]</p><p>[১] এর অর্থ হল যে, সে (মাল) জমা করে ও গুনে গুনে রাখে; গুছিয়ে গুছিয়ে রাখে এবং আল্লাহর রাস্তায় খরচ করে না। নচেৎ, সাধারণভাবে মাল সঞ্চয় করে রাখা কোন নিন্দনীয় কাজ নয়। নিন্দনীয় তখনই হয় যখন তার যাকাত দেওয়া না হয়, দান-খয়রাত এবং আল্লাহর রাস্তায় খরচ না করা হয়।</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>The third evil quality denounced severely in this Surah is greed, that is, the selfish hoarding of wealth, against which is the stern warning of the dreadful end of those who have passion for worldly riches. This verse, however, refers to the love of, and passion for, wealth which is accumulated and counted over and over again. Other verses and Ahadith bear testimony to the fact that amassing of wealth in principle is not prohibited or sinful. Therefore, verse [ 2] must be interpreted in the light of those verses and traditions. This verse purports to say that anyone who accumulates wealth and does not pay his obligatory dues or has greed for wealth that leads him to pride and arrogance, or has love of wealth that engrosses him in the hoarding of wealth so profoundly that he forgets his religious obligations, his practice is condemned in the strongest terms, and a person attaching such profound love, greed and passion for material riches will suffer eternal perdition as described in the verses that follow.</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : الذي جمع مالا وعددهأي أعده - زعم - لنوائب الدهر ; مثل كرم وأكرم . وقيل : أحصى عدده ; قاله السدي . وقال الضحاك : أي أعد ماله لمن يرثه من أولاده . وقيل : أي فاخر بعدده وكثرته . والمقصود الذم على إمساك المال عن سبيل الطاعة . كما قال : مناع للخير ، وقال : وجمع فأوعى . وقراءة الجماعة جمع مخفف الميم . وشددها ابن عامر وحمزة والكسائي على التكثير . واختاره أبو عبيد ; لقوله : وعدده . وقرأ الحسن ونصر بن عاصم وأبو العالية جمع مخففا ، وعدده مخففا أيضا ; فأظهروا التضعيف لأن أصله عده وهو بعيد ; لأنه وقع في المصحف بدالين . وقد جاء مثله في الشعر ; لما أبرزوا التضعيف خففوه . قال :مهلا أمامة قد جربت من خلقي إني أجود لأقوام وإن ضننواأراد : ضنوا وبخلوا ، فأظهر التضعيف ; لكن الشعر موضع ضرورة . قال المهدوي : من خفف وعدده فهو معطوف على المال ; أي وجمع عدده فلا يكون فعلا على إظهار التضعيف ; لأن ذلك لا يستعمل إلا في الشعر ."
      }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 3,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 16,
        "text": "يظن أنه ضَمِنَ لنفسه بهذا المال الذي جمعه، الخلود في الدنيا والإفلات من الحساب."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : يحسب أي يظن أن ماله أخلده أي يبقيه حيا لا يموت ; قاله السدي . وقال عكرمة : أي يزيد في عمره . وقيل : أحياه فيما مضى ، وهو ماض بمعنى المستقبل . يقال : هلك والله فلان ودخل النار ; أي يدخل ."
      },
      {
        "resource_id": 91,
        "text": "{ يَحْسَبُ } بجهله { أَنَّ مَالَهُ أَخْلَدَهُ } في الدنيا، فلذلك كان كده وسعيه كله في تنمية ماله، الذي يظن أنه ينمي عمره، ولم يدر أن البخل يقصف الأعمار، ويخرب الديار، وأن البر يزيد في العمر."
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 166,
        "text": "<p>সে ধারণা করে যে, তার অর্থ তাকে অমর করে রাখবে [১] ;</p><p>[১] এর অর্থ হচ্ছে এই যে, সে মনে করে তার অর্থ-সম্পদ তাকে চিরন্তন জীবন দান করবে। অর্থাৎ অর্থ জমা করার এবং তা গুণে রেখে দেবার কাজে সে এত বেশী মশগুল যে নিজের মৃত্যুর কথা তার মনে নেই। তার মনে কখনো এ চিন্তার উদয় হয় না যে, এক সময় তাকে এসব কিছু ছেড়ে দিয়ে খালি হাতে দুনিয়া থেকে বিদায় নিতে হবে। তাছাড়া তাকে এ সম্পদের হিসাবও দিতে হবে। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, কিয়ামতের দিন কোন বান্দার দু‘পা সামনে অগ্রসর হতে পারবে না যতক্ষণ না তাকে নিম্নোক্ত বিষয় জিজ্ঞাসা করা না হয়, তার জীবনকে কিসে নি:শেষ করেছে; তার জ্ঞান দ্বারা সে কী করেছে; তার সম্পদ কোথেকে আহরণ করেছে ও কিসে ব্যয় করেছে এবং তার শরীর কিসে খাটিয়েছে।” [তিরমিয়ী: ২৪১৭] [আত-তাফসীরুস সাহীহ]</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ )يقول: يحسب أن ماله الذي جمعه وأحصاه, وبخل بإنفاقه, مخلده في الدنيا, فمزيل عنه الموت. وقيل: أخلده, والمعنى: يخلده, كما يقال للرجل الذي يأتي الأمر الذي يكون سببا لهلاكه: عطب والله فلان, هلك والله فلان, بمعنى: أنه يعطب من فعله ذلك, ولما يهلك بعد ولم يعطب; وكالرجل يأتي الموبقة من الذنوب: دخل والله فلان النار."
      },
      {
        "resource_id": 14,
        "text": "أي يظن أن جمعه المال يخلده في هذه الدار \"كلا\" أي ليس الأمر كما زعم ولا كما حسب. ثم."
      },
      {
        "resource_id": 94,
        "text": "\"يحسب أن ماله أخلده\"، في الدنيا، يظن أنه لا يموت مع يساره."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 3{ یَحْسَبُ اَنَّ مَالَہٗٓ اَخْلَدَہٗ۔ } ”وہ سمجھتا ہے کہ اس کا مال اسے ہمیشہ باقی رکھے گا۔“ گویا اس کے مال نے اسے زندئہ جاوید کردیا ہے۔ ایک دولت مند آدمی اپنی دولت کے ذریعے دنیا میں ایسے آثار و نقوش چھوڑ کر جانا چاہتا ہے جن کی وجہ سے اس کا نام دنیا میں ہمیشہ رہے۔ انسان کی اسی خواہش نے اسے اہرام مصر جیسے عجائبات کی تخلیق پر مجبور کیا۔ مشہور انگریزی نظم The Pyramids کے ان الفاظ میں انسان کی اسی نفسیات کی عکاسی کی گئی ہے :Calm and self possessed ,Still and resolute ,rؔPyramids echo into eternity ,They defined cry of mans willTo strive conquer the storms of time.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>সে ধারণা করে যে, তার অর্থ তাকে অমর করে রাখবে। [১]</p><p>[১] أخلَدَه শব্দের সবচেয়ে সঠিক অর্থ হল, 'তাকে সর্বদা জীবিত রাখবে।' অর্থাৎ, এই মাল যা সে জমা করে রাখছে, তা তার আয়ু বৃদ্ধি করবে এবং তাকে মরতে দেবে না।</p>"
      },
      {
        "resource_id": 170,
        "text": "Господь предостерег Своих рабов от великой беды и мучительного наказания, которое постигнет тех, кто оскорбляет людей словом и делом. Арабское слово «хумаза» («хулитель») относиться ко всем, кто порочит людей своими делами либо высмеивает их, показывая на них пальцем. А слово «лумаза» («поноситель») относиться к тем, кто злословит в адрес других и поносит их скверными речами. Аллах подчеркнул, что такие люди, как правило, стремятся к богатству и любят пересчитывать его в свое удовольствие. Это является их единственной заботой в этом мире. Они не стремятся расходовать его на пожертвования и благие цели, как не желают помогать бедным и родственникам. Их старания и стремления направлены на увеличение своего состояния, потому что они полагают, что оно в силах помочь им продлить жизнь. Они не ведает того, что алчность и скупость ломают человеческие жизни и разрушают семьи, тогда как благодеяния действительно способствуют тому, что Аллах продлевает жизнь Своим рабам."
      },
      {
        "resource_id": 93,
        "text": "وقوله - تعالى - : ( يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ ) ، صفة أخرى من صفاته القبيحة ، والجملة يصح أن تكون مستأنفة استنئافا بيانيا ، جوابا لسؤال مقدر ، كأنه قيل : ما باله يجمع المال ويهتم به؟ فكان الجواب : يحسب أن ماله أخلده .ويصح أن تكون حالا من فاعل \" جمع \" أى : هذا الجاهل المغرور جمع المال وعدده ، حالة كونه يظن أن ماله يخلده فى الدنيا ، ويجعله فى مأمن من حوادث الدهر .قال الأستاذ الإِمام محمد عبده : أى أن الذى يحمل هذا الهمزة اللمزة على الحط من أقدار الناس ، هو جمعه المال وتعديده . . فكلما نظر إلى كثرة ما عنده منه ، انتفخ وظن أنه من رفعة المكانة ، بحيث يكون كل ذ فضل ومزية دونه . . ويظن أن ما عنده من المال ، قد حفظ له حياته التى هو فيها ، وأرصدها عليه ، فهو لا يفارقها إلى حياة أخرى ، يعاقب فيها على ما كسب من سيئ الأعمال . ."
      },
      {
        "resource_id": 92,
        "text": "يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ (3) وجملة : { يحسب أن ماله أخلده } يجوز أن تكون حالاً من هُمَزة فيكون مستعملاً في التَّهكم عليه في حرصه على جمع المال وتعديده لأنه لا يُوجد من يَحْسب أن ماله يُخلده ، فيكون الكلام من قبيل التمثيل ، أو تكون الحال مراداً بها التشبيه وهو تشبيه بليغ .ويجوز أن تكون الجملة مستأنفة والخبر مستعملاً في الإِنكار ، أو على تقدير همزة استفهام محذوفة مستعملاً في التهكم أو التعجيب .وجيء بصيغة المضي في { أخلده } لتنزيل المستقبل منزلة الماضي لتحققه عنده ، وذلك زيادة في التهكم به بأنه موقن بأن ماله يخلده حتى كأنه حصل إخلاده وثبت .والهَمزة في { أخلده } للتعدية ، أي جعله خالداً .وقرأ الجمهور : { يحسِب } بكسر السين . وقرأه ابن عامر وعاصم وحمزة وأبو جعفر بفتح السين وهما لغتان .ومعنى الآية : أن الذين جمعوا المال يشبه حالهم حال من يحسب أن المال يقيهم الموت ويجعلهم خالدين لأن الخلود في الدنيا أقصى متمناهم إذ لا يؤمنون بحياة أخرى خالدة ."
      }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 4,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 170, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      {
        "resource_id": 16,
        "text": "ليس الأمر كما ظن، ليُطرحنَّ في النار التي تهشم كل ما يُلْقى فيها."
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 90,
        "text": "كلا رد لما توهمه الكافر ; أي لا يخلد ولا يبقى له مال . وقد مضى القول في كلا مستوفى . وقال عمر بن عبد الله مولى غفرة : إذا سمعت الله - عز وجل - يقول كلا فإنه يقول كذبت .لينبذن أي ليطرحن وليلقين . وقرأ الحسن ومحمد بن كعب ونصر بن عاصم ومجاهد وحميد وابن محيصن : [ ص: 166 ] لينبذان بالتثنية ، أي هو وماله . وعن الحسن أيضا لينبذنه على معنى لينبذن ماله . وعنه أيضا بالنون لننبذنه على إخبار الله تعالى عن نفسه ، وأنه ينبذ صاحب المال . وعنه أيضا لينبذن بضم الذال ; على أن المراد الهمزة واللمزة والمال وجامعه .في الحطمة وهي نار الله ; سميت بذلك لأنها تكسر كل ما يلقى فيها وتحطمه وتهشمه . قال الراجز :إنا حطمنا بالقضيب مصعبا يوم كسرنا أنفه ليغضباوهي الطبقة السادسة من طبقات جهنم . حكاه الماوردي عن الكلبي . وحكى القشيري عنه : الحطمة الدركة الثانية من درك النار . وقال الضحاك : وهي الدرك الرابع . ابن زيد : اسم من أسماء جهنم ."
      },
      {
        "resource_id": 91,
        "text": "{ كَلَّا لَيُنْبَذَنَّ } أي: ليطرحن { فِي الْحُطَمَةِ}"
      },
      {
        "resource_id": 165,
        "text": "<p>কখনও না, [১] সে অবশ্যই নিক্ষিপ্ত হবে হুত্বামায়। [২]</p><p>[১] অর্থাৎ, কখনও এমনটি হবে না, যেমন সে ভাবে ও ধারণা করে।</p><p>[২] এমন বখীল ব্যক্তিকে 'হুত্বামাহ' জাহান্নামে নিক্ষেপ করা হবে। এটাও একটি জাহান্নামের নাম। 'হুত্বামাহ' অর্থঃ ভেঙ্গে-চুরে ধ্বংস করা।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>কখনও না, সে অবশ্যই নিক্ষিপ্ত হবে [১] হুতামায় [২] ;</p><p>[১] আরবী ভাষায় কোন জিনিসকে তুচ্ছ মনে করে ছুঁড়ে ফেলে দেয়া অর্থে ‘নবয’ نبذ শব্দটি ব্যবহার করা হয়। [কুরতুবী, তাহরীর ওয়াত-তানওয়ীর] এ থেকে আপনা আপনি এই ইংগিত সুস্পষ্ট হয়ে ওঠে যে, নিজের ধনশালী হওয়ার কারণে সে দুনিয়ায় নিজেকে অনেক বড় কিছু মনে করে। কিন্তু কিয়ামতের দিন তাকে ঘৃণাভরে জাহান্নামে ছুঁড়ে দেয়া হবে।</p><p>[২] হুতামা শব্দটির মূল হচ্ছে, হাতম। হাতম মানে ভেঙ্গে ফেলা, পিষে ফেলা ও টুকরা করে ফেলা। জাহান্নামকে হাতম নামে অভিহিত করার কারণ হচ্ছে এই যে, তার মধ্যে যা কিছু ফেলে দেয়া হবে তাকে সে নিজের গভীরতা ও আগুনের কারণে ভেঙ্গে গুঁড়িয়ে রেখে দেবে। [কুরতুবী]</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( كَلا ) يقول تعالى ذكره: ما ذلك كما ظنّ, ليس ماله مخلِّده,ثم أخبر جلّ ثناؤه أنه هالك ومعذب على أفعاله ومعاصيه, التي كان يأتيها في الدنيا, فقال جل ثناؤه: ( لَيُنْبَذَنَّ فِي الْحُطَمَةِ ) يقول: ليُقذفنّ يوم القيامة في الحطمة, والحطمة: اسم من أسماء النار, كما قيل لها: جهنم وسقر ولظى, وأحسبها سميت بذلك لحطمها كلّ ما ألقي فيها, كما يقال للرجل الأكول: الحطمة. ذكر عن الحسن البصري أنه كان يقرأ ذلك: \" لَيُنْبَذَانِّ فِي الحُطَمَةِ\" يعني: هذا الهمزة اللمزة وماله, فثنَّاه لذلك."
      },
      {
        "resource_id": 14,
        "text": "أي ليلقين هذا الذي جمع مالا فعدده في الحطمة وهي اسم طبقة من أسماء النار لأنها تحطم من فيها."
      },
      {
        "resource_id": 94,
        "text": "\"كلا\"، رداً عليه أن لا يخلده ماله، \"لينبذن\"، ليطرحن، \"في الحطمة\"، في جهنم، والحكمة من أسماء النار، مثل: سقر، ولظى، سميت حطمة لأنها تحطم العظام وتكسرها."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 4{ کَلَّا لَـیُنْبَذَنَّ فِی الْْحُطَمَۃِ۔ } ”ہرگز نہیں ‘ وہ تو یقینا جھونک دیا جائے گا حطمہ میں۔“ حُطَمَۃ : حَطَمَسے ہے ‘ یعنی توڑ ڈالنے والی ‘ پیس ڈالنے والی ‘ چور چور اور ریزہ ریزہ کردینے والی۔ یہ دوزخ کے ایک خاص طبقے کا نام ہے جس کی آگ اتنی تیز ہوگی کہ اس میں جو شے بھی ڈالی جائے گی اس کو آنِ واحد میں پیس کر رکھ دے گی۔</p>"
      },
      {
        "resource_id": 93,
        "text": "ثم بين - سبحانه - بعد ذلك سوء عاقبة هذا الجاهل المغرور فقال : ( كَلاَّ لَيُنبَذَنَّ فِي الحطمة . وَمَآ أَدْرَاكَ مَا الحطمة ) .و \" كلا \" حرف زجر وردع ، والمراد به هنا إبطال ما توهمه هذا المغرور من حسبانه أن ماله سيخلده . والنبذ : الطرح للشئ والإِلقاء به مع التحقير والتصغير من شأنه .والحُطَمة من الحَطْم ، وهو كسر الشئ بشدة وقوة ، ويقال : رجل حطمة ، إذا كان شديداً فى تحطيمه وكسره لغيره ، والمراد بالحطمة هنا : النارر الشديدة الاشتعال : التى لا تبقى على شئ إلا وأحرقته .أى : كلا ليس الأمر كما زعم هذا الهمزة واللمزة ، من أن ماله سيخلده ، بل الحق أنه والله ليطرحن بسبب أفعاله القبيحة فى النار التى تحطم كل شئ يلقى فيها ، والتى لا يعرف مقدار شدتها واشتعالها إلا الله - تعالى - ."
      },
      {
        "resource_id": 92,
        "text": "كَلَّا لَيُنْبَذَنَّ فِي الْحُطَمَةِ (4) و { كلاّ } إبطال لأن يكون المال مُخلدّاً لهم . وزجر عن التلبس بالحالة الشنيعة التي جعلتهم في حال من يحسب أن المال يخلد صاحبه ، أو إبطال للحرص في جمع المال جمعاً يمنع به حقوق الله في المال من نفقات وزكاة .{ كَلاَّ لَيُنبَذَنَّ فِى } { الحطمة * وَمَآ أَدْرَاكَ مَا الحطمة * نَارُ الله الموقدة * التى تَطَّلِعُ عَلَى الافئدة } .استئناف بياني ناشىء عن ما تضمنته جملة : { يحسب أن ماله أخلده } من التهكم والإِنكار ، وما أفاده حرف الزجر من معنى التوعد .والمعنى : ليَهْلِكَنَّ فَليُنْبَذَنَّ في الحُطمة .واللام جواب قسم محذوف . والضمير عائد إلى الهمزة .والنبذ : الإِلقاء والطرح ، وأكثر استعماله في إلقاء ما يكره . قال صاحب «الكشاف» في قوله تعالى : { فأخذناه وجنوده فنبذناهم في اليم } [ القصص : 40 ] شبههم استحقاراً لهم بحَصَيات أخذَهُن آخذٌ بكفه فطرحهن اه .والحُطمة : صفة بوزن فُعَلَة ، مثل ما تقدم في الهُمزة ، أي لينبذن في شيء يحطمه ، أي يكسره ويدقه .والظاهر أن اللام لتعريف العهد لأنه اعتبر الوصف علماً بالغلبة على شيء يحطم وأريد بذلك جهنم ، وأن إطلاق هذا الوصف على جهنم من مصطلحات القرآن . وليس في كلام العرب إطلاق هذا الوصف على النار ."
      }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 5,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 16, "text": "وما أدراك -أيها الرسول- ما حقيقة النار؟" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 157, "text": "" },
      { "resource_id": 170, "text": "" },
      { "resource_id": 90, "text": "على التعظيم لشأنها , والتفخيم لأمرها ." },
      {
        "resource_id": 93,
        "text": "فالمقصود بالاستفهام فى قوله - تعالى - : ( وَمَآ أَدْرَاكَ مَا الحطمة ) تهويل أمر هذه النار ، وتفظيع شأنها ، وبيان أن كنهها لا تدركه عقول البشر . ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 92,
        "text": "وَمَا أَدْرَاكَ مَا الْحُطَمَةُ (5) فجملة : { وما أدراك ما الحطمة } في موضع الحال من قوله : { الحطمة } والرابط إعادة لفظ الحطمة ، وذلك إظهار في مقام الإِضمار للتهويل كقوله : { الحاقة ما الحاقة وما أدراك ما الحاقة } [ الحاقة : 1 3 ] وما فيها من الاستفهام ، وفعل الدراية يفيد تهويل الحطمة ، وقد تقدم { ما أدراك } غير مرة منها عند قوله : { وما أدراك ما يوم الدين } في سورة الانفطار ( 17 ) .وجملة : نار الله الموقدة } جواب عن جملة { وما أدراك ما الحطمة } مفيد مجموعهما بيان الحطمة ما هي ، وموقع الجملة موقع الاستئناف البياني ، والتقدير هي ، أي الحطمة نار الله ، فحُذف المبتدأ من الجملة جرياً على طريقة استعمال أمثاله من كل إخبار عن شيء بعد تقدم حديث عنه وأوصاف له ، وقد تقدم عند قوله تعالى : { صم بكم عمي } في سورة البقرة ( 18 ) ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 91,
        "text": "[وَمَا أَدْرَاكَ مَا الْحُطَمَةُ } تعظيم لها، وتهويل لشأنها."
      },
      {
        "resource_id": 165,
        "text": "<p>কিসে তোমাকে জানাল, হুত্বামা কি? [১]</p><p>[১] এই প্রশ্নসূচক বাক্য 'হুত্বামাহ' জাহান্নামের ভয়াবহতাকে ব্যক্ত করার জন্য ব্যবহার করা হয়েছে। অর্থাৎ, সেটা এমন ভয়ংকর আগুন হবে, যার প্রকৃতত্বে তোমার জ্ঞান-বুদ্ধি পৌঁছতে পারে না এবং তোমার সমঝ ও অনুভব তা আয়ত্ত করতে পারে না।</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَمَا أَدْرَاكَ مَا الْحُطَمَةُ ) يقول: وأيّ شيء أشعرك يا محمد ما الحطمة."
      },
      { "resource_id": 166, "text": "<p>আর আপনাকে কিসে জানাবে হুতামা কী?</p>" },
      {
        "resource_id": 14,
        "text": "قال \"وما أدراك ما الحطمة نار الله الموقدة التي تطلع على الأفئدة\" قال ثابت البناني تحرقهم إلى الأفئدة وهم أحياء ثم يقول لقد بلغ منهم العذاب ثم يبكي وقال محمد بن كعب تأكل كل شيء من جسده حتى إذا بلغت فؤاده حذو حلقه ترجع على جسده."
      },
      { "resource_id": 94, "text": "\"وما أدراك ما الحطمة\"." }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 6,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 157, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 16,
        "text": "إنها نار الله الموقدة التي من شدتها تنفُذ من الأجسام إلى القلوب."
      },
      {
        "resource_id": 14,
        "text": "تأكل كل شيء من جسده حتى إذا بلغت فؤاده حذو حلقه ترجع على جسده."
      },
      {
        "resource_id": 92,
        "text": "نَارُ اللَّهِ الْمُوقَدَةُ (6) وإضافة نار } إلى اسم الجلالة للترويع بها بأنها نار خلقها القادر على خلق الأمور العظيمة .ووصف { نار } ب«موقدة» ، وهو اسم مفعول من : أوقد النار ، إذا أشعلها وألهبَها . والتوقد : ابتداء التهاب النار فإذا صارت جمراً فقد خفّ لهبها ، أو زال ، فوصف { نار } ب«موقدة» يفيد أنها لا تزال تلتهب ولا يزول لهيبها .وهذا كما وُصفت نار الأخدود بذات الوَقود ( بفتح الواو ) في سورة البروج ، أي النار التي يُجدد اتقادها بوقود وَهو الحَطب الذي يُلقَى في النار لتتقد فليس الوصف بالموقَدة هنا تأكيداً ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      {
        "resource_id": 90,
        "text": "أي التي أوقد عليها ألف عام , وألف عام , وألف عام ; فهي غير خامدة ; أعدها الله للعصاة ."
      },
      { "resource_id": 165, "text": "<p>তা হল আল্লাহর প্রজ্বলিত অগ্নি।</p>" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 91,
        "text": "{ نَارُ اللَّهِ الْمُوقَدَةُ } التي وقودها الناس والحجارة"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 7{ الَّتِیْ تَطَّلِعُ عَلَی الْاَفْئِدَۃِ۔ } ”جو دلوں کے اوپر جا چڑھے گی۔“ یعنی اس آگ کی حدت اور تپش انسان کی جلد سے زیادہ اس کے دل پر اثر انداز ہوگی۔ بہرحال آج جب انسان خود Infra red Rays اور Ultra violet Rays سمیت آگ اور حرارت کی رنگا رنگ اقسام ایجاد کرچکا ہے اس کے لیے ”حُطَمَہ“ کی مذکورہ خصوصیت کو سمجھنا بہت آسان ہوگیا ہے۔ ایک صاحب نے خیال پیش کیا ہے کہ حُطَمَۃ ایٹمی حرارت کی کوئی شکل ہوگی۔ ان کا کہنا ہے کہ ایٹم سے جو حرارت پھیلتی ہے وہ براہ راست آگ نہیں ہوتی لیکن انسان کے وجود کو چیرتی چلی جاتی ہے۔</p>"
      },
      {
        "resource_id": 15,
        "text": "ثم أخبره عنها ما هي, فقال جل ثناؤه: هي ( نَارُ اللَّهِ الْمُوقَدَةُ * الَّتِي تَطَّلِعُ عَلَى الأفْئِدَةِ ) يقول: التي يطلع ألمها ووهجها القلوب; والاطلاع والبلوغ قد يكونان بمعنى، حُكي عن العرب سماعا: متى طلعت أرضنا; وطلعت أرضي: بلغت."
      },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - ( نَارُ الله الموقدة ) بيان للحطمة وتفصيل لأمرها بعد إبهامها .أىك الحطمة هى نار الله - تعالى - الشديدة الإِحراق ، وأضيفت إلى الله - تعالى لزيادة الترويع والتخويف منها ، لأن خالقها - عز وجل - هو الذى لا يعجزه شئ ."
      },
      { "resource_id": 94, "text": "\"نار الله الموقدة\"." },
      {
        "resource_id": 166,
        "text": "<p>এটা আল্লাহ্র প্রজ্বলিত আগুন [১] ,</p><p>[১] এখানে مو يدة অর্থ অত্যন্ত লেলিহান শিখাযুক্ত প্ৰজ্বলিত আগুন। [মুয়াসসার] এখানে এই আগুনকে আল্লাহ্র সাথে সম্পর্কিত করার মাধ্যমে কেবলমাত্র এর প্রচণ্ডতা ও ভয়াবহতা প্রকাশ পাচ্ছে। [রাহুল মা‘আনী, ফাতহুল কাদীর]</p>"
      }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 7,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 16,
        "text": "إنها نار الله الموقدة التي من شدتها تنفُذ من الأجسام إلى القلوب."
      },
      {
        "resource_id": 94,
        "text": "\"التي تطلع على الأفئدة\"، أي التي يبلغ ألمها ووجعها إلى القلوب، والاطلاع والبلوغ بمعنىً واحد، يحكى عن العرب: متى طلعت أرضنا؟ أي بلغت. ومعنى الآية: أنها تأكل كل شيء منه حتى تنتهي إلى فؤاده، قاله القرظي والكلبي."
      },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 90,
        "text": "التي تطلع على الأفئدة قال محمد بن كعب : تأكل النار جميع ما في أجسادهم ، حتى إذا بلغت إلى الفؤاد ، خلقوا خلقا جديدا ، فرجعت تأكلهم . وكذا روى خالد بن أبي عمران عن النبي - صلى الله عليه وسلم - : \" أن النار تأكل أهلها ، حتى إذا اطلعت على أفئدتهم انتهت ، ثم إذا صدروا تعود ، فذلك قوله تعالى : نار الله الموقدة التي تطلع على الأفئدة \" . وخص الأفئدة لأن الألم إذا صار إلى الفؤاد مات صاحبه . أي إنه في حال من يموت وهم لا يموتون ; كما قال الله تعالى : لا يموت فيها ولا يحيا فهم إذا أحياء في معنى الأموات . وقيل : معنى تطلع على الأفئدة أي تعلم مقدار ما يستحقه كل واحد منهم من العذاب ; وذلك بما استبقاه الله تعالى من الأمارة الدالة عليه . ويقال : اطلع فلان على كذا : أي علمه . وقد قال الله تعالى : تدعو من أدبر وتولى . وقال تعالى : إذا رأتهم من مكان بعيد سمعوا لها تغيظا وزفيرا . فوصفها بهذا ، فلا يبعد أن توصف بالعلم ."
      },
      { "resource_id": 159, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 91,
        "text": "{ الَّتِي } من شدتها { تَطَّلِعُ عَلَى الْأَفْئِدَةِ } أي: تنفذ من الأجسام إلى القلوب."
      },
      {
        "resource_id": 165,
        "text": "<p>যা হৃদয়কে গ্রাস করবে। [১]</p><p>[১] অর্থাৎ, তার উষ্ণতা হৃদয় পর্যন্ত পৌঁছে যাবে। এমনিতেই পৃথিবীর সাধারণ আগুনের গুণ হল সমস্ত বস্তুকে জ্বালিয়ে ফেলা। কিন্তু পৃথিবীতে এই আগুন হৃদয় পর্যন্ত পৌঁছনোর পূর্বেই মানুষের মৃত্যু ঘটে যায়। জাহান্নামে তা হবে না; বরং সেই আগুন হৃদয় পর্যন্ত পৌঁছে যাবে। আর মৃত্যুকে আহবান করা সত্ত্বেও মৃত্যু আসবে না।</p>"
      },
      {
        "resource_id": 15,
        "text": "ثم أخبره عنها ما هي, فقال جل ثناؤه: هي ( نَارُ اللَّهِ الْمُوقَدَةُ * الَّتِي تَطَّلِعُ عَلَى الأفْئِدَةِ ) يقول: التي يطلع ألمها ووهجها القلوب; والاطلاع والبلوغ قد يكونان بمعنى، حُكي عن العرب سماعا: متى طلعت أرضنا; وطلعت أرضي: بلغت."
      },
      {
        "resource_id": 14,
        "text": "قال \"وما أدراك ما الحطمة نار الله الموقدة التي تطلع على الأفئدة\" قال ثابت البناني تحرقهم إلى الأفئدة وهم أحياء ثم يقول لقد بلغ منهم العذاب ثم يبكي وقال محمد بن كعب تأكل كل شيء من جسده حتى إذا بلغت فؤاده حذو حلقه ترجع على جسده."
      },
      {
        "resource_id": 166,
        "text": "<p>যা হৃদয়কে গ্ৰাস করবে [১] ;</p><p>[১] ‘তাত্তালিউ’ শব্দটির মূলে হচ্ছে ইত্তিলা। আর ‘ইত্তিলা’ শব্দটির অর্থ হচ্ছে চড়া, আরোহণ করা ও ওপরে পৌছে যাওয়া। [জালালাইন] ‘আফইদাহ’ শব্দটি হচ্ছে বহুবচন। এর একবচন হচ্ছে ‘ফুওয়াদ’। এর মানে হৃদয়। অর্থাৎ জাহান্নামের এই আগুন হৃদয়কে পর্যন্ত গ্ৰাস করবে। হৃদয় পর্যন্ত এই আগুন পৌঁছাবার একটি অর্থ হচ্ছে এই যে, এই আগুন এমন জায়গায় পৌছে যাবে যেখানে মানুষের অসৎচিন্তা, ভুল আকীদা-বিশ্বাস, অপবিত্র ইচ্ছা, বাসনা, প্রবৃত্তি, আবেগ এবং দুষ্ট সংকল্প ও নিয়তের কেন্দ্র। [ফাতহুল কাদীর] এর দ্বিতীয় অর্থ হচ্ছে, আল্লাহ্র এই আগুন দুনিয়ার আগুনের মতো অন্ধ হবে না। সে দোষী ও নির্দোষ সবাইকে জ্বলিয়ে দেবে না। বরং প্রত্যেক অপরাধীর হৃদয় অভ্যন্তরে পৌছে সে তার অপরাধের প্রকৃতি নির্ধারণ করবে এবং প্রত্যেককে তার দোষ ও অপরাধ অনুযায়ী আযাব দেবে। এর তৃতীয় অর্থ হচ্ছে, দুনিয়ার আগুন মানুষের দেহে লাগলে হৃদয় পর্যন্ত পৌঁছার আগেই মৃত্যু হয়ে যায়। জাহান্নামে মৃত্যু নেই। কাজেই জীবিত অবস্থাতেই হৃদয় পর্যন্ত অগ্নি পৌছবে এবং হৃদয়-দহনের তীব্ৰ কষ্ট জীবদ্দশাতেই মানুষ অনুভব করবে। [কুরতুবী]</p>"
      },
      {
        "resource_id": 92,
        "text": "الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ (7)ووصفت { نار اللَّه } وصفاً ثانياً ب { التي تطلع على الأفئدة } .والاطلاع يجوز أن يكون بمعنى الإِتيان مبالغة في طلع ، أي الإِتيان السريع بقوة واستيلاء ، فالمعنى : التي تنفذ إلى الأفئدة فتحرقها في وقت حرق ظاهر الجسد .وأن يكون بمعنى الكشف والمشاهدة قال تعالى : { فاطلع فرآه في سواء الجحيم } [ الصافات : 55 ] فيفيد أن النار تحرق الأفئدة إحراق العالِم بما تحتوي عليه الأفئدة من الكفر فتصيب كل فؤاد بما هو كِفاؤه من شدة الحرق على حسب مبلغ سوء اعتقاده ، وذلك بتقدير من الله بين شدة النار وقابلية المتأثر بها لا يعلمه إلا مُقدِّره ."
      },
      {
        "resource_id": 170,
        "text": "Преисподняя ужасна и грозна. Ее растопкой будут люди и камни, а ее пламя будет проникать сквозь человеческие тела и обжигать сердца. Мученики будут заточены в Аду, в котором царит вечный жар, и будут лишены малейшей надежды выйти оттуда. Поэтому далее Всевышний сказал:"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>التی ........................ الافئدة (7:104) ” جو دلوں تک پہنچے گی “۔ اس شخص کے دل تک ، جس سے ھمزة لمزة (1:104) کا فعل قبیع ابھرتا ہے اور جس کے اندر مزاح ، تکبر اور غرور کا مواد چھپا ہوا ہوتا ہے۔ یہ تصویر اس طرح مکمل ہوتی ہے کہ اس پھینکے ہوئے نظر انداز کیے ہوئے اور پاش پاش کردیئے گئے شخص کو جس آگ میں پھینکا گیا ہے وہ اس کے روبرو سربند کردی گئی ہے۔ کوئی اس سے نکل نہ سکے گا۔ کوئی وہاں اس کو پوچھنے کے لئے نہ آئے گا۔ اس آگ میں بھی یہ شخص ستونوں کے ساتھ بندھا ہوا ہوگا ، جس طرح مویشیوں کو باڑوں میں باندھ دیا جاتا ہے۔ اس تصویر کشی کے لئے الفاظ کا جو رنگ استعمال کیا گیا ہے وہ بہت ہی شدید اور شوخ ہے۔</p><p>عددہ ۔۔ کلا لینبذن ۔۔ تطلع ۔۔ ممددة پھر جملوں کی جو تراکیب ہیں وہ بھی نہایت موکد اور زور دار ہیں۔</p><p>کلا ................................ الموقدة (6:104) ” البتہ وہ شخص تو لازماً ایک چکنا چور کردینے والی جگہ میں پھینک دیا جائے گا اور تم کیا جانو کہ کیا ہے وہ چکنا چور کردینے والی جگہ ؟ وہ اللہ کی آگ ہے ، خوب بھڑکائی ہوئی “۔ پہلے اسے مجمل لفظ سے تعبیر کیا گیا۔</p><p>الحطمة جہنم کے لئے صریح نہیں ہے اور یہ مبہم لفظ تھا۔ اس کے بعد اسے مزید خوفناک بنانے کے لئے سوال کیا تھا۔ اور اس کے بعد جواب دیا گیا اور تشریح کردی گئی۔ یہ تمام اسالیب تاکید اور ہولناکی اور عظمت کے بیان کے لئے آتے ہیں ، اور پھر انداز بیان تاکید کے ساتھ تہدید آمیز بھی ہے۔</p><p>ویل ” ہلاکت ہے اس کے لئے “۔ لینبذن ” اسے ضرور پھینکا جائے گا “۔ الحطمة ” پاش پاش کرنے والی ہیں “۔ نار اللہ الموفدة (6:104) ” اللہ کی آگ جو خوب بھڑکائی ہوئی ہے “۔ التی ................ الافئدة (7:104) ” جس کے اثرات دلوں تک پہنچیں گے “۔ انھا علیھم موصدة (8:104) ” اونچے ہوئے ستونوں میں بندھے ہوئے ہوں گے “۔ اس تصویر کشی کے لئے جو الفاظ چنے گئے ہیں ان میں تصویری اور شعوری مناسبت ہے ہمز اور لمز کا فعل بد کرنے والے شخص کے ساتھ۔</p><p>حقیقت یہ ہے کہ قرآن کریم دعوت اسلامی کی رفتار پر نظر رکھ رہا تھا اور یہ قرآن ہی تھا جو روز مرہ کے واقعات پر تبصرہ کرکے رہنمائی کرتا تھا اور یہ بروقت راہنمائی ایک ایسا ہتھیار تھا جو دشمنوں کے سازشوں کا تانا بانا کاٹ کر رکھ دیتا تھا بلکہ ان پر ایک خوف طاری کردیتا تھا اور اہل ایمان کی روحیں اطمینان سے سرشار ہوجاتی تھیں۔ اللہ تعالیٰ نے ان دو تصویروں کی جو مذمت فرمائی ہے اس میں ہمیں حکمت کے دو نکات نظرآتے ہیں۔</p><p>(1) یہ ایک اسلامی سوسائٹی اخلاقی گراوٹ کو قبول نہیں کرتی۔ اور اس قسم کے لوگ جہاں اور جس معاشرے میں ہوں وہ قابل مذمت ہیں۔</p><p>(2) اللہ تعالیٰ اہل ایمان کی مدافعت فرماتا ہے اور ان کو اس بات سے بچاتا ہے کہ لوگوں کے اس توہین آمیز رویے سے کہیں ان میں احساس کمتری پیدا نہ ہوجائے۔ چناچہ اس سورت میں ان کو یہ احساس دلایا گیا ہے کہ ان کے ساتھ جو کچھ ہورہا ہے ، اللہ دیکھ رہا ہے ، اللہ اسے ناپسند کرتا ہے ، اس پر ان کو سزا دے رہا ہے ، اس طرح اہل ایمان روحانی تائیدپاتے ہیں ، اور ان کے اندر اخلاقی برتری کا احساس پایا جاتا ہے اور ان کو یقین ہوجاتا ہے کہ ان کے خلاف جو سازشیں ہورہی ہیں وہ بہت ہی گھناﺅنی ہیں اور گھٹیا لوگوں کی طرف سے ہیں۔</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>Verse [ 104:7] تَطَّلِعُ عَلَى الْأَفْئِدَةِ (that will peep into the hearts). In other words, the fire of Hell will reach their hearts. The basic property of fire is to burn every particle of the things that fall into it. When people are put into the Hell-fire, it will devour every limb and organ of the body until it reaches their heart, but the person will not die. This characteristic of the Hell-fire is especially highlighted in the verse because the fire of this world kills the person even before reaching the heart. The fire of the Hell, on the other hand, will reach the heart in the state of life, and man will experience the torture of the burning of the heart while alive.</p><p>Al-Hamdulillah</p><p>The Commentary on</p><p>Surah Al-Humazah</p><p>Ends here</p>"
      },
      {
        "resource_id": 93,
        "text": "وقوله - تعالى - : ( التي تَطَّلِعُ عَلَى الأفئدة ) صفة أخرى من صفات هذه النار ، وقوله : ( تَطَّلِعُ ) من الاطلاع ، بمعنى الوصول إلى الشئ بسرعة ، والكشف عن خباياه ، والنفاذ إلى منتهاه .أى : سيلقى بهذا الشقى فى نار الله - تعالى - الموقدة ، التى تصل إلى أعماق الأفئدة والقلوب ، فتحيط بها ، وتنفذ إليها ، فتحرقها إحراقا تاما .وخصت الأفئدة التى هى القلوب بالذكر ، لأنها ألطف ما فى الأبدان وأشدها تألما بأدنى أذى يصيبها ، أو لأنها محل العقائد الزائفة ، والنيات الخبيثة ، ومنشأ الأعمال السيئة ، التى استحق هذا الهمزة اللمزة بسببها العقاب الشديد ."
      }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 8,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      { "resource_id": 157, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 90,
        "text": "أي مطبقة ; قاله الحسن والضحاك .وقد تقدم في سورة \" البلد \" القول فيه .وقيل : مغلقة ; بلغة قريش .يقولون : آصدت الباب إذا أغلقته ; قاله مجاهد .ومنه قول عبيد الله بن قيس الرقيات : إن في القصر لو دخلنا غزالا مصفقا موصدا عليه الحجاب"
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 94, "text": "\" إنها عليهم مؤصدة \"، مطبقة مغلقة." },
      {
        "resource_id": 16,
        "text": "إنها عليهم مطبَقة في سلاسل وأغلال مطوَّلة؛ لئلا يخرجوا منها."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 91,
        "text": "ومع هذه الحرارة البليغة هم محبوسون فيها، قد أيسوا من الخروج منها، ولهذا قال: { إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ } أي: مغلقة"
      },
      {
        "resource_id": 14,
        "text": "قوله تعالى \"إنها عليهم مؤصدة\" أي مطبقة كما تقدم تفسيره في سورة البلد. وقال ابن مردويه حدثنا عبدالله بن محمد حدثنا علي بن سراج حدثنا حماد بن حرزاد حدثنا شجاع بن أشرس حدثنا شريك عن عاصم عن أبي صالح عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم \"إنها عليهم مؤصدة\" قال مطبقة. وقد رواه أبو بكر بن أبي شيبة عن عبدالله بن أسد عن إسماعيل بن أبي خالد عن أبي صالح قوله ولم يرفعه."
      },
      {
        "resource_id": 93,
        "text": "ثم وصف - سبحانه - هذه النار بصفة ثالثة فقال : ( إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌ ) أى : إن هذه النار من صفاتها - أيضا - أنها مطبقة ومغلقة عليهم بحيث لا يستطيعون الخروج منها ، فقوله ( مُّؤْصَدَةٌ ) اسم مفعول من قولك أوصدت الباب ، إذا أغلقته بشدة ، بحيث لا يستطاع الخروج منه . ."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) يقول تعالى ذكره: إن الحطمة التي وصفت صفتها عليهم, يعني: على هؤلاء الهمازين اللمازين ( مُؤْصَدَةٌ ) : يعني: مطبقة; وهي تهمز ولا تهمز; وقد قُرئتا جميعا.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثنا أبو كُرَيب, قال: ثنا طلق, عن ابن ظهير, عن السديّ, عن أبي مالك, عن ابن عباس في (مُؤْصَدَة): قال: مطبقة.حدثني عبيد بن أسباط, قال: ثني أبي, عن فضيل بن مرزوق, عن عطية, في قوله: ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) قال: مطبقة.حدثنا ابن حميد, قال: ثنا يعقوب, عن جعفر, عن سعيد, قال: في النار رجل في شعب من شعابها ينادي مقدار ألف عام: يا حنان يا حنان, فيقول رب العزة لجبريل: أخرج عبدي من النار, فيأتيها فيجدها مطبقة, فيرجع فيقول: يا ربّ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) فيقول: يا حبريل فكها, وأخرج عبدي من النار, فيفكها, ويخرج مثل الخيال, فيطرح على ساحل الجنة حتي يُنبت الله له شعرا ولحما ودما.حدثني يعقوب بن إبراهيم, قال: ثنا ابن علية, عن أبي رجاء, عن الحسن, في قوله: ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) قال: مطبقة.حدثنا أبو كريب, قال: ثنا وكيع, عن مضرِّس بن عبد الله, قال: سمعت الضحاك ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) قال: مطبقة.حدثني محمد بن سعد, قال: ثني أبي, قال: ثني عمي, قال: ثني أبي, عن أبيه, عن ابن عباس: ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) قال: عليهم مغلقة.حدثنا بشر, قال: ثنا يزيد, قال: ثنا سعيد, عن قتادة ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) : أي مطبقة.حدثني يونس, قال: أخبرنا ابن وهب, قال: قال ابن زيد, في قوله: ( إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ ) قال: مطبقة, والعرب تقول: أوصد الباب: أغلق."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 104:9 for complete tafsir.</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 8{ اِنَّہَا عَلَیْہِمْ مُّؤْصَدَۃٌ۔ } ”بیشک وہ آگ ان پر بند کردی جائے گی۔“ تاکہ اس کی تمام تر حرارت ان پر اثر انداز ہو اور انہیں زیادہ سے زیادہ تکلیف پہنچے۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>নিশ্চয়ই তা তাদেরকে পরিবেষ্টন করে রাখবে।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>নিশ্চয় এটা তাদেরকে পরিবেষ্টন করে রাখবে [১]</p><p>[১] অর্থাৎ অপরাধীদেরকে জাহান্নামের মধ্যে নিক্ষেপ করে ওপর থেকে তা বন্ধ করে দেয়া হবে। কোন দরজা তো দুরের কথা তার কোন একটি ছিদ্ৰও খোলা থাকবে না। [ইবন কাসীর]</p>"
      },
      {
        "resource_id": 92,
        "text": "إِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ (8) هذه جملة يجوز أن تكون صفة ثالثة ل { نار اللَّه } [ الهمزة : 6 ] بدون عاطف ، ويجوز أن تكون مستأنفة استئنافاً ابتدائياً وتأكيدها ب ( إنّ ) لتهويل الوعيد بما ينفي عنه احتمالَ المجاز أو المبالغة .وموصدة : اسم مفعول من أوصد الباب ، إذا أغلقه غلقاً مطبقاً . ويقال : آاصد بهمزتين إحداهما أصلية والأخرى همزة التعدية ، ويقال : أصَدَ الباب فعلاً ثلاثياً ، ولا يقال : وصَد بالواو بمعنى أغلق .وقرأ الجمهور : { موصدة } بواو بعد الميم على تخفيف الهمزة ، وقرأه أبو عمرو وحمزة وحفص عن عاصم ويعقوب وخلف بهمزة ساكنة بعد الميم المضمومة .ومعنى إيصادها عليهم : ملازمة العذاب واليأسُ من الإِفلات منه كحال المساجين الذين أغلق عليهم باب السجن تمثيلَ تقريب لشدة العذاب بما هو متعارف في أحوال الناس ، وحالُ عذاب جهنم أشد مما يبلغه تصور العقول المعتاد ."
      }
    ]
  },
  {
    "index": 104,
    "sura": 104,
    "verse": 9,
    "tafsirs": [
      {
        "resource_id": 16,
        "text": "إنها عليهم مطبَقة في سلاسل وأغلال مطوَّلة؛ لئلا يخرجوا منها."
      },
      { "resource_id": 168, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 91,
        "text": "{ فِي عَمَدٍ } من خلف الأبواب { مُمَدَّدَةٍ } لئلا يخرجوا منها { كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا أُعِيدُوا فِيهَا } .[نعوذ بالله من ذلك، ونسأله العفو والعافية]."
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 93, "text": "" },
      {
        "resource_id": 166,
        "text": "<p>দীর্ঘায়িত স্তম্ভসমূহে [১]।</p><p>[১] ফি আমাদিম মুমাদাদাহ এর একাধিক অর্থ হতে পারে। যেমন এর একটি অর্থ হচ্ছে, জাহান্নামের দরজাগুলো বন্ধ করে দিয়ে তার ওপর উঁচু উঁচু থাম গেঁড়ে দেয়া হবে। এর দ্বিতীয় অর্থ হচ্ছে, এই অপরাধীরা উঁচু উঁচু থামের গায়ে বাধা থাকবে। এর তৃতীয় অর্থ হল এরূপ স্তম্ভসমূহ বা থাম দিয়ে জাহান্নামীদের শাস্তি প্ৰদান করা হবে। এ-শাস্তি সম্পর্কে বিস্তারিত কোন কথা আল্লাহ্ জানাননি। এ মতটি ইমাম তাবারী গ্ৰহণ করেছেন। [তাবারী, ইবন কাসীর]</p>"
      },
      {
        "resource_id": 164,
        "text": "<p><b>১-৯ নং আয়াতের তাফসীর</b>আল্লাহ তা'আলা বলেনঃ চরম দুর্ভোগ রয়েছে এমন প্রত্যেক ব্যক্তির জন্যে যে অগোচরে অন্যের নিন্দে করে এবং সাক্ষাতে ধিক্কার দেয়। এর বর্ণনা (আরবি)  (পশ্চাতে নিন্দাকারী, যে একের কথা অপরের নিকট লাগিয়ে বেড়ায়) (৬৮:১১) এ আয়াতের তাফসীরে গত হয়েছে। হযরত ইবনে আব্বাস (রাঃ) বলেন যে, এর অর্থ হলো খোটাদানকারী এবং গীবতকারী। রবী ইবনে আনাস (রাঃ) বলেন যে, সামনে মন্দ বলাকে (আরবি)  বলা হয় এবং অসাক্ষাতে নিন্দে করাকে (আরবি) বলে। হযরত কাতাদাহ (রঃ) বলেন যে, এর ভাবার্থ হলো মুখের ভাষায় এবং চোখের ইশারায় আল্লাহর বান্দাদেরকে কষ্ট দেয়া। মুজাহিদ (রঃ) বলেন যে, (আরবি)  এর অর্থ হলো হাত এবং (আরবি)  চোখ দ্বারা কষ্ট দেয়া এবং এর অর্থ মুখ বা জিহ্বা দ্বারা কষ্ট দেয়া। কেউ কেউ বলেন যে, এর দ্বারা আখফাস ইবনে শুরায়েককে বুঝানো হয়েছে। মুজাহিদ (রঃ) বলেন যে, এ আয়াত কোন নির্দিষ্ট ব্যক্তির উদ্দেশ্যে অবতীর্ণ হয়নি।এরপর আল্লাহ তাআলা বলেনঃ যে অর্থ জমায় ও তা বারবার গণনা করে। যেমন অন্যত্র রয়েছেঃ (আরবি) অর্থাৎ “যে সম্পদ পুঞ্জীভূত এবং সংরক্ষিত করে রেখেছিল।” হযরত কাব (রঃ) বলেনঃ সারাদিন সে অর্থ সম্পদ উপার্জনের জন্যে নিজেকে নিয়োজিত রাখলো এবং রাত্রে পচা গলা লাশের মত পড়ে রইলো।আল্লাহ তাবারাকা ওয়া তা'আলা বলেনঃ সে মনে করে যে, তার ধন সম্পদ তার কাছে চিরকাল থাকবে। কখনো না। অবশ্যই সে নিক্ষিপ্ত হবে হুমায়। হে নবী (সঃ)! তুমি কি জান হুতামাহ কি? তা তুমি জান না। তা হলো আল্লাহর প্রজ্জ্বলিত হুতাশন। যা হৃদয়কে গ্রাস করবে। জ্বালিয়ে তাদেরকে ভষ্ম করে দিবে, কিন্তু তারা মৃত্যুবরণ করবে না। হযরত সাবিত বানানী (রঃ) এ আয়াত তিলাওয়াত করে যখন এর অর্থ বর্ণনা করতেন তখন কেঁদে ফেলতেন এবং বলতেনঃ “আল্লাহর আযাব তাদেরকে ভীষণ যন্ত্রণা দিয়েছে।” মুহাম্মদ ইবনে কা'ব (রঃ) বলেনঃ প্রজ্জ্বলিত আগুন কণ্ঠনালী পর্যন্ত পৌঁছে যায়, তারপর ফিরে আসে, আবার পৌঁছে। আল্লাহ তা'আলা বলেনঃ এ আগুন তাদের উপর আবদ্ধ করে দেয়া হবে সুদীর্ঘ স্তম্ভসমূহের মধ্যে। সূরা বালাদ’ এর তাফসীরেও এ ধরণের বর্ণনা উল্লেখ করা হয়েছে। একটি মারফু হাদীসেও এ রকম বর্ণনা রয়েছে। আগুনের স্তম্ভের মধ্যে লম্বা লম্বা দরজা রয়েছে। হযরত ইবনে মাসউদের (রাঃ) কিরআত (আরবি)  রয়েছে। ঐ সব জাহান্নামীদের স্কন্ধে শিকল বাধা থাকবে। লম্বা লম্বা স্তম্ভের মধ্যে আবদ্ধ করে তাদের উপর থেকে দরজা বন্ধ করে দেয়া হবে। সেই আগুনের স্তম্ভের মধ্যে তাদেরকে নিকৃষ্ট ধরনের শাস্তি দেয়া হবে। আবু সালিহ (রঃ) বলেন যে, এর ভাবার্থ হচ্ছেঃ তাদের জন্যে ভারী বেড়ী এবং শিকল থাকবে। তাতে তাদেরকে বন্দী করে দেয়া হবে।</p>"
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 15,
        "text": "وقوله: ( فِي عَمَدٍ مُمَدَّدَةٍ ) اختلفت القرّاء في قراءة ذلك, فقرأته عامة قرّاء المدينة والبصرة: ( فِي عَمَدٍ ) بفتح العين والميم. وقرأ ذلك عامة قرّاء الكوفة: \" فِي عُمُدٍ\" بضم العين والميم. والقول في ذلك عندنا أنهما قراءتان معروفتان, قد قرأ بكل واحدة منهما علماء من القرّاء, ولغتان صحيحتان. والعرب تجمع العمود: عُمُدا وعَمَدا, بضم الحرفين وفتحهما, وكذلك تفعل في جمع إهاب, تجمعه: أُهُبا, بضم الألف والهاء, وأَهَبا بفتحهما, وكذلك القضم, فبأيتهما قرأ القارئ فمصيب.واختلف أهل التأويل في معنى ذلك, فقال بعضهم: (إنها عليهم مؤصدة بعمد ممددة ) أي مغلقة مطبقة عليهم, وكذلك هو في قراءة عبد الله فيما بلغنا.حدثنا ابن حميد, قال: ثنا مهران, عن سفيان, عن قتادة, في قراءة عبد الله: \" إنها عَلَيْهِمْ مُؤْصَدَةٍ بِعَمَدٍ مُمَدَّدَةٍ\".وقال آخرون: بل معنى ذلك: إنما دخلوا في عمد, ثم مدت عليهم تلك العمد بعماد.* ذكر من قال ذلك:حدثني محمد بن سعد, قال: ثني أبي, قال: ثني عمي, قال: ثني أبي, عن أبيه, عن ابن عباس ( فِي عَمَدٍ مُمَدَّدَةٍ ) قال: أدخلهم في عمد, فمدت عليهم بعماد, وفي أعناقهم السلاسل, فسدّت بها الأبواب.حدثني يونس, قال: أخبرنا ابن وهب, قال: قال ابن زيد ( فِي عَمَدٍ ) من حديد مغلولين فيها, وتلك العمد من نار قد احترقت من النار, فهي من نار ( مُمَدَّدَةٍ ) لهم.وقال آخرون: هي عمد يعذّبون بها.* ذكر من قال ذلك:حدثنا بشر, قال: ثنا يزيد, قال: ثنا سعيد, عن قتادة ( فِي عَمَدٍ مُمَدَّدَةٍ ) كُنَّا نحدَّث أنها عمد يعذّبون بها في النار, قال بشر: قال يزيد: في قراءة قتادة: ( عَمَدٍ ) .حدثنا ابن حميد, قال: ثنا مهران, عن سعيد, عن قتادة ( فِي عَمَدٍ مُمَدَّدَةٍ ) قال: عمود يعذبون به في النار.وأولى الأقوال بالصواب في ذلك قول من قال: معناه: أنهم يعذّبون بعمد في النار, والله أعلم كيف تعذيبه إياهم بها, ولم يأتنا خبر تقوم به الحجة بصفة تعذيبهم بها, ولا وضع لنا عليها دليل, فندرك به صفة ذلك, فلا قول فيه, غير الذي قلنا يصحّ عندنا, والله أعلم.آخر تفسير سورة الهمزة"
      },
      {
        "resource_id": 381,
        "text": "<p><b> নামকরণ: </b></p><p>هُمَزَةٍ বলা হয় ঐ ব্যক্তিকে যে মানুষের দোষ-ত্রুটি বলে বেড়ায় এবং কাজ ও ইশারায় অন্যের ওপর অপবাদ দেয়। আবার বলা হয় هُمَزَةٍ ঐ ব্যক্তি যে মুখোমুখি মানুষের নিন্দা করে। প্রথম আয়াতে উল্লিখিত هُمَزَةٍ শব্দ থেকেই উক্ত নামে সূরার নামকরণ করা হয়েছ। সূরায় পরনিন্দাকারী ও অর্থলিপ্সুদের দুর্ভোগ ও আখিরাতের শাস্তির বর্ণনা এসেছে।</p><p>هُمَزَةٍ এর শাব্দিক আলোচনা ওপরে করা হয়েছে। আর لمزة বলা হয় ঐ ব্যক্তিকে যে পশ্চাতে পরনিন্দা করে। এ-সব পশ্চাতে ও সম্মুখে নিন্দাকারী ব্যক্তিরাই সম্পদ জমা করে ও গণনা করে। অর্থাৎ সম্পদ থেকে সাধারণ দান সাদকাহ তো দূরের কথা ফরয যাকাতও আদায় করে না। এজন্যই আল্লাহ তা‘আলা তাদের এত বড় দুর্ভোগের কথা বলেছেন। নচেৎ সাধারণভাবে সম্পদ সঞ্চয় করা কোন নিন্দনীয় বিষয় নয়। যেমন আল্লাহ তা‘আলা সম্পদ জমাকারীকে তিরস্কার করে বলেন :</p><p class='arabic uthmani'>(وَجَمَعَ فَأَوْعٰي)‏</p><p>“সে সম্পদ জমা করেছে এবং সংরক্ষিত করে রেখেছে।” (সূরা মাআরিজ ৭০ : ১৮)</p><p class='arabic uthmani'>(أَنَّ مَالَه۫ أَخْلَدَه۫)</p><p>অর্থাৎ তার বিশ্বাস তার জমাকৃত সম্পদ তাকে মরতে দেবে না, সর্বদা জীবিত রাখবে। সুতরাং অত্র আয়াতে পুঁজিবাদ ও পুঁজিবাদী অর্থনীতিতে বিশ্বাসীদের তীব্র প্রতিবাদ করা হয়েছে। অন্যায়ভাবে মানুষের সম্পদ ছিনিয়ে সম্পদের পাহাড় গড়ে তোলার পরিণাম ভাল নয়। তাই যারা দুনিয়াবী স্বার্থকে প্রাধান্য দিয়ে কেবল সম্পদ জমা করবে কিন্তু তার হক আদায় করবে না তাদের জন্য কঠিন শাস্তি রয়েছে। আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(وَالَّذِيْنَ يَكْنِزُوْنَ الذَّهَبَ وَالْفِضَّةَ وَلَا يُنْفِقُوْنَهَا فِيْ سَبِيْلِ اللّٰهِ لا فَبَشِّرْهُمْ بِعَذَابٍ أَلِيْمٍ)</p><p>“আর যারা স্বর্ণ ও রৌপ্য পুঞ্জীভূত করে এবং সেটা আল্লাহর পথে ব্যয় করে না তাদেরকে যন্ত্রণাদায়ক শাস্তির সুসংবাদ দাও।” (সূরা তাওবা ৯: ৩৪)</p><p>كَلَّا অর্থাৎ সে যেমন বিশ্বাস করছে মূলত বিষয়টি তেমন নয়। সম্পদ তাকে মৃত্যু থেকে বাঁচাতে পারবে না। বরং যত সম্পদের অধিকারী হোক না কেন অবশ্যই তাকে দুনিয়া ছেড়ে চলে যেতে হবে।</p><p>الْـحُطَمَةِ জাহান্নামের অন্যতম একটি নাম। হুতামাহ অর্থ ভেঙ্গে চূরমার করা। হুতামার পরিচয় উল্লেখ করে আল্লাহ তা‘আলা বলেন :</p><p class='arabic uthmani'>(نَارُ اللّٰهِ الْمُوْقَدَة)</p><p>“এটা আল্লাহর প্রজ্জ্বলিত অগ্নি”।</p><p>(تَطَّلِعُ عَلَي الْأَفْئِدَةِ)</p><p>মুহাম্মাদ বিন কাব (রহঃ) বলেন: আগুন সারা শরীর খেয়ে ফেলবে এমনকি যখন তা অন্তরসহ কণ্ঠনালী পর্যন্ত পৌঁছে যাবে তখন পুনরায় আবার শরীরের দিকে ফিরে আসবে। তারা এ আগুনে বন্দি হয়ে থাকবে, সেখান থেকে বের হওয়ার ব্যাপারে নিরাশ হয়ে যাবে।</p><p>مُوْقَدَةُ অর্থ مغلقة বা বন্ধ, পরিবেষ্টিত। অর্থাৎ জাহান্নামের সকল দরজা ও পথ বন্ধ করে দেয়া হবে এবং তাদেরকে লোহার পেরেকের সাথে বেঁধে দেয়া হবে যা লম্বা লম্বা স্তম্ভের মত। যার ফলে জাহান্নাম থেকে বের হওয়ার ব্যাপারে নিরাশ হয়ে যাবে।</p><p>আল্লাহ তা‘আলা বলেন :</p><p class='arabic uthmani'>(وَأَمَّا الَّذِيْنَ فَسَقُوْا فَمَأْوٰهُمُ النَّارُ ط كُلَّمَآ أَرَادُوْآ أَنْ يَّخْرُجُوْا مِنْهَآ أُعِيْدُوْا فِيْهَا وَقِيْلَ لَهُمْ ذُوْقُوْا عَذَابَ النَّارِ الَّذِيْ كُنْتُمْ بِه۪ تُكَذِّبُوْنَ ‏)</p><p>“আর যারা পাপ কাজ করেছে তাদের বাসস্থান হবে জাহান্নাম। যখনই তারা সেখান থেকে বের হতে চাইবে, তখনই তাদেরকে সেথায় ফিরিয়ে দেওয়া হবে এবং তাদেরকে বলা হবে, আগুনের স্বাদ গ্রহণ (শাস্তি ভোগ) কর যা তোমরা মিথ্যা প্রতিপন্ন করতে।” (সূরা সাজদাহ ৩২: ২০)</p><p>অর্থাৎ জাহান্নামে লম্বা লম্বা খুঁটি থাকবে যাতে বেধে জাহান্নামীদের শাস্তি দেয়া হবে। ইবনু আব্বাস (রাঃ) বলেন : তাদেরকে জাহান্নামে প্রবেশ করানো হবে। তারপর খুঁটির সাথে বাঁধা হবে এবং গলায় বেড়ী পরানো হবে। অতঃপর জাহান্নামের দরজা বন্ধ করে দেওয়া হবে। (ইবনু কাসীর) সুতরাং পরনিন্দা ও অর্থলিপ্সু হওয়া থেকে সাবধান।</p><p><b> সূরা হতে শিক্ষণীয় বিষয়: </b></p><p>১. যারা পশ্চাতে ও সম্মুখে পরনিন্দা করে তাদের পরিণতি ভয়াবহ।</p><p>২. সম্পদের যাকাত আদায় না করে সঞ্চয় করতঃ হিসাব কষা ভয়াবহ অপরাধ।</p><p>৩. জাহান্নামের আগুনের প্রখরতা সম্পর্কে জানলাম।</p>"
      },
      {
        "resource_id": 90,
        "text": "أي موصدة بعمد ممددة ; قاله ابن مسعود ; وهي في قراءته بعمد ممددة في حديث أبي هريرة عن النبي - صلى الله عليه وسلم - ( ثم إن الله يبعث إليهم ملائكة بأطباق من نار ، ومسامير من نار وعمد من نار ، فتطبق عليهم بتلك الأطباق ، وتشد عليهم بتلك المسامير ، وتمد بتلك العمد ، فلا يبقى فيها خلل يدخل فيه روح ، ولا يخرج منه غم ، وينساهم الرحمن على عرشه ، ويتشاغل أهل الجنة بنعيمهم ، ولا يستغيثون بعدها أبدا ، وينقطع الكلام ، فيكون كلامهم زفيرا وشهيقا ; فذلك قوله تعالى : إنها عليهم مؤصدة في عمد ممددة . وقال قتادة : عمد يعذبون بها . واختاره الطبري . وقال ابن عباس : إن العمد الممددة أغلال في أعناقهم . وقيل : قيود في أرجلهم ; قاله أبو صالح . وقال القشيري : والمعظم على أن العمد أوتاد الأطباق التي تطبق على أهل النار . وتشد تلك الأطباق بالأوتاد ، حتى يرجع عليهم غمها وحرها ، فلا يدخل عليهم روح . وقيل : أبواب النار مطبقة عليهم وهم في عمد ; أي في سلاسل وأغلال مطولة ، وهي أحكم وأرسخ من القصيرة . وقيل : هم في عمد ممددة ; أي في عذابها وآلامها يضربون بها . وقيل : المعنى في دهر ممدود ; أي لا انقطاع له . وقرأ حمزة والكسائي وأبو بكر عن عاصم ( في عمد ) بضم العين والميم : جمع عمود . وكذلك عمد أيضا .قال الفراء : والعمد والعمد : جمعان صحيحان لعمود ; مثل أديم وأدم وأدم ، وأفيق وأفق وأفق . أبو عبيدة : عمد : جمع عماد ; مثل إهاب . واختار أبو عبيد عمد بفتحتين . وكذلك أبو حاتم ; اعتبارا بقوله تعالى : رفع السماوات بغير عمد ترونها . وأجمعوا على فتحها . قال الجوهري : العمود : عمود البيت ، وجمع القلة : أعمدة ، وجمع الكثرة عمد ، وعمد ; وقرئ بهما قوله تعالى : في عمد ممددة . وقال أبو عبيدة : العمود ، كل مستطيل من خشب أو حديد ، وهو أصل للبناء مثل العماد . عمدت الشيء فانعمد ; أي أقمته بعماد يعتمد عليه وأعمدته جعلت تحته عمدا والله أعلم ."
      },
      {
        "resource_id": 14,
        "text": "قوله تعالى \"في عمد ممددة\" قال عطية العوفي عمد من حديد وقال السدي من نار وقال شبيب بن بشر عن عكرمة عن ابن عباس \"في عمد ممددة\" يعني الأبواب هي الممددة وقال فتادة في قراءة عبدالله بن مسعود إنها عليهم مؤصدة بعمد ممددة وقال العوفي عن ابن عباس أدخلهم في عمد ممددة عليهم بعماد في أعناقهم السلاسل فسدت بها الأبواب وقال قتادة كنا نحدث أنهم يعذبون بعمد في النار واختاره ابن جرير وقال أبو صالح \"في عمد ممددة\" يعني القيود الثقال. آخر تفسير سورة ويل لكل همزة ولله الحمد والمنة."
      },
      {
        "resource_id": 170,
        "text": "Врата Преисподней будут заперты и подперты высокими столбами для того, чтобы мученики не могли выйти оттуда. Всевышний сказал: «Всякий раз, когда они захотят выйти оттуда, их вернут туда, и им будет сказано: “Вкусите мучения в Огне, которые вы считали ложью!”» (32:20). Боже, упаси нас от этого, прости и сохрани!"
      },
      {
        "resource_id": 165,
        "text": "<p>দীর্ঘায়িত স্তম্ভসমূহে। [১]</p><p>[১] مُؤصَدَة অর্থ হল বন্ধ বা পরিবেষ্টিত। অর্থাৎ, জাহান্নামের সকল দরজা ও পথ বন্ধ করে দেওয়া হবে; যাতে সেখান হতে কেউ বের হতে না পারে। তাদেরকে লোহার পেরেকের সাথে বেঁধে দেওয়া হবে; যা লম্বা লম্বা স্তম্ভের মত হবে। কোন কোন উলামার মতে, عَمَد অর্থ হলঃ বেড়ি বা লৌহবেষ্টনী এবং কারো মতে এর অর্থ হল স্তম্ভ বা থাম। যাতে বেঁধে জাহান্নামীদেরকে শাস্তি দেওয়া হবে। <em>(ফাতহুল ক্বাদীর)</em></p>"
      },
      {
        "resource_id": 92,
        "text": "فِي عَمَدٍ مُمَدَّدَةٍ (9)وقوله : { في عمد ممددة } حال : إما من ضمير { عليهم } أي في حال كونهم في عَمَد ، أي موثوقين في عمد كما يوثق المسجون المغلظ عليه من رجليه في فَلْقَة ذاتتِ ثَقب يدخل في رجله أو في عنقه كالقرام . وإمّا حال من ضمير { إنها } ، أي أن النار الموقدة في عمد ، أي متوسطة عَمداً كما تكون نار الشواء إذ توضع عَمَد وتجعل النار تحتها تمثيلاً لأهلها بالشواء .و { عمد } قرأه الجمهور بفتحتين على أنه اسم جمع عمود مثل : أديم وأدم . وقرأه حمزة والكسائي وأبو بكر عن عاصم وخلف «عُمَد» بضمتين وهو جمع عمود ، والعمود : خشبة غليظة مستطيلة .والممدَّدة : المجعولة طويلة جدّاً ، وهو اسم مفعول من مدده ، إذا بالغ في مده ، أي الزيادة فيه .وكل هذه الأوصاف تقوية لتمثيل شدة الإِغلاظ عليهم بأقصى ما يبلغه متعارف الناس من الأحوال ."
      },
      {
        "resource_id": 94,
        "text": "( في عمد ممددة ) قرأ حمزة والكسائي وأبو بكر : ( في عمد ) بضم العين والميم ، وقرأ الآخرون بفتحهما ، كقوله تعالى : رفع السماوات بغير عمد ترونها ( الرعد - 2 ) وهما جميعا جمع عمود ، مثل : أديم وأدم [ وأدم ] ، قاله الفراء .وقال أبو عبيدة : جمع عماد ، مثل : إهاب وأهب وأهب .قال ابن عباس : أدخلهم في عمد فمدت عليهم بعماد .[ وقيل : \" في عمد ممددة ] : في أعناقهم الأغلال السلاسل .[ وقيل : \" هي عمد ممددة \" : على باب جهنم ] ، سدت عليهم بها الأبواب [ لا يمكنهم الخروج ] .وقال قتادة : بلغنا أنها عمد يعذبون بها في النار .وقيل : هي أوتاد الأطباق التي تطبق على أهل النار ، أي أنها مطبقة عليهم بأوتاد ممددة ، وهي في قراءة عبد الله \" بعمد \" بالباء .قال مقاتل : أطبقت الأبواب عليهم ثم سدت بأوتاد من حديد من نار حتى يرجع عليهم غمها وحرها ، فلا يفتح عليهم باب ولا يدخل عليهم روح ، والممددة من صفة العمد ، أي مطولة فتكون أرسخ من القصيرة ."
      }
    ]
  }
]
