[
  {
    "index": 84,
    "sura": 84,
    "verse": 1,
    "tafsirs": [
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 16,
        "text": "إذا السماء تصدَّعت، وتفطَّرت بالغمام يوم القيامة، وأطاعت أمر ربها فيما أمرها به من الانشقاق، وحُقَّ لها أن تنقاد لأمره. وإذا الأرض بُسطت وَوُسِّعت، ودكت جبالها في ذلك اليوم، وقذفت ما في بطنها من الأموات، وتخلَّتْ عنهم، وانقادت لربها فيما أمرها به، وحُقَّ لها أن تنقاد لأمره."
      },
      {
        "resource_id": 91,
        "text": " يقول تعالى مبينًا لما يكون في يوم القيامة من تغير الأجرام العظام: { إِذَا السَّمَاءُ انْشَقَّتْ } أي: انفطرت وتمايز بعضها من بعض، وانتثرت نجومها، وخسف بشمسها وقمرها. "
      },
      {
        "resource_id": 90,
        "text": "سورة الانشقاقمكية في قول الجميع . وهي خمس وعشرون آيةبسم الله الرحمن الرحيمإذا السماء انشقتقوله تعالى : إذا السماء انشقت أي انصدعت ، وتفطرت بالغمام ، والغمام مثل السحاب الأبيض . وكذا روى أبو صالح عن ابن عباس . وروي عن علي - عليه السلام - قال : تشق من المجرة . وقال : المجرة باب السماء . وهذا من أشراط الساعة وعلاماتها ."
      },
      {
        "resource_id": 157,
        "text": "<p>گزشتہ سورت میں ہم نے آسمان کے پھٹنے کی تشریح کی ہے۔ یہاں جو بات اضافی آئی ہے وہ یہ ہے کہ یہ کام اللہ کی اطاعت میں ہوگا۔ اور یہ کہ وہ اس بات کا ذمہ دار اور مستحق ہے کہ ایسا کرے اور اللہ کے اس حق کو ادا کرے کیونکہ اللہ کا حق ہے کہ اس کے احکام کی اطاعت کی جائے۔</p>"
      },
      {
        "resource_id": 94,
        "text": "مكية\"إذا السماء انشقت\"، انشقاقها من علامات القيامة."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 169,
        "text": "<h2>Which was revealed in Makkah</h2><h2>The Prostration of Recitation in Surat Al-Inshiqaq</h2><p>It is reported from Abu Salamah that while leading them in prayer, Abu Hurayrah  recited,</p><div class=\"arabic uthmani\">إِذَا السَّمَآءُ انشَقَّتْ </div><p>(When the heaven is split asunder.) and he prostrated during its recitation. Then when he completed the prayer, he informed them that the Messenger of Allah prostrated during its recitation. This was recorded by Muslim and An-Nasa'i on the authority of Malik. Al-Bukhari recorded from Abu Rafi` that he prayed the Night prayer with Abu Hurayrah) recited,</p><div class=\"arabic uthmani\">إِذَا السَّمَآءُ انشَقَّتْ </div><p>(When the heaven is split asunder.) then he prostrated. So Abu Rafi` said something to him about it (questioning it). Abu Hurayrah replied, \"I prostrated behind Abul-Qasim (the Prophet ), and I will never cease prostrating during its recitation until I meet him.\"</p><div class=\"arabic uthmani\">بِسْمِ اللَّهِ الرَّحْمَـنِ الرَّحِيمِ</div><p>In the Name of Allah, the Most Gracious, the Most Merciful.</p><h2>Splitting the Heavens asunder and stretching the Earth forth on the Day of Resurrection</h2><p>Allah says,</p><div class=\"arabic uthmani\">إِذَا السَّمَآءُ انشَقَّتْ </div><p>(When the heaven is split asunder,) This refers to the Day of Judgement.</p><div class=\"arabic uthmani\">وَأَذِنَتْ لِرَبِّهَا</div><p>(And listens to and obeys its Lord) meaning, it listens to its Lord and obeys His command to split apart. This will occur on the Day of Judgement.</p><div class=\"arabic uthmani\">وَحُقَّتْ</div><p>(and it must do so.) meaning, it is right for it to obey the command of its Lord, because it is great and cannot be rejected, nor overcome. Rather it overpowers everything and everything is submissive to it. Then Allah says,</p><div class=\"arabic uthmani\">وَإِذَا الاٌّرْضُ مُدَّتْ </div><p>(And when the earth is stretched forth,) meaning, when the earth is expanded, spread out and extended. Then He says,</p><div class=\"arabic uthmani\">وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ </div><p>(And has cast out all that was in it and became empty.) meaning, it throws out the dead inside of it, and it empties itself of them. This was said by Mujahid, Sa`id, and Qatadah.</p><div class=\"arabic uthmani\">وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ </div><p>(And listens to and obeys its Lord, and it must do so.) The explanation of this is the same as what has preceded.</p><h2>The Recompense for Deeds is True</h2><p>Allah says,</p><div class=\"arabic uthmani\">يأَيُّهَا الإِنسَـنُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحاً</div><p>(O man! Verily, you are returning towards your Lord with your deeds and actions, a sure returning,) meaning, `verily you are hastening to your Lord and working deeds.'</p><div class=\"arabic uthmani\">فَمُلَـقِيهِ</div><p>(and you will meet.) `Then you will meet that which you did of good or evil.' A proof for this is what Abu Dawud At-Tayalisi recorded from Jabir, that the Messenger of Allah said,</p><div class=\"arabic uthmani\">«قَالَ جِبْرِيلُ: يَا مُحَمَّدُ، عِشْ مَا شِئْتَ فَإِنَّكَ مَيِّتٌ، وَأَحْبِبْ (مَنْ) شِئْتَ فَإِنَّكَ مُفَارِقُهُ، وَاعْمَلْ مَا شِئْتَ فَإِنَّكَ مُلَاقِيه»</div><p>(Jibril said, \"O Muhammad! Live how you wish, for verily you will die; love what you wish, for verily you will part with it; and do what you wish, for verily you will meet it (your deed).) There are some people who refer the pronoun back to the statement \"your Lord.\" Thus, they hold the Ayah to mean, \"and you will meet your Lord.\" This means that He will reward you for your work, and pay you for your efforts. Therefore, both of these two views are connected. Al-`Awfi recorded from Ibn `Abbas that he said explaining,</p><div class=\"arabic uthmani\">يأَيُّهَا الإِنسَـنُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحاً</div><p>(O man! Verily, you are returning towards your Lord with your deeds and actions, a sure returning,) \"Whatever deed you do, you will meet Allah with it, whether it is good or bad.\"</p><h2>The Presentation and the Discussion that will take place during the Reckoning</h2><p>Then Allah says,</p><div class=\"arabic uthmani\">فَأَمَّا مَنْ أُوتِىَ كِتَـبَهُ بِيَمِينِهِ - فَسَوْفَ يُحَاسَبُ حِسَاباً يَسِيراً  </div><p>(Then as for him who will be given his Record in his right hand, he surely, will receive an easy reckoning,) (84:7-8) meaning, easy without any difficulty. This means that he will not be investigated for all the minute details of his deeds. For verily, whoever is reckoned like that, he will certainly be destroyed. Imam Ahmad recorded from `A'ishah that the Messenger of Allah said,</p><div class=\"arabic uthmani\">«مَنْ نُوقِشَ الْحِسَابَ عُذِّب»</div><p>(Whoever is interrogated during the reckoning, then he will be punished.) `A'ishah  then said, \"But didn't Allah say,</p><div class=\"arabic uthmani\">فَسَوْفَ يُحَاسَبُ حِسَاباً يَسِيراً </div><p>(He surely will receive an easy reckoning,)\" The Prophet replied,</p><div class=\"arabic uthmani\">«لَيْسَ ذَاكِ بِالْحِسَابِ، وَلَــكِنْ ذلِكِ الْعَرْضُ، مَنْ نُوقِشَ الْحِسَابَ  يَوْمَ الْقِيَامَةِ عُذِّب»</div><p>(That is not during to the Reckoning, rather it is referring to the presentation. Whoever is interrogated during the Reckoning on the Day of Judgement, then he will be punished.) This Hadith has also been recorded by Al-Bukhari, Muslim, At-Tirmidhi, An-Nasa'i and Ibn Jarir. In reference to Allah's statement,</p><div class=\"arabic uthmani\">وَيَنقَلِبُ إِلَى أَهْلِهِ مَسْرُوراً </div><p>(And will return to his family Masrur!) This means that he will return to his family in Paradise. This was said by Qatadah and Ad-Dahhak. They also said, \"Masrur means happy and delighted by what Allah has given him.\" Allah said;</p><div class=\"arabic uthmani\">وَأَمَّا مَنْ أُوتِىَ كِتَـبَهُ وَرَآءَ ظَهْرِهِ </div><p>(But whosoever is given his Record behind his back,) meaning, he will be given his Book in his left hand, behind his back, while his hand is bent behind him.</p><div class=\"arabic uthmani\">فَسَوْفَ يَدْعُو ثُبُوراً </div><p>(He will invoke destruction,) meaning, loss and destruction.</p><div class=\"arabic uthmani\">وَيَصْلَى سَعِيراً - إِنَّهُ كَانَ فِى أَهْلِهِ مَسْرُوراً </div><p>(And he shall enter a blazing Fire, and made to taste its burning. Verily, he was among his people in joy!) meaning, happy. He did not think about the consequences, nor feared what (future) was in front of him. His light happiness will be followed by long grief.</p><div class=\"arabic uthmani\">إِنَّهُ ظَنَّ أَن لَّن يَحُورَ </div><p>(Verily, he thought that he would never return!) meaning, he used to believe that he would not return to Allah, nor would Allah bring him back (to life) after his death. This was said by Ibn `Abbas, Qatadah and others. Allah then says,</p><div class=\"arabic uthmani\">بَلَى إِنَّ رَبَّهُ كَانَ بِهِ بَصِيراً </div><p>(Yes! Verily, his Lord has been ever beholding him!) meaning, certainly Allah will repeat his creation just as he began his creation, and He will reward him based upon his deeds, whether they were good or bad. He was ever watchful of him, meaning All-Knowing and All-Aware.</p>"
      },
      {
        "resource_id": 14,
        "text": "سورة الانشقاق: قال مالك عن عبدالله بن يزيد عن أبي سلمة أن أبا هريرة قرأ بهم \"إذا السماء انشقت\" فسجد فيها فلما انصرف أخبرهم أن رسول الله صلى الله عليه وسلم سجد فيها رواه مسلم والنسائي من طريق مالك به. وقال البخاري حدثنا أبو النعمان حدثنا معتمر عن أبيه عن بكر عن أبي رافع قال صليت مع أبي هريرة العتمة فقرأ \"إذا السماء انشقت\" فسجد فقلت له فقال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ورواه أيضا عن مسدد عن معتمر به ثم رواه عن مسدد عن يزيد بن زريع عن التيمي عن بكر عن أبي رافع فذكره وأخرج مسلم وأبو داود والنسائي من طرق عن سليمان بن طرخان التيمي به وقد رواه مسلم وأهل السنن من حديث سفيان بن عيينة زاد النسائي وسفيان الثوري كلاهما عن أيوب بن موسى عن عطاء بن ميناء عن أبي هريرة قال سجدنا مع رسول الله صلى الله عليه وسلم في \"إذا السماء انشقت\" و \"اقرأ باسم ربك الذي خلق\" وذلك يوم القيامة."
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  إِذَا السَّمَاءُ انْشَقَّتْ (1)يقول تعالى ذكره: إذا السماء تصدّعت وتقطَّعت فكانت أبوابًا."
      },
      {
        "resource_id": 92,
        "text": "إِذَا السَّمَاءُ انْشَقَّتْ (1) قدم الظرف { إذا السماء انشقت } على عامله وهو { كادح } للتهويل والتشويق إلى الخبر وأول الكلام في الاعتبار : يا أيها الإِنسان إنك كادح إذا السماء انشقت الخ .ولكن لما تعلق { إذا } بجزء من جملة { إنك كادح } وكانت { إذا } ظرفاً متضمناً معنى الشرط صار : يا أيها الإنسان إنك كادح جواباً لشرط { إذا } ولذلك يقولون { إذا } ظرف خافض لشرطه منصوب بجوابه ، أي خافض لجملة شرطه بإضافته إليها منصوباً بجوابه لتعلقه به فكلاهما عامل ومعمول باختلاف الاعتبار .و { إذا } ظرف للزمان المستقبل ، والفعل الذي في الجملة المضافة إليه { إذا } مؤول بالمستقبل وصيغ بالمضيّ للتنبيه على تحقق وقوعه لأن أصل { إذا } القطع بوقوع الشرط .وانشقت مطاوع شَقَّها ، أي حين يشقُّ السماءَ شَاق فتنشق ، أي يريد الله شقها فانشقت كما دل عليه قوله بعده"
      },
      {
        "resource_id": 93,
        "text": "قوله : ( انشقت ) من الانشقاق بمعنى الانفطار والتصدع ، بحيث تتغير هيئتها . ويختل نظامها . كما قال - تعالى - : ( يَوْمَ تُبَدَّلُ الأرض غَيْرَ الأرض والسماوات وَبَرَزُواْ للَّهِ الواحد الْقَهَّارِ ) وانشقاق السماء قد ورد فى آيات متعددة منها قوله - تعالى - : ( وَيَوْمَ تَشَقَّقُ السمآء بالغمام ) وقوله - سبحانه - : ( فَإِذَا انشقت السمآء فَكَانَتْ وَرْدَةً كالدهان )"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 1{ اِذَا السَّمَآئُ انْشَقَّتْ۔ } ”جب آسمان پھٹ جائے گا۔“ نوٹ کیجیے ! ان تمام سورتوں کا بنیادی موضوع ”تذکیر آخرت“ ہے۔</p>"
      },
      {
        "resource_id": 160,
        "text": "<p>زمین مردے اگل دے گی اللہ تعالیٰ فرماتا ہے کہ قیامت کے دن آسمان پھٹ جائے گا وہ اپنے رب کے حکم پر کاربند ہونے کے لیے اپنے کان لگائے ہوئے ہوگا پھٹنے کا حکم پاتے ہی پھٹ کر ٹکڑے ٹکڑے ہوجائیگا اسے بھی چاہیے کہ امر اللہ بجا لائے اس لیے کہ یہ اس اللہ کا حکم ہے جسے کوئی روک نہیں سکتا جس سے بڑا اور کوئی نہیں جو سب پر غالب ہے اس پر غالب کوئی نہیں، ہر چیز اس کے سامنے پست و لاچار ہے بےبس و مجبور ہے اور زمین پھیلا دی جائیگی بچھا دی جائیگی اور کشادہ کردی جائیگی۔ حدیث میں ہے قیامت کے دن اللہ تعالیٰ زمین کو چمڑے کی طرح کھینچ لے گا یہاں تک کہ ہر انسان کو صرف دو قدم ٹکانے کی جگہ ملے گی سب سے پہلے مجھے بلایا جائیگا حضرت جبرائیل ؑ اللہ تعالیٰ کی دائیں جانب ہوں گے اللہ کی قسم اس سے پہلے اس نے کبھی اسے نہیں دیکھا تو میں کہوں گا اللہ جبرائیل نے مجھ سے کہا تھا کہ یہ تیرے بھیجے ہوئے میرے پاس آتے ہیں اللہ فرمائے گا سچ کہا تو میں کہوں گا اللہ پھر مجھے شفاعت کی اجازت ہو چناچہ مقام محمود میں کھڑا ہو کر میں شفاعت کروں گا اور کہوں گا کہ اللہ تیرے ان بندوں نے زمین کے گوشتے گوشتے پر تیری عبادت کی ہے (ابن جریر) پھر فرماتا ہے کہ زمین اپنے اندر کے کل مردے اگل دے گی اور خالی ہو جایئگی یہ بھی رب کے فرمان کی منتظر ہوگی اور اسے بھی یہی لائق ہے پھر ارشاد ہوتا ہے کہ اے انسان تو کوشش کرتا رہیگا اور اپنے رب کی طرف آگے بڑھتا رہیگا اعمال کرتا رہیگا یہاں تک کہ ایک دن اس سے مل جائیگا اور اس کے سامنے کھڑا ہوگا اور اپنے اعمال اور اپنی سعی و کوشش کو اپنے سامنے دیکھ لے گا ابو داؤد طیالسی میں ہے کہ حضرت جبرائیل ؑ نے فرمایا اے محمد ﷺ جی لے جب تک چاہے بالآخر موت آنے والی ہے جس سے چاہ و دل بستگی پیدا کرلے ایک دن اس سے جدائی ہونی ہے جو چاہے عمل کرلے ایک دن اس کی ملاقات ہونے والی ہے، ملاقیہ کی ضمیر کا مرجع بعض نے لفظ رب کو بھی بتایا ہے تو معنی یہ ہوں گے کہ اللہ سے تیری ملاقات ہونے والی ہے وہ تجھے تیرے کل اعمال کا بدلہ دے گا اور تیری تمام کوشش و سعی کا پھل تجھے عطا فرمائے گا دونوں ہی باتیں آپس میں ایک دوسری کو لازم و ملزوم ہیں قتادہ فرماتے ہیں کہ اے ابن آدم تو کوشش کرنے والا ہے لیکن اپنی کوشش میں کمزور ہے جس سے یہ ہو سکے کہ اپنی تمام تر سعی و کوشش نیکیوں کی کرے تو وہ کرلے دراصل نیکی کی قدرت اور برائیوں سے بچنے کی طاقت بجز امداد الٰہی حاصل نہیں ہوسکتی۔ پھر فرمایا جس کے داہنے ہاتھ میں اس کا اعمال نامہ مل جائیگا اس کا حساب سختی کے بغیر نہایت آسانی سے ہوگا اس کے چھوٹے اعمال معاف بھی ہوجائیں گے اور جس سے اس کے تمام اعمال کا حساب لیا جائیگا وہ ہلاکت سے نہ بچے گا جناب رسول اللہ ﷺ فرماتے ہیں کہ جس سے حساب کا مناقشہ ہوگا وہ تباہ ہوگا تو حضرت عائشہ نے فرمایا قرآن میں تو ہے کہ نیک لوگوں کا بھی حساب ہوگا آیت (فَسَوْفَ يُحَاسَبُ حِسَابًا يَّسِيْرًا ۙ) 84۔ الانشقاق :8) آپ نے فرمایا دراصل یہ وہ حساب نہیں یہ تو صرف پیشی ہے جس سے حساب میں پوچھ گچھ ہوگی وہ برباد ہوگا (مسند احمد) دوسری روایت میں ہے کہ یہ بیان فرماتے ہوئے آپ نے اپنی انگلی اپنے ہاتھ پر رکھ کر جس طرح کوئی چیز کریدتے ہیں اس طرح اسے ہلا جلا کر بتایا مطلب یہ ہے کہ جس سے باز پرس اور کرید ہوگی وہ عذاب سے بچ نہیں سکتا خود حضرت عائشہ ؓ سے مروی ہے کہ جس سے باقاعدہ حساب ہوگا وہ تو بےعذاب پائے نہیں رہ سکتا اور حساب یسیر سے مراد صرف پیشی ہے حالانکہ اللہ خوب دیکھتا رہا ہے حضرت صدیقہ سے مروی ہے کہ میں نے ایک مرتبہ حضور ﷺ سے سنا کہ آپ نماز میں یہ دعا مانگ رہے تھے دعا (اللھم حاسبنی حسابا یسیرا) جب آپ فارغ ہوئے تو میں نے پوچھا حضور ﷺ یہ آسان حساب کیا ہے ؟ فرمایا صرف نامہ اعمال پر نظر ڈال لی جائیگی اور کہہ دیا جائیگا کہ جاؤ ہم نے درگذر کیا لیکن اے عائشہ جس سے اللہ حساب لینے پر آئے گا وہ ہلاک ہوگا (مسند احمد) غرض جس کے دائیں ہاتھ میں نامہ اعمال آئیگا وہ اللہ کے سامنے پیش ہوتے ہی چھٹی پا جائے گا اور اپنے والوں کی طرف خوش خوش جنت میں واپس آئیگا، طبرانی میں ہے رسول اللہ ﷺ فرماتے ہیں تم لوگ اعمال کر رہے ہو اور حقیقت کا علم کسی کو نہیں عنقریب وہ وقت آنے والا ہے کہ تم اپنے اعمال کو پہچان لو گے بعض وہ لوگ ہوں گے جو ہنسی خوشی اپنوں سے آ ملیں گے اور بعض ایسے ہوں کہ رنجیدہ افسردہ اور ناخوش واپس آئیں گے اور جسے پیٹھ پیچھے سے بائیں ہاتھ میں ہاتھ موڑ کر نامہ اعمال دیا جائیگا وہ نقصان اور گھاٹے کی پکار پکارے گا ہلاکت اور موت کو بلائے گا اور جہنم میں جائیگا دنیا میں خوب ہشاش بشاش تھا بےفکری سے مزے کر رہا تھا آخرت کا خوف عاقبت کا اندیشہ مطلق نہ تھا اب اس کو غم و رنج، یاس محرومی و رنجیدگی اور افسردگی نے ہر طرف سے گھیر لیا یہ سمجھ رہا تھا کہ موت کے بعد زندگی نہیں۔ اسے یقین نہ تھا کہ لوٹ کر اللہ کے پاس بھی جانا ہے پھر فرماتا ہے کہ ہاں ہاں اسے اللہ ضرور دوبارہ زندہ کر دے گا جیسے کہ پہلی مرتبہ اس نے اسے پیدا کیا پھر اس کے نیک و بد اعمال کی جزا و سزا دے گا بندوں کے اعمال و احوال کی اسے اطلاع ہے اور وہ انہیں دیکھ رہا ہے۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>যখন আকাশ বিদীর্ণ হবে। [১]</p><p>[১] অর্থাৎ, যখন কিয়ামত সংঘটিত হবে।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>যখন আকাশ বিদীর্ণ হবে [১] ,</p><p>[১] আর সেটা হবে কিয়ামতের দিন। [ইবন কাসীর]</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>Commentary</p><p>The present Surah depicts the conditions that will prevail on the Day of Judgment, such as reckoning and accountability, reward of good and torment of evil. The heedless man is asked to look into himself and his environs, which will lead him to believe in Allah and the Qur'an. [ The powerful opening of the Surah sketches some of the scenes of universal upheaval ]. First, it speaks about the sky that will split apart. Then it goes on to speak about the earth that will be stretched and will throw up whatever it contains - whether natural treasures, or buried treasures, or dead human bodies, and then it will become empty. A new earth will be prepared for Hashr (Gathering of the Day of Requital). It will have neither caves nor mountains, neither buildings nor trees. It will be flat and smooth. It will be stretched so that there is ample room for the former as well as the latter generations to gather on the plain. This description has been given in other Surahs with different styles, but in the present verses, there is an addition. About what Allah will demonstrate about the heaven and earth on the Day of Judgment, the following comment is made:</p><p>وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (and will listen to (the command of) its Lord, and it ought to,...84:5) The verbَأَذِنَتْ adhinat means 'it will listen'. Here listening includes obedience. The verb huqqat may be interpreted as 'It had an obligation to listen and obey Allah's command'.</p><p>Two Categories of Divine Commands</p><p>The obedience of the heaven and the earth, referred to here, may have two meanings, because the Divine commands are of two kinds: [ 1] the Divinely legislated [ taqdirii ] injunctions; and [ 2] the cosmic and destined [ takwini taqdiri ] commands. In the former case, the command appears as a law the violation of which is punishable. However, men are not practically coerced in the sense that they become practically unable to violate it. Instead, they have their free will to choose whether to abide by the law or to violate it. Such laws are imposed upon those who are endowed with intellect like humans and Jinn. This divides them into believers and non-believers, obedient and disobedient. In the former case, the commands are implemented by force. No one can deviate from them in the least. The entire universe, including humans and Jinn, follow them by force. The cosmic commands [ which Allah has decreed ] are applied forcefully and all the creatures, whether believers or unbelievers, pious or impious, have no choice or will but to do according to that command.</p><p>ذرَّہ ذرَّہ دہر کا پابستہ تقدیر ہے زندگی کے خواب کی جَامی یہی تعبیر ہے</p><p>'Every particle in this world is bound by the Divine Decree.</p><p>Jami, this is the interpretation of the dream of life.'</p><p>It is possible that Allah will, on that day, endow the sky and the earth with special sense and perception like humans and Jinn. When they receive a command from Allah, they, of their own volition choose to act upon it. Alternatively, the command may refer to the second kind, that is, the cosmic command that no one can violate. But the words, وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ \"and will listen to [ the command on its Lord, and it ought to,\" are closer to the first meaning of command, while the second one is possible, if these words are taken in their figurative sense.</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 2,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "\"وأذنت لربها\"، أي سمعت أمر ربها بالانشقاق وأطاعته، من الأذن وهو الاستماع، \"وحقت\"، أي وحق لها أن تطيع ربها."
      },
      {
        "resource_id": 14,
        "text": "\"وأذنت لربها\" أي استمعت لربها وأطاعت أمره فيما أمرها به من الانشقاق وذلك يوم القيامة \"وحقت\" أي وحق لها أن تطيع أمره لأنه العظيم الذي لا يمانع ولا يغالب بل قد قهر كل شيء وذل له كل شيء."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) يقول: وَسَمِعَت السموات في تصدّعها وتشققها لربها وأطاعت له في أمره إياها، والعرب تقول: أذن لك في هذا الأمر أذنًا بمعنى: استمع لك، ومنه الخبر الذي رُوي عن النبيّ صلى الله عليه وسلم : \" مَا أذِنَ اللهُ لِشَيءٍ كأَذَنِهِ لنَبِيّ يَتَغَنَّى بالقُرآنِ\" يعني بذلك: ما استمع الله لشيء كاستماعه لنبيّ يتغنى بالقرآن، ومنه قول الشاعر:صُـمّ إذَا سَـمِعُوا خَـيْرًا ذُكِـرْتُ بِـهِوَإنْ ذُكِــرْتُ بِسُـوءٍ عِنْـدَهُمْ أَذِنُـوا (1)وأصل قولهم في الطاعة سمع له من الاستماع، يقال منه: سمعت لك، بمعنى سمعت قولك، وأطعت فيما قلتَ وأمرت.وبنحو الذي قلنا في معنى قوله: ( وَأَذِنَتْ لِرَبِّهَا ) قال أهل التأويل.* ذكر من قال ذلك:حدثني محمد بن سعد، قال: ثني أبي، قال: ثني عمي، قال: ثني أبي، عن أبيه، عن ابن عباس، قوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) قال: سمعت لربها .حدثنا أبو كريب، قال: ثنا ابن يمان، عن أشعث، عن جعفر، عن سعيد، في قوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) قال: سمعت وأطاعت .حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى؛ وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، في قوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) قال: سمعت .حدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء عن ابن أبي نجيح، عن مجاهد، مثله.حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة، في قوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) قال: سمعت وأطاعت .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) : أي سمعت وأطاعت .حُدثت عن الحسين، قال: سمعت أبا معاذ يقول: ثنا عبيد، قال: سمعت الضحاك يقول في قوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) قال: سمعت وأطاعت .وقوله: ( وَحُقَّتْ ) يقول: وحقق الله عليها الاستماع بالانشقاق والانتهاء إلى طاعته في ذلك.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني محمد بن سعد، قال: ثني أبي، قال: ثني عمي، قال: ثني أبي، عن أبيه، عن ابن عباس، في قوله: ( وَحُقَّتْ ) قال: حُقِّقَت لطاعة ربها.حدثنا ابن حميد، قال: ثنا جرير، عن أشعث بن إسحاق، عن جعفر، عن سعيد بن جُبير ( وَحُقَّتْ ) وحُقّ لها .------------------------الهوامش:(1) البيت لقعنب بن أم صاحب ( اللسان : أذن ) وأورد قبله بيتًا آخر ، وهو :إنْ يسْـمَعُوا رِيبـةً طـارُوا بها فَرَحًامِنِّـي وَمـا عَلمـوا مـن صَالح دَفَنُواوأذن له أذنًا : استمع ، والشاهد عليه بيت قعنب . وفي الحديث : \" ما أذن الله لشيء كاستماعه لنبي يتغنى بالقرآن \" أي : يتلوه يجهر فيه . وقال أبو عبيدة في مجاز القرآن ( 186 ) وأذنت لربها ، أذنت : استمعت ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>এবং তা স্বীয় প্রতিপালকের আদেশে কর্ণপাত করবে।[১] আর এটিই তার কর্তব্য। [২]</p><p>[১] অর্থাৎ, আল্লাহ তাকে ফেটে যাওয়ার যে আদেশ করবেন, তা সে শুনবে ও পালন করবে।</p><p>[২] অর্থাৎ, তার জন্য এটা কর্তব্য যে, সে শ্রবণ করে এবং আনুগত্য করে। এই জন্য যে, তিনি হলেন সবারই উপর প্রভাবশালী এবং সবাই তাঁর আয়ত্তে। কে আছে, যে তাঁর হুকুম অমান্য করতে পারে?</p>"
      },
      {
        "resource_id": 91,
        "text": "{ وَأَذِنَتْ لِرَبِّهَا } أي: استمعت لأمره، وألقت سمعها، وأصاخت لخطابه، وحق لها ذلك، فإنها مسخرة مدبرة تحت مسخر ملك عظيم، لا يعصى أمره، ولا يخالف حكمه. "
      },
      {
        "resource_id": 170,
        "text": "Всевышний сообщил о том, что произойдет с великими созданиями Аллаха в День воскресения. Небо расколется, а его части отделятся друг от друга. Звезды осыплются, солнце и луна затмятся. Тогда небеса выслушают волю своего Господа и внемлют Его словам. Они будут обязаны сделать это, потому что подчиняются великому Владыке и находятся в Его власти. Они не ослушиваются Его приказов и не противятся Его воле."
      },
      {
        "resource_id": 157,
        "text": "<p>واذنت ................ وحقت (2:84) ” اور اپنے رب کے فرمان کی تعمیل کرے گا اور اس کے لئے حق یہی ہے “۔ کہ اپنے رب کے احکام کی تعمیل کرے۔ آسمان کی طرف سے ” اذن “ یعنی اعلان یا اجازت کا مفہوم یہ ہے کہ وہ پھٹنے میں اللہ کے حکم کی تعمیل کرے گا اور حقت کے معنی یہ ہیں کہ اس کے اوپر اللہ کا یہ حق واقع ہوگیا۔ اور اس نے اس بات کا اعتراف کرلیا کہ اس پر اللہ کا یہ حق ہے اور یہ بھی ایک طرح کا اظہار ہے۔ تسلیم اور اطاعت کا کہ یہ اللہ کا مسلمہ حق ہے آسمان پر۔</p>"
      },
      {
        "resource_id": 93,
        "text": "ومعنى \" أذنت \" : استمعت . يقال : أذن له ، بمعنى استمع له بإصغاء تام - وبابه طرب - وفى الحديث الصحيح : \" ما أذن الله لشئ إذنه لنبى يتغنى القرآن \" ، وقال الشاعر :صمٍّ إذا سمعوا خيرا ذكرتُ به ... وإن ذُكِرْتُ بسوء عندهم أذنواوجملة \" وحقت \" معترضة بين المعطوف والمعطوف عليه . أى : إذا السماء تصدعت واختل نظامها ، واستمعت لأمر ربها استماعاً تاما ، وانقادت لحكمة انقياد العبد لسيده ، وجعلت حقيقة وجديرة بالانقياد والاستماع والطاعة فى جميع الأحوال ."
      },
      {
        "resource_id": 92,
        "text": "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (2) : { وأذنت لربها } .والانشقاق هذا هو الانفطار الذي تقدم في قوله : { إذا السماء انفطرت } [ الانفطار : 1 ] وهو انشقاق يلوح للناس في جوّ السماء من جرَّاء اختلال تركيب الكرة الهوائية أو من ظهور أجرام كوكبية تخرج عن دوائرها المعتادة في الجو الأعلى فتنشق القبة الهوائية فهو انشقاق يقع عند اختلال نظام هذا العالم .وقدّم المسند إليه على المسند الفعلي في قوله : { إذا السماء انشقت } دون أن يقال : إذا انشقت السماء لإفادة تقوّي الحكم وهو التعليق الشرطي ، أي إن هذا الشرط محقق الوقوع ، زيادة على ما يقتضيه { إذا } في الشرطية من قصد الجزم بحصول الشرط بخلاف ( إنْ ) .{ وأذنت } ، أي استمعت ، وفِعل أذِن مشتق من اسم جامد وهو اسم الأُذْن بضم الهمزة آلة السمع في الإِنسان يقال أَذِن له كما يقال : استمع له ، أي أصغى إليه أُذنَهُ .وهو هنا مجاز مرسل في التأثر لأمر الله التكويني بأن تنشق . وليس هو باستعارة تبعية ولا تمثيلية .والتعبير ب «ربها» دون غير ذلك من أسماء الله وطرق تعريفه ، لِمَا يؤذن به وصف الرب من الملك والتدبير .وجملة : { وحقت } معترضة بين المعطوفة والمعطوف عليه .والمعنى : وهي محقوقة بأن تَأْذِن لربّها لأنها لا تخرج عن سلطان قدرته وإن عظم سمكها واشتدّ خَلقها وطال زمان رتقها فما ذلك كله إلا من تقدير الله لها ، فهو الذي إذا شاء أزالها .فمتعلّق { حقّت } محذوف دل عليه فعل : { وأذنت لربها } ، أي وحقت بذلك الانقياد والتأثر يقال : حُقَّ فلان بكذا ، أي توجه عليه حقّ . ولما كان فاعل توجيه الحَق غيرَ واضح تعيينُه غالباً ، كان فهل حُقّ بكذا ، مبنياً للمجهول في الاستعمال ، ومرفوعه بمعنى اسم المفعول ، فيقال : حقيق عليه كذا ، كقوله تعالى : { حقيق على أن لا أقول على اللَّه إلا الحق } [ الأعراف : 105 ] وهو محقوق بكذا ، قال الأعشى: ... لمحقُوقه أن تستجيبي لصوتهوأن تعلمي أن المُعان مُوفقُ ..."
      },
      {
        "resource_id": 90,
        "text": "وأذنت لربها وحقت أي سمعت ، وحق لها أن تسمع . روي معناه عن ابن عباس ومجاهد وغيرهما ; ومنه قوله - صلى الله عليه وسلم - : \" ما أذن الله لشيء كإذنه لنبي يتغنى بالقرآن \" أي ما استمع الله لشيء قال الشاعر :صم إذا سمعوا خيرا ذكرت به وإن ذكرت بسوء عندهم أذنوا[ ص: 232 ] أي سمعوا . وقال قعنب بن أم صاحب :إن يأذنوا ريبة طاروا بها فرحا     وما هم أذنوا من صالح دفنواوقيل : المعنى وحقق الله عليها الاستماع لأمره بالانشقاق . وقال الضحاك : حقت : أطاعت ، وحق لها أن تطيع ربها ، لأنه خلقها ; يقال : فلان محقوق بكذا . وطاعة السماء : بمعنى أنها لا تمتنع مما أراد الله بها ، ولا يبعد خلق الحياة فيها حتى تطيع وتجيب . وقال قتادة : حق لها أن تفعل ذلك ; ومنه قول كثير :فإن تكن العتبى فأهلا ومرحبا     وحقت لها العتبى لدينا وقلت"
      },
      {
        "resource_id": 166,
        "text": "<p>আর তার রবের আদেশ পালন করবে এবং এটাই তার করণীয় [১]।</p><p>[১] এখানে কেয়ামতের দিন আকাশ ও পৃথিবীর উপর আল্লাহ্ তা‘আলার কর্তৃত্ব সম্পর্কে বলা হয়েছে, وَاَذِنَتْ لِرَبِّهَا وَحُقَّتْ এর মধ্যে أذنت অর্থ শুনেছে তথা আদেশ পালন করেছে। সে হিসেবে وَاَذِنَتْ لِرَبِّهَا এর শাব্দিক অর্থ হয়, “সে নিজের রবের হুকুম শুনবে।” এর মানে শুধুমাত্র হুকুম শুনা নয় বরং এর মানে সে হুকুম শুনে একজন অনুগতের ন্যায় নির্দেশ পালন করেছে এবং একটুও অবাধ্যতা প্ৰকাশ করেনি। [সা‘দী] আর حُقّت এর অর্থ ‘আদেশ পালন করাই তার ওয়াজিব কর্তব্য ছিল’। কারণ সে একজন মহান বাদশার কর্তৃত্বাধীন ও পরিচালনাধীন। যাদের নির্দেশ অমান্য করা যায় না, আর তার হুকুমের বিপরীত করা যায় না। [ইবন কাসীর; সা‘দী]</p>"
      },
      {
        "resource_id": 16,
        "text": "إذا السماء تصدَّعت، وتفطَّرت بالغمام يوم القيامة، وأطاعت أمر ربها فيما أمرها به من الانشقاق، وحُقَّ لها أن تنقاد لأمره. وإذا الأرض بُسطت وَوُسِّعت، ودكت جبالها في ذلك اليوم، وقذفت ما في بطنها من الأموات، وتخلَّتْ عنهم، وانقادت لربها فيما أمرها به، وحُقَّ لها أن تنقاد لأمره."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 2{ وَاَذِنَتْ لِرَبِّہَا وَحُقَّتْ۔ } ”اور اپنے رب کے حکم کی تعمیل کرے گا اور اسے یہی زیب دیتا ہے۔“ اَذِنَتْ لِرَبِّہَاکا لفظی ترجمہ یوں ہوگا کہ وہ اپنے رب کے حکم پر کان لگائے ہوئے ہے اور جو بات کان لگا کر سنی جائے اس کے مطابق عمل بھی کیا جاتا ہے۔ اَذِنَتْ کا معنی اِسْتَمَعَتْ وَاِنْقَادَتْ کیا گیا ہے۔ یعنی اس نے غور سے سنا اور تعمیل کی۔ حُقَّتْ یہاں مجہول ہے حَقَّ یَحِقُّ سے۔ یعنی وہ اسی لائق ہے اور اس کا فرض ہے کہ وہ بےچون و چرا اپنے خالق کے حکم پر سرتسلیم خم کرے۔</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 3,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 90,
        "text": "وقوله تعالى : وإذا الأرض مدت أي بسطت ودكت جبالها . قال النبي - صلى الله عليه وسلم - : \" تمد مد الأديم \" لأن الأديم إذا مد زال كل انثناء فيه وامتد واستوى . قال ابن عباس وابن مسعود : ويزاد وسعتها كذا وكذا ; لوقوف الخلائق عليها للحساب حتى لا يكون لأحد من البشر إلا موضع قدمه ، لكثرة الخلائق فيها . وقد مضى في سورة ( إبراهيم ) أن الأرض تبدل بأرض أخرى وهي الساهرة في قول ابن عباس على ما تقدم عنه ."
      },
      {
        "resource_id": 168,
        "text": "<p>وَإِذَا الْأَرْضُ مُدَّتْ (and when the earth will be stretched [ to give room to more people ]...84:3) The word madda means 'to stretch, spread, expand out'. Sayyidna Jabir ibn ` Abdullah ؓ narrates that the Holy Prophet said that on the Day of Judgment the earth will be stretched out like leather (or rubber) and expanded into a smooth plain, and there will be just enough space on it for all individuals of human race to keep their feet. To understand this tradition, it is necessary to keep in mind that on the Day of Resurrection all individuals who will have been born from the inception of creation till resurrection will be brought back to life simultaneously. Thus each individual will have just enough space on the earth where he could place his feet. [ Transmitted by Hakim with a good chain of authorities - Mazhari ].</p>"
      },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "\"وإذا الأرض مدت\"، مد الأديم العكاظي، وزيد في سعتها. وقال مقاتل: سويت كمد الأديم، فلا يبقى فيها بناء ولا جبل."
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 14,
        "text": "أي بسطت وفرشت ووسعت قال ابن جرير حدثنا ابن عبدالأعلى حدثنا ابن ثور عن معمر عن الزهري عن علي بن الحسين أن النبي صلى الله عليه وسلم قال \"إذا كان يوم القيامة مد الله الأرض مد الأديم حتى لا يكون لبشر من الناس إلا موضع قدميه فأكون أول من يدعى وجبريل عن يمين الرحمن والله ما رآه قبلها فأقول يا رب إن هذا أخبرني أنك أرسلته إلي فيقول الله عز وجل صدق ثم أشفع فأقول يا رب عبادك عبدوك في أطراف الأرض - قال - وهو المقام المحمود\"."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 16,
        "text": "إذا السماء تصدَّعت، وتفطَّرت بالغمام يوم القيامة، وأطاعت أمر ربها فيما أمرها به من الانشقاق، وحُقَّ لها أن تنقاد لأمره. وإذا الأرض بُسطت وَوُسِّعت، ودكت جبالها في ذلك اليوم، وقذفت ما في بطنها من الأموات، وتخلَّتْ عنهم، وانقادت لربها فيما أمرها به، وحُقَّ لها أن تنقاد لأمره."
      },
      {
        "resource_id": 166,
        "text": "<p>আর যখন যমীনকে সম্প্রসারিত করা হবে [১]।</p><p>[১] مُدّت এর অর্থ টেনে লম্বা করা, ছড়িয়ে দেয়া। [ইবন কাসীর] পৃথিবীকে ছড়িয়ে দেবার মানে হচ্ছে, সাগর নদী ও সমস্ত জলাশয় ভরে দেয়া হবে। পাহাড়গুলো চুৰ্ণবিচূর্ণ করে চারিদিকে ছড়িয়ে দেয়া হবে। পৃথিবীর সমস্ত উঁচু নীচু জায়গা সমান করে সমগ্ৰ পৃথিবীটাকে একটি সমতল প্রান্তরে পরিণত করা হবে। কুরআনের অন্যত্র এই অবস্থাটিকে নিমোক্তভাবে বর্ণনা করা হয়েছে, মহান আল্লাহ্ “তাকে একটা সমতল প্রান্তরে পরিণত করে দেবেন। সেখানে তোমরা কোন উঁচু জায়গা ও ভাঁজ দেখতে পাবে না।” [সূরা ত্ব-হা: ১০৬-১০৭] হাদীসে এসেছে, ‘কেয়ামতের দিন পৃথিবীকে চামড়ার ন্যায় টেনে সম্প্রসারিত করা হবে। তারপর মানুষের জন্য সেখানে কেবলমাত্র পা রাখার জায়গাই থাকবে।” [মুস্তাদরাকে হাকিম: ৪/৫৭১] একথাটি ভালোভাবে বুঝে নেয়ার জন্য এ বিষয়টিও সামনে রাখতে হবে যে, সেদিন সৃষ্টির প্রথম দিন থেকে নিয়ে কিয়ামত পর্যন্ত যত মানুষের জন্ম হয়েছে ও হবে সবাইকে একই সংগে জীবিত করে আল্লাহ্র আদালতে পেশ করা হবে। এ বিরাট জনগোষ্ঠীকে এক জায়গায় দাঁড় করাবার জন্য সমস্ত সাগর, নদী, জলাশয়, পাহাড়, পর্বত, উপত্যকা, মালভূমি, তথা উঁচু-নীচু সব জায়গা ভেঙ্গে-চুরে ভরাট করে সারা দুনিয়াটাকে একটি বিস্তীর্ণ প্রান্তরে পরিণত করা হবে। [দেখুন, ফাতহুল কাদীর; সা‘দী]</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَإِذَا الأرْضُ مُدَّتْ ) يقول تعالى ذكره: وإذا الأرض بُسِطَتْ، فزيدت في سعتها.كالذي حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن الزهريّ، عن عليّ بن حسين، أن النبي صلى الله عليه وسلم قال: \" إذَا كَانَ يَوْمُ الْقِيَامَةِ مَدَّ اللهُ الأرْضَ حَتّى لا يَكُونَ لِبَشَرٍ مِنَ النَّاسِ إلا مَوْضِعُ قَدَمَيْهِ، فَأَكُونَ أوَّلَ مَنْ يُدْعَي، وَجِبْرِيلُ عَنْ يَمِينِ الرَّحْمَنِ، وَاللهِ ما رآهُ قَبْلَهَا، فأقُولُ يَا رَبّ إنَّ هَذَا أخْبَرَنِي أنَّكَ أرْسَلْتَهُ إليَّ، فَيَقُولُ: صَدَقَ، ثُمَّ أشْفَعُ فَأَقُولُ: يَا رَبّ عِبَادُكَ عَبَدُوكَ فِي أطْرَافِ الأرْضِ. - قال-: وَهُوَ المَقَامُ الْمَحْمُودُ\" .حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى، وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، قوله: ( مُدَّتْ ) قال: يوم القيامة ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 93,
        "text": "( وَإِذَا الأرض مُدَّتْ ) أى : بسطت وتساوت بحيث صارت فى مستوى واحد ، بدون ارتفاع فى جانب أو انخفاض فى آخر ، كما قال - تعالى - : ( لاَّ ترى فِيهَا عِوَجاً ولا أَمْتاً )"
      },
      {
        "resource_id": 91,
        "text": "{ وَإِذَا الْأَرْضُ مُدَّتْ } أي: رجفت وارتجت، ونسفت عليها جبالها، ودك ما عليها من بناء ومعلم، فسويت، ومدها الله تعالى مد الأديم، حتى صارت واسعة جدًا، تسع أهل الموقف على كثرتهم، فتصير قاعًا صفصفًا لا ترى فيها عوجًا ولا أمتا. "
      },
      {
        "resource_id": 165,
        "text": "<p>এবং পৃথিবীকে যখন সম্প্রসারিত করা হবে। [১]</p><p>[১] অর্থাৎ, পৃথিবীকে অধিকভাবে লম্বা-চওড়া করে দেওয়া হবে। অথবা উদ্দেশ্য এটা যে, তার উপরে যে পাহাড় ইত্যাদি রয়েছে সমস্তকে চূর্ণ-বিচূর্ণ করে তাকে পরিষ্কার-পরিছন্ন এবং সমতল করে বিছিয়ে দেওয়া হবে। তাতে কোন রকমের উঁচু-নিচু থাকবে না।</p>"
      },
      {
        "resource_id": 92,
        "text": "وَإِذَا الْأَرْضُ مُدَّتْ (3) والقول في جملة : { وإذا الأرض مدت } مثل القول في جملة { إذا السماء انشقت } في تقديم المسند إليه على المسند الفعلي .ومَدّ الأرض : بسطها ، وظاهر هذا أنها يُزال ما عليها من جبال كما يُمد الأديم فتزول انثناءاته كما قال تعالى : { ويسألونك عن الجبال فقل ينسفها ربي نسفاً فيذرها قاعاً صفصفاً لا ترى فيها عوجاً ولا أمتاً } [ طه : 105 107 ] .ومن معاني المدّ أن يكون ناشئاً عن اتساع مساحة ظاهرها بتشققها بالزلازل وبروز أجزاء من باطنها إلى سطحها .ومن معاني المدّ أن يزال تكويرها بتمدد جسمها حتى تصير إلى الاستطالة بعد التكوير . وذلك كله مما يؤذن باختلال نظام سير الأرض وتغير أحوال الجاذبية وما يحيط بالأرض من كرة الهواء فيعقب ذلك زوالُ هذا العالم ."
      },
      {
        "resource_id": 157,
        "text": "<p>واذا الارض مدت (3:84) ” اور جب زمین پھیلا دی جائے گی “۔ یہ بھی ایک جدید منظر اور مفہوم ہے۔ زمین کے پھیلنے اور اس کی لمبائی کا مفہوم کیا ہے ؟ یعنی وہ قوانین قدرت معطل ہوجائیں گے جو اس زمین کو کنٹرول کرتے ہیں اور جو اسے اس کی موجودہ شکل میں قائم رکھتے ہیں۔ یعنی موجودہ گول یا بیضوی شکل میں قائم رکھتے ہیں۔ انداز کلام سے ایسا معلوم ہوتا ہے کہ زمین کے اندر یہ تبدیلی باہر کے عوامل سے پیدا ہوگی کیونکہ اس کے لئے صیغہ مجہول استعمال ہوا ہے یعنی لفظ مدت۔</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 4,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 16,
        "text": "إذا السماء تصدَّعت، وتفطَّرت بالغمام يوم القيامة، وأطاعت أمر ربها فيما أمرها به من الانشقاق، وحُقَّ لها أن تنقاد لأمره. وإذا الأرض بُسطت وَوُسِّعت، ودكت جبالها في ذلك اليوم، وقذفت ما في بطنها من الأموات، وتخلَّتْ عنهم، وانقادت لربها فيما أمرها به، وحُقَّ لها أن تنقاد لأمره."
      },
      {
        "resource_id": 93,
        "text": "( وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ ) أى : وطرحت ما بداخلها من أجساد ومن كنوز ، ومن غيرهما ، وخلت من ذلك خلوا تاما ."
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 94,
        "text": "\"وألقت\"، أخرجت، \"ما فيها\"، من الموتى والكنوز، \"وتخلت\"، خلت منها."
      },
      {
        "resource_id": 92,
        "text": "وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ (4) وقوله : { وألقت ما فيها } صالح للحمل على ما يناسب هذه الاحتمالات في مدّ الأرض ومحتمل لأن تنقذف من باطن الأرض أجزاء أخرى يكون لانقذافها أثر في إتلاف الموجودات مثلُ البراكين واندفاعُ الصخور العظيمة وانفجار العيون إلى ظاهر الأرض فيكون طوفان .{ وتخلت } أي أخرجت ما في باطنها فلما يبق منه شيء لأن فعل تخلّى يدل على قوة الخلوّ عن شيء لما في مادة التفعل من الدلالة على تكلف الفعل كما يقال تكرم فلان إذا بالغ في الإِكرام .والمعنى : إنه لم يبق مما في باطن الأرض شيء كما قال تعالى : { وأخرجت الأرض أثقالها } [ الزلزلة : 2 ] ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "وألقت ما فيها وتخلت أي أخرجت أمواتها ، وتخلت عنهم . وقال ابن جبير : ألقت ما في بطنها من الموتى ، وتخلت ممن على ظهرها من الأحياء . وقيل : ألقت ما في بطنها من كنوزها ومعادنها ، وتخلت منها . أي خلا جوفها ، فليس في بطنها شيء ، وذلك يؤذن بعظم الأمر ، كما تلقي الحامل ما في بطنها عند الشدة . وقيل : تخلت مما على ظهرها من جبالها وبحارها . وقيل : ألقت ما استودعت ، وتخلت مما استحفظت ; لأن الله تعالى استودعها عباده أحياء وأمواتا ، واستحفظها بلاده مزارعة وأقواتا"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 4{ وَاَلْقَتْ مَا فِیْہَا وَتَخَلَّتْ۔ } ”اور وہ نکال باہر کرے گی جو کچھ اس کے اندر تھا اور خالی ہوجائے گی۔“ سورة الزلزال میں یہی بات یوں بیان ہوئی ہے : { وَاَخْرَجَتِ الْاَرْضُ اَثْقَالَھَا۔ } ”اور جب زمین اپنے سارے بوجھ نکال کر باہر پھینک دے گی“۔ قیامت کے دن زمین اپنے اندر مدفون تمام انسانوں کے اجسام اور ان کے تمام اجزاء کو نکال کر باہرکرے گی۔ اس کے علاوہ بھی زمین میں جو کچھ معدنیات اور خزانے مخفی ہیں وہ قیامت کے دن نکال کر باہر پھینک دے گی۔</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 14,
        "text": "أي ألقت ما في بطنها من الأموات وتخلت منهم قاله مجاهد وسعيد وقتادة."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ ) يقول جلّ ثناؤه: وألقت الأرض ما في بطنها من الموتى إلى ظهرها وتخلَّتْ منهم إلى الله.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى، وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، قوله: ( وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ ) قال: أخرجت ما فيها من الموتى .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة ( وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ ) قال: أخرجت أثقالها وما فيها ."
      },
      {
        "resource_id": 168,
        "text": "<p>وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ (and it will throw up whatever it contains, and will become empty...84:4) The earth will, with one convulsion, throw up whatever it contains in its belly, whether natural treasures or buried treasures, or mines, or dead human bodies and their remains and particles.</p>"
      },
      {
        "resource_id": 91,
        "text": "{ وَأَلْقَتْ مَا فِيهَا } من الأموات والكنوز. { وَتَخَلَّتْ } منهم، فإنه ينفخ في الصور، فتخرج الأموات من الأجداث إلى وجه الأرض، وتخرج الأرض كنوزها، حتى تكون كالأسطوان العظيم، يشاهده الخلق، ويتحسرون على ما هم فيه يتنافسون. "
      },
      {
        "resource_id": 165,
        "text": "<p>এবং পৃথিবী তার অভ্যন্তরে যা আছে তা বাইরে নিক্ষেপ করবে এবং খালি হয়ে যাবে। [১]</p><p>[১] অর্থাৎ, তাতে যেসব মুর্দা দাফন থাকবে, সমস্ত জীবিত হয়ে বের হয়ে আসবে। আর যেসব গুপ্ত ধন (খনিজ পদার্থ) তার গর্ভে মজুদ রয়েছে, তা বের করে ফেলবে। আর সে একেবারে খালি হয়ে যাবে।</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>والقت ............................ وتخلت (4:84) ” جو کچھ اس کے اندر ہے اسے باہر پھینک کر خالی ہوجائے گی “۔ یہ ایک ایسی تصویر کشی ہے کہ یہ زمنی گویا ایک زندہ اور صاحب ارادہ چیز ہے ، اور یہ وہ اپنے اندر کی چیزوں کو باہر پھینک کر خالی ہورہی ہے۔ کیونکہ اس کے اندر بہت کچھ ہے۔ مثلاً یہ مخلوقات جن کا گننا مشکل ہے ، جو صدیوں سے اس کے اندر دفن ہورہی ہیں اور نہ اس کے زمانے کا علم ہے اور نہ لوگوں کی تعداد کا۔ زمین کے پیٹ کے اندر جو معدنیات ، پانی اور دوسری چیزیں ہیں جن کا علم صرف اللہ کو ہوے ، سب باہر آجائیں گی۔ صدیوں سے یہ زمین ان چیزوں کو اٹھائے ہوئے ہے۔ جب قیامت برپا ہوگی تو یہ سب چیزوں اور سب رازوں کو اگل دے گی۔</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>আর যমীন তার অভ্যন্তরে যা আছে তা বাইরে নিক্ষেপ করবে ও শূন্যগর্ভ হবে [১]।</p><p>[১] অর্থাৎ পৃথিবী তার গর্ভস্থিত সবকিছু উদগিরণ করে একেবারে শূন্যগর্ভ হয়ে যাবে। পৃথিবীর গর্ভে গুপ্ত ধন-ভাণ্ডার, খনি এবং সৃষ্টির আদি থেকে অন্ত পর্যন্ত মৃত মানুষের দেহকণা ইত্যাদি রয়েছে। যমীন এসব বস্তু আপন গৰ্ভ থেকে বাইরে নিক্ষেপ করবে। অনুরূপভাবে যত মৃত মানুষ তার মধ্যে রয়েছে সবাইকে ঠেলে বাইরে বের করে দেবে। [ফাতহুল কাদীর; সা‘দী]</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 5,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 16,
        "text": "إذا السماء تصدَّعت، وتفطَّرت بالغمام يوم القيامة، وأطاعت أمر ربها فيما أمرها به من الانشقاق، وحُقَّ لها أن تنقاد لأمره. وإذا الأرض بُسطت وَوُسِّعت، ودكت جبالها في ذلك اليوم، وقذفت ما في بطنها من الأموات، وتخلَّتْ عنهم، وانقادت لربها فيما أمرها به، وحُقَّ لها أن تنقاد لأمره."
      },
      { "resource_id": 91, "text": "{ وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ}  " },
      {
        "resource_id": 159,
        "text": "<p>آیت 5{ وَاَذِنَتْ لِرَبِّہَا وَحُقَّتْ۔ } ”اور وہ بھی اپنے رب کے حکم کی تعمیل کرے گی اور اسے یہی زیب دیتا ہے۔“ جس طرح اطاعت وانقیاد کا مظاہرہ آسمان کرے گا ‘ اسی طرح زمین بھی حکم الٰہی بجا لائے گی۔</p>"
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 93, "text": "" },
      {
        "resource_id": 94,
        "text": "( وأذنت لربها وحقت ) واختلفوا في جواب \" إذا \" قيل : جوابه محذوف تقديره : إذا كانت هذه الأشياء يرى الإنسان الثواب والعقاب .وقيل جوابه : \" يا أيها الإنسان إنك كادح \" ومجازه : إذا السماء انشقت لقي كل كادح [ ما ] عمله .وقيل : جوابه : \" وأذنت \" وحينئذ تكون \" الواو \" زائدة ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 92,
        "text": "وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (5) وتقدم الكلام على نظير قوله : { وأذنت لربها وحقت } آنفاً .وجملة : { يا أيها الإنسان إنك كادح } إلى آخره جواب { إذا } باعتبار ما فُرع عليه من قوله : { فملاقيه } ونسب هذا إلى المبرد ، أي لأن المعطوف الأخير بالفاء في الأخبار هو المقصود مما ذكر معه .فالمعنى : إذا السماء انشقت وإذا الأرض مُدّت لاقيتَ ربك أيها الإنسان بعد كدحك لملاقاته فكان قوله : { إنك كادح إدماجاً بمنزلة الاعتراض أمام المقصود .وجوز المبرد أن يكون جواب إذا } محذوفاً دل عليه قوله : { فملاقيه } والتقدير : إذا السماء انشقت إلى آخره لاقيتَ أيها الإنسان ربك .وجوز الفرّاء أن يكون جواب { إذا } قوله { وأذنت لربها } وإن الواو زائدة في الجواب . ورده ابن الأنباري بأن العرب لا تقحم الواو إلا إذا كانت { إذا } بعد ( حتى ) كقوله تعالى : { حتى إذا جاءوها وفتحت أبوابها } [ الزمر : 73 ] أو بعد ( لما ) كقوله تعالى : { فلما أسلما وتله للجبين وناديناه أن يا إبراهيم } [ الصافات : 103 ، 104 ] الآية .وقيل : الجواب : { فأما من أوتي كتابه بيمينه } [ الانشقاق : 7 ] ، ونسب إلى الكسائي واستحسنه أبو جعفر النحاس .والخطاب لجميع الناس فاللام في قوله : { الإنسان } لتعريف الجنس وهو للاستغراق كما دل عليه التفصيل في قوله : { فأما من أوتي كتابه بيمينه إلى قوله : كان به بصيراً } [ الانشقاق : 15 ] .والمقصود الأول من هذا وعيد المشركين لأنهم الذين كذبوا بالبعث . فالخطاب بالنسبة إليهم زيادة للإِنذار ، وهو بالنسبة إلى المؤمنين تذكير وتبشير .وقيل : أريد إنسان معين فقيل : هو الأسود بن عبد الأسد ( بالسين المهملة في «الاستيعاب» و«الإِصابة» ووقع في «الكشاف» بالشين المعجمة كما ضبطه الطيبي وقال هو في «جامع الأصول» بالمهملة ) ، وقيل : أُبيّ بن خلف ، وقد يكون أحدهما سبب النزول أو هو ملحوظ ابتداء ."
      },
      {
        "resource_id": 90,
        "text": "وأذنت لربها أي في إلقاء موتاها ( وحقت ) أي وحق لها أن تسمع أمره . واختلف في جواب ( إذا ) فقال الفراء : أذنت . والواو زائدة ، وكذلك ( وألقت ) . ابن الأنباري : قال بعض المفسرين : جواب إذا السماء انشقت ( أذنت ) ، وزعم أن الواو مقحمة وهذا غلط ; لأن العرب لا تقحم الواو إلا مع ( حتى - إذا ) كقوله تعالى : حتى إذا جاؤوها وفتحت أبوابها ومع ( لما ) كقوله تعالى : فلما أسلما وتله للجبين وناديناه معناه ناديناه والواو لا تقحم مع غير هذين . وقيل : الجواب فاء مضمرة كأنه قال : إذا السماء انشقت فيا أيها الإنسان إنك كادح . وقيل : جوابها ما دل عليه ( فملاقيه ) أي إذا السماء انشقت [ ص: 233 ] لاقى الإنسان كدحه . وقيل : فيه تقديم وتأخير ، أي يا أيها الإنسان إنك كادح إلى ربك كدحا فملاقيه إذا السماء انشقت . قاله المبرد . وعنه أيضا : الجواب فأما من أوتي كتابه بيمينه وهو قول الكسائي ; أي إذا السماء انشقت فمن أوتي كتابه بيمينه فحكمه كذا . قال أبو جعفر النحاس : وهذا أصح ما قيل فيه وأحسنه . قيل : هو بمعنى اذكر إذا السماء انشقت . وقيل : الجواب محذوف لعلم المخاطبين به ; أي إذا كانت هذه الأشياء علم المكذبون بالبعث ضلالتهم وخسرانهم . وقيل : تقدم منهم سؤال عن وقت القيامة ، فقيل لهم : إذا ظهرت أشراطها كانت القيامة ، فرأيتم عاقبة تكذيبكم بها . والقرآن كالآية الواحدة في دلالة البعض على البعض . وعن الحسن : إن قوله إذا السماء انشقت قسم . والجمهور على خلاف قوله من أنه خبر وليس بقسم ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 14,
        "text": "أي استمعت لربها وأطاعت أمره فيما أمرها به."
      },
      {
        "resource_id": 165,
        "text": "<p>এবং তার প্রতিপালকের আদেশে কর্ণপাত করবে।[১] আর এটিই তার কর্তব্য।</p><p>[১] অর্থাৎ, তাকে বের করে এবং খালি করে দেওয়ার যে আদেশ করা হবে, তা সে শ্রবণ ও পালন করবে।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>এবং তার রবের আদেশ পালন করবে এটাই তার করণীয় [১]।</p><p>[১] যখন এসব ঘটনাবলী ঘটবে তখন কি হবে, একথা পরিষ্কার করে বলা হয়নি। কারণ এ পরবর্তী বক্তব্যগুলো নিজে নিজেই তা প্ৰকাশ করে দিচ্ছে। এ বক্তব্যগুলোতে বলা হচ্ছেঃ হে মানুষ! তুমি তোমার রবের দিকে এগিয়ে চলছো। শীঘ্র তাঁর সামনে হাযির হয়ে যাবে। তখন তোমার আমলনামা তোমার হাতে দেয়া হবে। আর তোমার আমলনামা অনুযায়ী তোমাকে পুরস্কার দেয়া হবে। [কুরতুবী] সুতরাং উপরোক্ত ঘটনাবলী ঘটলে কি হবে তা সহজেই বুঝা যায় যে, মানুষ তখন পুনরুথিত হবে। তখন পুনরুত্থানের ব্যাপারে কেউ সন্দেহ পোষণ করবে না। কারণ বাস্তবতা যখন এসে যাবে তখন সন্দেহ করার আর সুযোগ কোথায়?</p>"
      },
      {
        "resource_id": 170,
        "text": "Земля сотрясется и содрогнется, и тогда разрушатся горы, развалятся здания и строения, а поверхность земли станет совершенно ровной. Аллах расширит ее до великих просторов для того, чтобы она вместила многочисленный людской род, и превратит ее в равнину, на которой не удастся найти ни кривизны, ни углубления. Затем она извергнет из своих недр тела усопших и зарытые клады и опустеет. Ангел подует в Рог, и мертвые выйдут из могил на поверхность земли, а земля выбросит на ее поверхность сокрытые в ней сокровища. Они превратятся в огромные колонны, и люди будут сожалеть о том, что потратили свою жизнь ради приобретения этого богатства."
      },
      {
        "resource_id": 157,
        "text": "<p>واذنت ................ وحقت (5:84) ” اور اپنے رب کے حکم کی تعمیل کرے گی اور اس کے لئے حق یہی ہے “۔ اذن کے معنی یہاں اطاعت رب کے ہیں اور اللہ کے احکام کی تعمیل کرنے کے ہیں۔ جس طرح یہ تعبیر آسمان کے لئے بھی تھی۔ مطلب یہ ہے کہ زمین اعتراف کررہی ہوگی ، اللہ کا اس پر حق ہے کہ وہ اللہ کے احکام کے سامنے سر تسلیم خم کرے۔ انداز بیان میں یہ تاثر دیا گیا ہے کہ گویا زمین ، آسمان ، ذی روح مخلوق ہیں۔ یہ اللہ کا حکم سنتے ہیں اور بالا رادہ تعمیل کرتے ہیں ، فوراً لبیک کہتے ہیں اور اس طرح اطاعت کرتے ہیں جس طرح ایک شخص اطاعت کا اقرار واعتراف کرتا ہو اور یہ سمجھتا ہو کہ اس پر ایسا کرنا حق ہے اس لئے وہ سر تسلیم خم کرتا ہو اور بغیر جبر کے یہ کام کرتا ہو اور اس میں کوئی حیل وحجت نہ کرتا ہو۔</p><p>اگرچہ قیام قیامت کے دن اس کائنات میں ایک عظیم انقلاب ہوگا اور یہ اسی کا ایک منظر ہے ، لیکن یہاں جو تصویر کھینچی گئی ہے وہ پروقار اور دھیمی ہے۔ اور اس پر توازن اور خشوع کے گہرے سائے ہیں۔ جو تاثرات پردہ احساس پر قائم رہتے ہیں وہ اطاعت ، تسلیم ورضا ، خضوع وخشوع اور بغیر حیل وحجت اور بغیر قیل وقال اطاعت کیشی کے ہیں۔</p><p>چناچہ ایسی ہی فضا میں باری تعالیٰ کی جانب سے ایک پکار آتی ہے۔ اس میں انسان کو انسانیت کے نام سے پکارا جاتا ہے۔ یہ دکھا کر کہ دیکھو یہ پوری کائنات اور یہ ارض وسما کس طرح سراطاعت خم کیے ہوئے ہیں ، اور اللہ کی اطاعت کو اپنے اوپر حق سمجھتے ہیں۔</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ) يقول: وسمعت الأرض في إلقائها ما في بطنها من الموتى إلى ظهرها أحياء، أمر ربها وأطاعت ( وَحُقَّتْ ) يقول: وحقَّقها الله للاستماع لأمره في ذلك، والانتهاء إلى طاعته.واختلف أهل العربية في موقع جواب قوله: ( إِذَا السَّمَاءُ انْشَقَّتْ ) ، وقوله: ( وَإِذَا الأرْضُ مُدَّتْ ) فقال بعض نحويي البصرة: ( إِذَا السَّمَاءُ انْشَقَّتْ ) على معنى قوله:  يَا أَيُّهَا الإِنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلاقِيهِ  إذا السماء انشقت، على التقديم والتأخير.وقال بعض نحويي الكوفة: قال بعض المفسرين: جواب ( إِذَا السَّمَاءُ انْشَقَّتْ ) قوله: ( وَأَذِنَتْ ) قال: ونرى أنه رأي ارتآه المفسر، وشبَّهه بقول الله تعالى:  حَتَّى إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا  لأنا لم نسمع جوابًا بالواو في إذا مبتدأة، ولا كلام قبلها، ولا في إذا، إذا ابتدئت. قال: وإنما تجيب العرب بالواو في قوله: حتى إذا كان، وفلما أن كان، لم يجاوزوا ذلك؛ قال: والجواب في ( إِذَا السَّمَاءُ انْشَقَّتْ ) وفي ( إِذَا الأرْضُ مُدَّتْ ) كالمتروك؛ لأن المعنى معروف قد تردّد في القرآن معناه، فعرف وإن شئت كان جوابه: يأيُّها الإنسان، كقول القائل: إذا كان كذا وكذا، فيأيها الناس ترون ما عملتم من خير أو شرّ، تجعل  يَا أَيُّهَا الإِنْسَانُ  هو الجواب، وتضمر فيه الفاء، وقد فُسَّر جواب ( إِذَا السَّمَاءُ انْشَقَّتْ ) فيما يلقى الإنسان من ثواب وعقاب، فكأن المعنى: ترى الثواب والعقاب إذا السماء انشقَّتْ.والصواب من القول في ذلك عندنا: أن جوابه محذوف ترك استغناء بمعرفة المخاطبين به بمعناه. ومعنى الكلام: ( إذا السماء انشقت ) رأى الإنسان ما قدّم من خير أو شرّ، وقد بين ذلك قوله:  يَا أَيُّهَا الإِنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلاقِيهِ  والآياتُ بعدها."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 6,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 157,
        "text": "<p>یایھا الانسان (6:84) ” جس کو رب نے مہربان کرکے اس طرح بنایا ، جس کو اللہ نے پوری مخلوقات کے مقابلے میں انسانیت کی منفرت صفت دی۔ اس کو تو یہ چاہئے کہ یہ اپنے رب کی معرفت میں سب سے آگے ہو ، اور اس پوری کائنات اور ارض وسما کے مقابلے میں اللہ کے سامنے زیادہ سرتسلیم خم کرنے والاہو ، اللہ نے اس کے جسم میں اپنی روح پھونکی ، اسے یہ قوت دی اور یہ فہم دیا کہ وہ رب تک رسائی حاصل کرسکے اور اپنے نور کا دیا اس کی ذات میں جلایا ، اور اس کے اندر یہ تڑپ رکھی کہ وہ اللہ کے فیوض حاصل کرے ، اور ان کے ذریعہ روحانی پاکیزگی اختیار کرے اور لامحدود بلندیوں تک عروج حاصل کرے۔ اور اس کمال کی انتہاﺅں تک جاپہنچے جن تک انسان پہنچ سکتا ہے۔ یاد رہے کہ انسانی ترقی اور کمال کے آفاق بہت وسیع ہیں۔</p><p>یایھا الانسان ................................ فملقیہ (6:84) ” اے انسان ! تو کشاں کشاں اپنے رب کی طرف چلا جارہا ہے اور اس سے ملنے والا ہے “۔ اے انسان تو اپنا سفر حیات اس جہاں میں نہایت مشقت کے ساتھ طے کررہا ہے۔ اپنا بوجھ اٹھائے ہوئے ہے ، جدوجہد کررہا ہے ، سانس پھولی ہوئی ہے۔ راستہ دشوار ہے اور اس پر مشقت راستے کو طے کرکے تو پہنچنے والا کہاں ہے ؟ رب کی طرف مرجع ہے اور جائے پناہ درگاہ الٰہی ہی ہے اور تو اس تک اس جدوجہد اور مشقت کے بعد پہنچ رہا ہے۔</p><p>اے انسان ! تو اس جہاں میں اپنی ضروریات زندگی بھی بڑی جدوجہد سے مہیا کررہا ہے۔ اگر کسی کو جسمانی مشقت کرنے کی ضرورت نہیں ہوتی تو فکر معاش اور ذہنی پریشانی ہر کسی کو ہوتی ہے۔ خوشحالی اور غریب دونوں فکر مند ضرور ہوتے ہیں۔ دونوں ہی مشقت کرتے ہیں۔ اگرچہ مشقت کی نوعیت مختلف ہوتی ہے۔ ورنہ مشقت اور جدوجہد انسان کی زندگی کا جزو لاینفک ہے۔ لیکن سرمایہ دار اور نادار دونوں آخر کار اللہ کے ہاں جاپہنچتے ہیں۔</p><p>اے انسان ! اس زمین پر تو ہرگز حقیقی راحت نہ پاسکے گا۔ راحت اور آرام تو آخرت میں ہوں گے لیکن ان کے لئے جو سرتسلیم خم کرتے ہوئے احکام خداوندی کی اطاعت کرتے ہیں اور آخرت کے لئے کچھ کماتے ہیں۔ اس زمین کی مشقت ایک جیسی ہے۔ اگرچہ رنگ مختلف ہوں اور ذائقے الگ ہوں لیکن جب انسان رب تعالیٰ کے ہاں پہنچے گا تو وہاں انجام کا اختلاف حقیقی ہوگا۔ ایک فریق تو اس قدر مشقت میں ہوگا جس سے زمین کی مشقت بہت مختلف اور کم ہے اور دوسرا فریق اس قدر انعام پائے گا کہ ان کے مقابلے میں زمین کی تمام تھکاوٹیں دور ہوجائیں گی۔ یوں محسوس ہوا کہ اس نے کبھی کوئی تکلیف دیکھی ہی نہیں۔ اے انسان ! تجھے تو انسانیت کی صفت دے کر ممتاز کردیا گیا ہے۔ اپنے لئے وہ انجام اور وہ مقام چن لے جو تیری انسانیت کے شایان شان ہو ، جو اس صفت کے مناسب ہو جو اللہ نے تجھے دی ہے۔ وہ آرام اور وہ خوشی اور نعمت طلب کر جو آخرت میں ہے۔</p><p>اس پکار کے اندر ہی چونکہ انسانیت کے انجام کے لئے اشارہ تھا ، اس لئے متصلا یہ بات بھی بتا دی گئی کہ انسانیت اس پر مشقفت جدوجہد کے بعد دونوں انجاموں میں کس انجام تک پہنچے گا۔</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : يا أيها الإنسان إنك كادح إلى ربك المراد بالإنسان الجنس أي يا بن آدم . وكذا روى سعيد عن قتادة : يا بن آدم ، إن كدحك لضعيف ، فمن استطاع أن يكون كدحه في طاعة الله فليفعل ولا قوة إلا بالله . وقيل : هو معين ، قال مقاتل : يعني الأسود بن عبد الأسد ويقال : يعني أبي بن خلف . ويقال : يعني جميع الكفار ، أيها الكافر إنك كادح . والكدح في كلام العرب : العمل والكسب ; قال ابن مقبل :وما الدهر إلا تارتان فمنهما أموت وأخرى أبتغي العيش أكدحوقال آخر :ومضت بشاشة كل عيش صالح     وبقيت أكدح للحياة وأنصبأي أعمل . وروى الضحاك عن ابن عباس : إنك كادح أي راجع إلى ربك كدحا أي رجوعا لا محالة فملاقيه أي ملاق ربك . وقيل : ملاق عملك . القتبي إنك كادح أي عامل ناصب في معيشتك إلى لقاء ربك . والملاقاة بمعنى اللقاء أن تلقى ربك بعملك . وقيل أي تلاقي كتاب عملك ; لأن العمل قد انقضى ولهذا قال :"
      },
      {
        "resource_id": 16,
        "text": "يا أيها الإنسان إنك ساعٍ إلى الله، وعامل أعمالا من خير أو شر، ثم تلاقي الله يوم القيامة، فيجازيك بعملك بفضله أو عدله."
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  يَا أَيُّهَا الإِنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلاقِيهِ (6)يقول تعالى ذكره: يأيُّها الإنسان إنك عامل إلى ربك عملا فملاقيه به خيرًا كان عملك ذلك أو شرًا، يقول: فليكن عملك مما يُنجيك من سُخْطه، ويوجب لك رضاه، ولا يكن مما يُسخطه عليك فتهلك.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني محمد بن سعد، قال: ثني أبي، قال: ثني عمي، قال: ثنى أبي، عن أبيه، عن ابن عباس ( يَا أَيُّهَا الإنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلاقِيهِ ) يقول: تعمل عملا تلقى الله به خيرًا كان أو شرًّا .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( يَا أَيُّهَا الإنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلاقِيهِ ) إن كدحك يا ابن آدم لضعيف، فمن استطاع أن يكون كدحه في طاعة الله فليفعل، ولا قوّة إلا بالله .حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة، في قوله: ( إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا ) قال: عامل له عملا .حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد: وسمعته يقول في ذلك: ( إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا ) قال: عامل إلى ربك عملا قال: كدحا: العمل."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 91,
        "text": "[يَا أَيُّهَاالْإِنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلَاقِيهِ } أي: إنك ساع إلى الله، وعامل بأوامره ونواهيه، ومتقرب إليه إما بالخير وإما بالشر، ثم تلاقي الله يوم القيامة، فلا تعدم منه جزاء بالفضل إن كنت سعيدًا، أو بالعدل إن كنت شقيًا . "
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 6{ یٰٓــاَیُّہَا الْاِنْسَانُ اِنَّکَ کَادِحٌ اِلٰی رَبِّکَ کَدْحًا فَمُلٰقِیْہِ۔ } ”اے انسان ! تو مشقت پر مشقت برداشت کرتے جا رہا ہے اپنے رب کی طرف ‘ پھر تو اس سے ملنے والا ہے۔“ یہ دنیا انسان کے لیے دارالمِحن یعنی مشقتوں کا گھر ہے۔ انسانی زندگی کی اس تلخ حقیقت کو سورة البلد میں یوں بیان فرمایا گیا : { لَقَدْ خَلَقْنَا الْاِنْسَانَ فِیْ کَبَدٍ۔ } کہ انسان تو پیدا ہی مشقت میں کیا گیا ہے۔ گویا مشقتیں برداشت کرنا ‘ دکھ اٹھانا اور سختیاں جھیلنا انسان کا مقدر ہے۔ اس سے کسی انسان کو رستگاری نہیں۔ مزدور ہے تو وہ صبح سے شام تک جسمانی سختیاں سہہ رہا ہے۔ کارخانہ دار ہے تو انتظامی گتھیوں کو سلجھانے میں جگر خون کر رہا ہے۔ اگر کوئی کسی دفتر کی کرسی پر بیٹھا ہے تو ذہنی مشقت کی چکی ّمیں ِپس رہا ہے۔ پھر اپنی اور اہل و عیال کی بیماریاں ‘ معاشی مشکلات ‘ معاشرتی الجھنیں ‘ مال و جان کی حفاظت کی فکر وغیرہ کی صورت میں ذہنی و نفسیاتی پریشانیاں الگ ہیں جو ہر انسان کے گلے کا ہار بنی ہوئی ہیں۔ دوسروں سے مسابقت اور مقابلے کا غم اس کے علاوہ ہے جو ہر انسان نے اپنے دل و دماغ میں کسی نہ کسی سطح پر ضرور پال رکھا ہے۔ پیدل چلنے والا سائیکل سوار کو رشک بھری نظروں سے دیکھتا ہے ‘ سائیکل سوار کار والے کے حسد میں مبتلا ہے۔ چھوٹی کار والا بڑی کار والے سے جلن کا شکار ہے۔ غرض مشقت ‘ تکلیف یا غم کی نوعیت تو مختلف ہوسکتی ہے مگر کوئی انسان ایسا نہیں جو کسی نہ کسی دکھ ‘ پریشانی یا مشقت میں مبتلا نہ ہو۔ ان مشقتوں ‘ تکلیفوں اور پریشانیوں کا سامنا انسان کو روز اوّل سے ہے اور رہتی دنیا تک رہے گا۔ جیتے جی کوئی انسان اس سے چھٹکارا حاصل نہیں کرسکتا۔ مرزا غالب ؔنے اس حوالے سے بڑے پتے کی بات کہی ہے : ؎قید ِحیات و بند ِغم اصل میں دونوں ایک ہیں موت سے پہلے آدمی غم سے نجات پائے کیوں ! ان مشقتوں اور مصیبتوں میں گھری انسانی زندگی کی یہ سختیاں اور پریشانیاں اپنی جگہ ‘ لیکن انسان کا اصل مسئلہ اس سے کہیں زیادہ گھمبیر اور پریشان کن ہے۔ اور وہ مسئلہ ہے کہ : ؎اب تو گھبرا کے یہ کہتے ہیں کہ مرجائیں گے مر کے بھی چین نہ پایا تو کدھر جائیں گے ؟ابراہیم ذوق انسان کے اخروی احتساب کا تصور ذہن میں لائیں اور پھر موازنہ کریں کہ باقی جانداروں کے مقابلے میں ”انسان“ کس قدر مشکل میں ہے۔ ایک بار بردار جانور کی زندگی کا معمول چاہے جتنا بھی مشکل ہو لیکن اس کی مشقت اور تکلیف اس کی زندگی کے ساتھ ختم ہوجاتی ہے۔ ظاہر ہے ایک بیل جب ہل یا رہٹ چلاتے چلاتے مرجاتا ہے تو اس مشقت سے ہمیشہ کے لیے چھوٹ جاتا ہے۔ لیکن اس کے مقابلے میں ایک انسان ہے جو کو فت پر کو فت برداشت کرتا اور تکلیف پر تکلیف جھیلتا جب اس دنیا سے جائے گا تو اسے اپنے رب کے سامنے کھڑے ہو کر اپنی دنیوی زندگی کے ایک ایک پل کا حساب دینا ہوگا۔ اس ضمن میں حضور ﷺ کا فرمان ہے :  لَا تَزُوْلُ قَدَمُ ابْنِ آدَمَ یَوْمَ الْقِیَامَۃِ مِنْ عِنْدِ رَبِّہٖ حَتّٰی یُسْأَلَ عَنْ خَمْسٍ : عَنْ عُمُرِہٖ فِیْمَا اَفْنَاہُ ، وَعَنْ شَبَابِہٖ فِیْمَا اَبْلَاہُ ، وَمَالِہٖ مِنْ اَیْنَ اکْتَسَبَہٗ وَفِیْمَ اَنَفَقَہٗ ، وَمَاذَا عَمِلَ فِیْمَا عَلِمَ 1”ابن آدم کے پائوں قیامت کے روز اپنے رب کے حضور اپنی جگہ سے ہل نہیں سکیں گے جب تک اس سے پانچ چیزوں کا حساب نہ لے لیا جائے : اس کی عمر کے بارے میں کہ کہاں فنا کی ؟ اس کی جوانی کی قوتوں ‘ صلاحیتوں اور امنگوں کے دور کے بارے میں کہ کیسے گزارا ؟ مال کہاں سے کمایا اور کہاں خرچ کیا ؟ حلال ذرائع سے کمایا یا حرام طریقے سے اور اللوں ّتللوں میں خرچ کیا یا ادائے حقوق کے لیے ؟ اور جو علم حاصل ہوا تھا اس پر کتنا عمل کیا ؟“یعنی دنیا میں باربرداری بھی کرو ‘ جسمانی ‘ ذہنی اور نفسیاتی اذیتیں بھی برداشت کرو۔ مال وجان اور اولاد سے متعلق رنگا رنگ صدمے جھیلتے جھیلتے زندگی بھر کانٹوں پر بھی لوٹتے رہو اور پھر مرنے کے بعد ایک ایسی ہستی کے سامنے کھڑے ہو کر پل پل کا حساب بھی دو جس سے تمہارے قلوب و اذہان کی گہرائیوں میں پیدا ہونے والے جذبات و خیالات بھی پوشیدہ نہیں۔ یہ ہے ”انسان“ کی اصل ٹریجڈی !  یہ مرحلہ ایک انسان کے لیے ایسا مشکل ہے کہ اسے یاد کر کے حضرت ابوبکر صدیق رض اکثر رویا کرتے تھے اور کہا کرتے تھے کہ کاش میں ایک چڑیا ہوتا ! دیکھا جائے تو حضور ﷺ کے درج بالا فرمان میں مذکور سوالات میں سے آخری سوال سب سے مشکل ہے۔ جس کسی نے دین اور قرآن کا علم جس قدر زیادہ سیکھا اس کے لیے اس کا حساب دینا اسی قدر مشکل ہوگا۔ اگر کسی انسان تک قرآن کی یہ دعوت پہنچ ہی نہیں پائی تو ممکن ہے کہ اس کی طرف سے کوئی عذر بھی قبول ہوجائے۔ ایسی صورت میں اس کوتاہی کا کچھ نہ کچھ بوجھ ان لوگوں پر بھی ضرور پڑے گا جنہوں نے اسے دعوت پہنچانے میں تساہل برتا لیکن جن لوگوں تک قرآن کی دعوت پہنچ گئی اور انہوں نے اپنی استعداد کے مطابق قرآن کے پیغام کو سمجھ بھی لیا تو ظاہر ہے ان کے لیے اس آخری سوال کا جواب دینا بہت مشکل ہوگا۔</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 93,
        "text": "ثم وجه - سبحانه بعد ذلك نداء للإِنسان ، دعاه فيه إلى طاعته وإخلاص العبادة له ، فقال : ( ياأيها الإنسان إِنَّكَ كَادِحٌ إلى رَبِّكَ كَدْحاً فَمُلاَقِيهِ ) والمراد بالإِنسان هنا : جنسه .وأصل الكدح فى كلام العرب : السعى فى سبيل الحصول على الشئ بجد واجتهاد وعناء .مأخوذ من كدح فلان جلده ، إذا خدشه ، ومنه قول الشاعر :وما الدهر إلا تارتان فمنهما ... أموت ، وأخرى أبتغى العيش أكدحُوقول الآخر :ومضت بشاشة كل عيش صالح ... وبقيت أكدح للحياة وأَنْصِبُأى : وبقيت أسعى سعيا حثيثا للحياة ، وأتعب من أجل الحصول على مطالبى فيها .والضمير فى قوله : ( فَمُلاَقِيهِ ) يعود إلى الله - تعالى - ، ويصح أن يعود للكدح ، بمعنى ملاق جزاء هذا الكدح .والمعنى : يأيها الإِنسان إنك اباذل فى حياتك جهدا كبيرا من أجل مطالب نفسك .وإنك بعد هذا الكدح والعناء . . مصيرك فى النهاية إلى لقاء ربك ، حيث يحاسبك على عملك وكدحك . . فقدم فى دنياك الكدح المشروع ، والعمل الصالح .والسعى الحثيث فى طاعته - تعالى - ، لكى تنال ثواب ربك ورضاه .قال ابن كثير : وقوله : ( ياأيها الإنسان إِنَّكَ كَادِحٌ إلى رَبِّكَ كَدْحاً ) أى : ساع إلى ربك سعيا ، وعامل عملا ( فَمُلاَقِيهِ ) ثم إنك ستلقى ما عملت من خير أو شر .ويشهد لذلك ما رواه أبو داود الطيالسى . . عن جابر قال : قال رسول الله صلى الله عليه وسلم : \" قال جبريل : يا محمد ، عش ما شئت فإنك ميت ، وأحبب ما شئت فإنك مفارقه ، واعمل ما شئت فإنك ملاقيه \" .ومن الناس من يعيد الضمير على قوله ( رَبِّكَ ) أى : فملاق ربك فيجازيك بعملك ، ويكافئك على سعيك ، وعلى هذا فكلا القولين متلازم ."
      },
      {
        "resource_id": 94,
        "text": "ومعنى قوله : ( كادح إلى ربك كدحا ) أي ساع إليه في عملك ، والكدح : عمل الإنسان وجهده في الأمر من الخير والشر حتى يكدح ذلك فيه ، أي يؤثر . وقال قتادة والكلبي والضحاك : عامل لربك عملا ( فملاقيه ) أي ملاقي جزاء عملك خيرا كان أو شرا ."
      },
      {
        "resource_id": 166,
        "text": "<p>হে মানুষ! তুমি তোমার রবের কাছে পৌছা পর্যন্ত কঠোর পরিশ্রম করতে হবে, অতঃপর তুমি তাঁর সাক্ষাত লাভ করবে [১]।</p><p>[১] كدح এর অর্থ কোন কাজে পূর্ণ চেষ্টা ও শক্তি ব্যয় করা। [ফাতহুল কাদীর] মানুষের প্রত্যেক চেষ্টা ও অধ্যবসায় আল্লাহ্র দিকে চূড়ান্ত হবে। অর্থাৎ মানুষ দুনিয়ায় যা কিছু কষ্ট-সাধনা প্ৰচেষ্টা ও সংগ্রাম চালিয়ে যাচ্ছে সে সম্পর্কে সে মনে করতে পারে যে তা কেবল দুনিয়ার জীবন পর্যন্তই সীমাবদ্ধ এবং দুনিয়াবী স্বাৰ্থ লাভ করাই এর উদ্দেশ্য। কিন্তু আসলে সে সচেতন বা অচেতনভাবে নিজের রবের দিকেই এগিয়ে যাচ্ছে এবং অবশেষে তাকে তাঁর কাছেই পৌঁছতে হবে। মানুষ এখানে যে চেষ্টা-চরিত্র করছে, পরিশেষে তার পালনকর্তার কাছে পৌছে এর সাথে তার সাক্ষাৎ ঘটবে এবং এর শুভ অথবা অশুভ পরিণতি সামনে এসে যাবে। অথবা এর অর্থ প্রত্যেক মানুষ আখেরাতে তার পালনকর্তার সাথে সাক্ষাৎ করবে এবং হিসাবের জন্যে তাঁর সামনে উপস্থিত হবে। [দেখুন, কুরতুবী] রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, ‘যে ব্যক্তি আল্লাহ্র সাক্ষাত করতে চায়, আল্লাহ্ও তার সাক্ষাত করতে পছন্দ করেন। আর যে ব্যক্তি আল্লাহ্র সাক্ষাত করতে চায় না, আল্লাহ্ও তার সাথে সাক্ষাত করতে অপছন্দ করেন।’ আয়েশা রাদিয়াল্লাহু ‘আনহা-অথবা রাসূল সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের অন্য কোন স্ত্রী- বলেন, ‘আমরা তো মৃত্যুকে অপছন্দ করি।’ রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেন, ‘তা নয়। কিন্তু মুমিন ব্যক্তির যখন মৃত্যু ঘণিয়ে আসে, তখন তাকে আল্লাহ্ তা'আলার সস্তুষ্টি ও সম্মানের সুসংবাদ দেওয়া হয়। তখন তার কাছে মৃত্যু অপেক্ষা অন্য কিছু প্রিয় হতে পারে না। এভাবে সে আল্লাহ্র সাক্ষাত করতে পছন্দ করে, তাই আল্লাহ্ তা‘আলাও তার সাথে সাক্ষাত করতে পছন্দ করেন। আর কাফির ব্যক্তিকে মৃত্যুর সময় আল্লাহ্র আযাব ও শাস্তির সংবাদ দেওয়া হয়, তখন মৃত্যু অপেক্ষা অপ্রিয় আর কিছু থাকে না। সে আল্লাহ্র সাক্ষাত অপছন্দ করে বিধায় আল্লাহ্ তা'আলা তার সাথে সাক্ষাত অপছ ন্দকরেন’। [বুখারী: ৬৫০৭, মুসলিম: ২৬৮৩]</p>"
      },
      {
        "resource_id": 168,
        "text": "<p>يَا أَيُّهَا الْإِنسَانُ إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا فَمُلَاقِيهِ (0 man, you have to work hard constantly to reach your Lord, then you have to meet Him...84:6) The word kadh means to 'exert one's efforts fully', and 'to your Lord' means 'to meet your Lord'. In other words, every effort of man would end at his Lord.</p><p>Return to Allah</p><p>Mankind is addressed in this verse and shown a road that if he were to think about it carefully, and use his sense and intelligence, he could exert his efforts in the right direction that will ensure for him welfare, well-being and safety in this world, as well as in the Hereafter. First, it has been pointed out that man, whether he is good or bad, believer or non-believer, has the natural tendency to exert himself in order to achieve his goal. A good-natured person will work hard and adopt lawful means to acquire his livelihood and necessities of life. A bad person cannot obtain his needs and objective without working hard. Thieves, robbers, rouges, cheats and looters apply their minds and exert their physical strength in order to achieve their objective. Secondly, it has been pointed out that if the intelligent man were to think carefully, all his movements and pauses are stations of a long journey he is going through, though unconsciously. This journey will end at his presence before Allah, that is, at death. This is stated in the phrase ila rabbika to your Lord'. This is a statement of reality which none can deny. All efforts, [ good or bad ], must end with death. The third point is that after death, in the presence of his Lord, he will have to give an account of his movements and deeds, and of his efforts. This is rationally necessary and justified, so that the consequences of good and bad may be separately known, because such distinction is not known in this life. A good person may work hard for a month or so in order to obtain his livelihood and necessities of life, but thieves and looters may obtain them overnight. If there is no time of reckoning or punishment, both of them [ the good and the bad ] will be equal, which is contrary to reason and justice. At the end, the verse says: فَمُلَاقِيهِ (then you have to meet Him.) The translation given above is based on the assumption that the attached pronoun (hi) refers to Allah. The sense is that every person has to meet his Lord and to present himself before him to give the account of his deeds. Another possible interpretation is that the attached pronoun (hi) refers to 'kadh' (working hard). Given this interpretation, the translation of the verse would be: \"0 man, you have to work hard constantly to reach your Lord, then you have to meet it.\" And the sense would be: 'you have to meet the good or bad consequences of your working hard.'</p><p>The verses that follow depict separately the consequences of the good and the bad people, of the believers and the non-believers. First, the ledger of deeds must be received in the right or the left hand. Those who receive the ledgers in their right hands will be the inmates of Paradise with its eternal blessings. Those who receive the ledgers in their left hands will be the inmates of Hell. The point for careful consideration is that necessities of life, as well as unnecessary desires are fulfilled by both righteous and wicked people in this world, and thus both spend their lives in some way or the other, but the consequences of the two [ for the Hereafter ] are diametrically opposite to each other. One results in eternal and unending comfort, and the other results in eternal perdition, torture and torment. Man still has the chance [ while he is living ] to redirect his attention to working hard towards switching the situation in a direction that not only fulfils his legitimate needs and desires in this world, but also attains the eternal pleasures of the Hereafter.</p>"
      },
      {
        "resource_id": 170,
        "text": "Ты стремишься к Аллаху, следуя Его повелениям и запретам, и даже пытаешься приблизиться к Нему. Однако наряду с добром ты совершаешь зло. Посему не забывай, что в День воскресения ты встретишься с Аллахом и не сможешь избежать воздаяния, которое будет либо милостью, либо справедливым возмездием. Если ты окажешься в числе счастливых, то обретешь Божью милость, а если окажешься несчастным, то получишь справедливое наказание. Поэтому далее Аллах упомянул о том, какая великая разница будет между воздаянием, которого будут удостоены счастливые и несчастные рабы."
      },
      {
        "resource_id": 92,
        "text": "يَا أَيُّهَا الْإِنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلَاقِيهِ (6)والكدحُ : يطلق على معان كثيرة لا نتحقق أيَّها الحقيقة ، وقد أهمل هذه المادة في «الأساس» فلعله لأنه لم يتحقق المعنى الحقيقي . وظاهر كلام الراغب أن حقيقته : إتعاب النفس في العمل والكد . وتعليق مجروره في هذه الآية بحرف ( إلى ) تؤذن بأن المراد به عمل ينتهي إلى لقاء الله ، فيجوز أن يضمن { كادح } معنى ساععٍ لأن كدح الناس في الحياة يتطلبون بعمل اليوم عملاً لغد وهكذا ، وذلك يتقضَّى به زمن العمر الذي هو أجل حياة كل إنسان ويعقبه الموت الذي هو رجوع نفس الإنسان إلى محض تصرف الله ، فلما آل سعيه وكدحه إلى الموت جُعِل كدحُه إلى ربه . فكأنه قيل : إنك كادح تسعى إلى الموت وهو لقاء ربك ، وعليه فالمجرور ظرف مستقر هو خبر ثان عن حرف ( إنَّ ) ، ويجوز أن يضمن { كادح } معنى ماش فيكون المجرور ظرفاً لغواً .و { كدحاً } منصوب على المفعولية المطلقة لتأكيد { كادح } المضمن معنى ساع إلى ربك ، أي ساع إليه لا محالة ولا مفر .وضمير النصب في «ملاقيه» عائد إلى الرب ، أي فملاق ربك ، أي لا مفر لك من لقاء الله ولذلك أكد الخبر بإن ."
      },
      {
        "resource_id": 165,
        "text": "<p>হে মানব! তুমি তোমার প্রতিপালকের নিকট পৌঁছানো পর্যন্ত যে কঠোর সাধনা করে থাকো তা তুমি দেখতে পাবে।[১]</p><p>[১] এখানে 'মানব' শব্দটি ব্যাপক অর্থে ব্যবহূত হয়েছে। যাতে মু'মিন এবং কাফের উভয় শামিল। كدح কঠোর সাধনা বা পরিশ্রম করাকে বলা হয়; চাহে সে সাধনা বা পরিশ্রম ভালো কাজের জন্য হোক অথবা মন্দ কাজের জন্য। উদ্দেশ্য হল যে, যখন উল্লিখিত বস্তুসমূহ প্রকাশ পাবে; অর্থাৎ কিয়ামত আসবে তখন হে মানুষ! তুমি ভাল-মন্দ যা করেছ তা নিজ সম্মুখে দেখতে পাবে এবং সেই অনুযায়ী তোমাকে ভাল-মন্দ বদলা দেওয়া হবে। সামনে এর বিস্তারিত বর্ণনা আসছে।</p>"
      },
      {
        "resource_id": 14,
        "text": "أي إنك ساع إلى ربك سعيا وعامل عملا\"فملاقيه\" ثم إنك ستلقى ما عملت من خير أو شر. ويشهد لذلك ما رواه أبو داود الطيالسي عن الحسن بن أبي جعفر عن أبي الزبير عن جابر قال: قال رسول الله صلى الله عليه وسلم \"قال جبريل يا محمد عش ما شئت فإنك ميت وأحبب من شئت فإنك مفارقه وأعمل ما شئت فإنك ملاقيه\" ومن الناس من يعيد الضمير على قوله ربك أي فملاق ربك ومعناه فيجازيك بعملك ويكافئك على سعيك وعلى هذا فكلا القولين متلازم قال العوفي عن ابن عباس \"يا أيها الإنسان إنك كادح إلى ربك كدحا\" يقول تعمل عملا تلقى الله به خيرا كان أو شرا. وقال قتادة \"يا أيها الإنسان إنك كادح إلى ربك كدحا\" إن كدحك يا ابن آدم لضعيف فمن استطاع أن يكون كدحه في طاعة الله فليفعل ولا قوة إلا بالله."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 7,
    "tafsirs": [
      {
        "resource_id": 16,
        "text": "فأما من أعطي صحيفة أعماله بيمينه، وهو مؤمن بربه، فسوف يحاسب حسابًا سهلا ويرجع إلى أهله في الجنة مسرورًا."
      },
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 168,
        "text": "<p>فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ ﴿7﴾ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ﴿8﴾ وَيَنقَلِبُ إِلَىٰ أَهْلِهِ مَسْرُورًا ﴿9﴾</p><p>(So, as for him whose book [ of deeds ] will be given to him in his right hand, he will be called to account in an easy manner, and he will go back to his people joyfully....7-9)</p><p>This verse describes the condition of the believers. Their books of deeds will be given to them in their right hands. An easy reckoning will be taken from them and the welcome news of Paradise will be given to them. They will return to their families joyfully.</p><p>It is reported in the Sahih of Bukhari from Sayyidah ` A'shah ؓ that the Holy Prophet has said:</p><p>من حوسب یوم القیامۃ عزّب</p><p>\"He who is required to account for [ or questioned about ] his deeds will have to be punished.\"</p><p>At this Sayyidah ` A'ishah ؓ asked, \"What is the meaning of the [ following ] verse?” يُحَاسَبُ حِسَابًا يَسِيرًا (he will be called to account in an easy manner,..84:8). The Holy Prophet explained that the verse signifies 'the deeds will merely be presented before Allah without being questioned. As for the person whose deeds are scrutinised, he will never be able to escape torment'.</p><p>This explanation of the Holy Prophet ﷺ clarifies that the deeds of the believers will also be presented before Allah, but by virtue of their faith, not all of their actions will be scrutinised. This is referred to as 'account in an easy manner'. The words 'he will go back to his people joyfully' may be interpreted in one of two ways. This may refer to the Houris who will be his family members in Paradise, or it may refer to his family members in the world who will be present in the Plain of Gathering, and he, after knowing about his success, will impart to them, according to the custom of this life, the welcome news of his achievement. The commentators have mentioned both possibilities in interpreting this sentence. [ Qurtubi ].</p>"
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      { "resource_id": 159, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "قوله تعالى : \" فأما من أوتي كتابه بيمينه \" وهو المؤمن"
      },
      {
        "resource_id": 91,
        "text": "ولهذا ذكر تفضيل الجزاء، فقال: { فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ } وهم أهل السعادة. "
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 14,
        "text": "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ ) يقول تعالى ذكره: فأما من أعطي كتاب أعماله بيمينه."
      },
      {
        "resource_id": 94,
        "text": "\"فأما من أوتي كتابه\"، ديوان أعماله، \"بيمينه\"."
      },
      {
        "resource_id": 157,
        "text": "<p>وہ لوگ جن کو ان کا اعمال نامہ دائیں ہاتھ میں دیا جائے گا ، ان سے اللہ راضی ہوگا ، یہ ایک بخت ہوں گے ، ایمان دار اور نیکوکار ہوں گے ، اللہ ان سے راضی ہوجائے گا اور ان کی نجات کا فیصلہ ہوجائے گا۔ ان لوگوں کے ساتھ نرمی کے ساتھ حساب ہوگا۔ اللہ کے کارندے زیادہ بازپرس نہیں کریں گے اور نہ حساب میں گہرائیوں تک جائیں گے۔ اس کی تصویر کشی احادیث رسول میں کی گئی ہے۔ میں سمجھتا ہوں کہ اگر ان احادیث کو پڑھ لیاجائے تو مزید کسی تشریح کی ضرورت نہیں ہے۔</p><p>حضرت عائشہ ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا : جس کے ساتھ حساب میں مناقشہ کیا گیا اسے ضرور سزا ہوگی۔ فرماتی ہیں میں نے کہا : اللہ نے نہیں کہا ” اس سے ہلکا حساب لیا جائے گا “ ۔ تو آپ نے فرمایا : ” یہ کامیابی حساب سے نہیں ہوگی بلکہ صرف پیشی سے ہوگی ، قیامت میں صورت یہ ہوگی کہ جس سے حساب لیا گیا ، اس کو سزا ہوگئی “۔ (بخاری ، مسلم ، ترمذی ، نسائی)</p><p>حضرت عائشہ ؓ سے ایک دوسری روایت ہے ، فرماتی ہیں کہ میں ایک نماز میں حضور اکرم سے سنا ” اے اللہ میرے ساتھ ہلکا حساب فرمانا “۔ جب حضور نماز سے فارغ ہوئے تو میں نے پوچھا کہ حضور ہلکا حساب کیا ہوتا ہے ؟ تو آپ نے فرمایا کہ حساب کی کتاب کو دیکھ کر چشم پوشی کردی جائے اور جانے دیا جائے ۔ عائشہ ؓ اس دن جس سے پوچھ گچھ شروع ہوگئی وہ تو مارا گیا “۔ (احمد بشرط مسلم از عبداللہ ابن زبیر ؓ</p><p>غرض اس کا اعمال نامہ اس کے دائیں ہاتھ میں دے دیا گیا ، اس کے ساتھ حساب یسیر ہوگا اور وہ نجات پاجائے گا۔</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>অতঃপর যাকে তার ‘আমলনামা তার ডান হাতে দেয়া হবে।</p>"
      },
      {
        "resource_id": 92,
        "text": "فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ (7) هذا تفصيل الإِجمال الذي في قوله : { إنك كادح إلى ربك كدحاً فملاقيه } [ الانشقاق : 6 ] أي رجوع جميع الناس أولئك إلى الله ، فمن أوتي كتابه بيمينه فريق من الناس هم المؤمنون ومن أوتي كتابه وراء ظهره فريق آخر وهم المشركون كما دلّ عليه قوله : { إنه ظن أن لن يحور } ، وبين منتهاهما مراتب . وإنما جاءت هذه الآية على اعتبار تقسيم الناس يومئذ بين أتقياء ومشركين .والكِتاب : صحيفة الأعمال ، وجعل إيتاؤه إياه بيمينه شعاراً للسعادة لِما هو متعارف من أن اليد اليمنى تتناول الأشياء الزكية وهذا في غريزة البشر نشأ عن كون الجانب الأيمن من الجسد أقدر وأبدر للفعل الذي يتعلق العزم بعمله فارتكز في النفوس أن البركة في الجانب الأيمن حتى سَموا البركة والسعادة يُمناً ، ووسموا ضدها بالشؤم فكانت بركة اليمين مما وضعه الله تعالى في أصل فطرة الإنسان ، وتقدم عند قوله تعالى : { قالوا إنكم كنتم تأتوننا عن اليمين } في سورة [ الصافات : 28 ] ، وقوله : { وأصحاب اليمين ما أصحاب اليمين } [ الواقعة : 27 ] . وقوله : { وأصحاب الشمال ما أصحاب الشمال } في سورة [ الواقعة : 41 ] ، وقوله : { فأصحاب الميمنة ما أصحاب الميمنة وأصحاب المشأمة ما أصحاب المشأمة } في سورة [ الواقعة : 8 ، 9 ] .والباء في قوله : بيمينه } للملابسة أو المصاحبة ، أو هي بمعنى ( في ) ، وهي متعلقة ب { أوتي } .وحرف ( سوف ) أصله لحصول الفعل في المستقبل ، والأكثر أن يراد به المستقبل البعيد وذلك هو الشائع ، ويقصد به في الاستعمال البليغ تحقق حصول الفعل واستمراره ومنه قوله تعالى : { قال سوف أستغفر لكم ربي } في سورة [ يوسف : 98 ] ، وهو هنا مفيد للتحقق والاستمرار بالنسبة إلى الفعل القابل للاستمرارِ وهو ينقلب إلى أهله مسروراً وهو المقصود من هذا الوعد . وقد تقدم عند قوله تعالى : { فسوف نصليه ناراً } في سورة [ النساء : 30 ] .والحساب اليسير : هو عَرْض أعماله عليه دون مناقشة فلا يَطول زمنه فيعجَّلُ به إلى الجنة ، وذلك إذا كانت أعماله صالحة ، فالحساب اليسير كناية عن عدم المؤاخذة .ومن أوتي كتابه وراء ظهره } هو الكافر . والمعنى : إنه يؤتى كتابه بشماله كما تقتضيه المقابلة ب { من أوتي كتابه بيمينه } وذلك أيضاً في سورة الحاقة قوله : { وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه } ، أي يعطى كتابه من خلفه فيأخذه بشماله تحقيراً له ويناول له من وراء ظهره إظهاراً للغضب عليه بحيث لا ينظر مُناوِلُه كتابَه إلى وجهه ."
      },
      {
        "resource_id": 93,
        "text": "ثم فصل - سبحانه - بعد ذلك عاقبة هذا الكدح ، والسعى المتواصل . . فقال - تعالى - : ( فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ . فَسَوْفَ يُحَاسَبُ حِسَاباً يَسِيراً . وَيَنقَلِبُ إلى أَهْلِهِ مَسْرُوراً ) .والمراد بالكتاب هنا : صحيفة العمل التى سجلت فيها حسنات الإِنسان وسيئاته ."
      },
      {
        "resource_id": 165,
        "text": "<p>সুতরাং যাকে তার ডান হাতে নিজ আমলনামা (কর্মলিপি) দেওয়া হবে,</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 8,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 16,
        "text": "فأما من أعطي صحيفة أعماله بيمينه، وهو مؤمن بربه، فسوف يحاسب حسابًا سهلا ويرجع إلى أهله في الجنة مسرورًا."
      },
      {
        "resource_id": 90,
        "text": "فسوف يحاسب حسابا يسيرا لا مناقشة فيه . كذا روي عن رسول الله - صلى الله عليه وسلم - من حديث عائشة قالت : قال رسول الله - صلى الله عليه وسلم - : \" من حوسب يوم القيامة عذب ، قالت : فقلت يا رسول الله أليس قد قال الله فأما من أوتي كتابه بيمينه فسوف يحاسب حسابا يسيرا فقال : ليس ذاك الحساب ; إنما ذلك العرض ، من نوقش الحساب يوم القيامة عذب \" أخرجه البخاري ومسلم والترمذي . وقال حديث حسن صحيح ."
      },
      {
        "resource_id": 91,
        "text": "{ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا } وهو العرض اليسير على الله، فيقرره الله بذنوبه، حتى إذا ظن العبد أنه قد هلك، قال الله [تعالى] له: \\\" إني قد سترتها عليك في الدنيا، فأنا أسترها لك اليوم \\\".  "
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 159,
        "text": "<p>آیت 8{ فَسَوْفَ یُحَاسَبُ حِسَابًا یَّسِیْرًا۔ } ”تو اس سے لیا جائے گا بہت ہی آسان حساب۔“ اس حساب کی کیفیت کیا ہوگی ؟ اس کی وضاحت حضرت عائشہ رض کی روایت کردہ بخاری و مسلم کی اس حدیث میں آئی ہے۔ حضرت عائشہ رض بیان کرتی ہیں کہ رسول اللہ ﷺ نے ارشاد فرمایا : مَنْ حُوْسِبَ یَوْمَ الْقِیَامَۃِ عُذِّبَ ”قیامت کے روز جس کا حساب لیا جائے گا اسے تو ضرور عذاب دیا جائے گا“۔ اس پر میں نے عرض کیا : کیا اللہ تعالیٰ نے یہ نہیں فرمایا ہے : { فَسَوْفَ یُحَاسَبُ حِسَابًا یَّسِیْرًا 4 } تو آپ ﷺ نے ارشاد فرمایا : لَـیْسَ ذَاکِ الْحِسَابُ ، اِنَّمَا ذَاکِ الْعَرْضُ ، مَنْ نُوقِشَ الْحِسَابَ یَوْمَ الْقِیاَمَۃِ عُذِّبَ 1 ”یہ حساب نہیں ہوگا ‘ یہ تو محض اعمال نامہ پیش کیا جانا ہوگا ‘ روزِ قیامت جس کے حساب کی جانچ پڑتال کی گئی اسے تو ضرور عذاب دیا جائے گا۔“ یعنی جس خوش قسمت انسان کا اعمالنامہ اس کے داہنے ہاتھ میں دیا جائے گا ‘ اس سے نہ تو کوئی سوال ہوگا اور نہ ہی اس کے مواخذے اور مناقشے کی نوبت آئے گی۔ بس اس کے اعمال نامے کو ایک نظر دیکھ کر اس کی خطائوں کو معاف کردیا جائے گا۔ یعنی اللہ تعالیٰ اس شخص سے نرمی کا معاملہ فرمائے گا۔</p>"
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 93,
        "text": "والمراد بالحساب اليسير : عرض الأعمال ، مع التجاوز عن الهفوات ، بفضل الله - تعالى - : أى : الناس جميعا يكدحون فى هذه الحياة ، ثم يعودون إلى خالقهم للحساب والجزاء ، فأما من أعطى كتابه بيمينه ، وهم المؤمنون الصادقون  فسوف يحاسب من ربه - تعالى - حسابا يسيرا سهلا ، بأن تعرض أعماله على خالقه - تعالى - ثم يكون التجاوز عن المعاصى والثواب على الطاعة ، بدون مناقشة أو مطالبة بعذر أو حجة ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 15,
        "text": "( فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ) بأن ينظر في أعماله، فيغفر له سيئها، ويُجازى على حُسنها.وبنحو الذي قلنا في ذلك قال أهل التأويل وجاء الخبر عن رسول الله صلى الله عليه وسلم .* ذكر من قال ذلك:حدثنا ابن وكيع، قال: ثنا جرير، عن محمد بن إسحاق، عن عبد الواحد بن حمزة، عن عباد بن عبد الله بن الزُّبير، عن عائشة، قالت: سمعت النبيّ صلى الله عليه وسلم يقول: \" اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا \" قلت: يا رسول الله ما الحساب اليسير؟ قال: \" أن يُنْظَرَ فِي سَيِّئاتِهِ فَيُتَجَاوَزُ عَنْهُ، إنَّهُ مَنْ نُوقِشَ الْحِسَابَ يَوْمَئِذٍ هَلَكَ\" .حدثني يعقوب، قال: ثنا ابن علية، عن محمد بن إسحاق، قال: ثني عبد الواحد بن حمزة بن عبد الله بن الزبير، عن عباد بن عبد الله بن الزيير، عن عائشة، قالت: سمعت رسول الله صلى الله عليه وسلم يقول في بعض صلاته: \" اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا \"، فلما انصرف قلت: يا رسول الله ما الحساب اليسير؟ قال: \" يُنْظَرُ فِي كِتَابِهِ، وَيُتَجَاوَزُ عَنْهُ، إنَّهُ مَنْ نُوقِشَ الْحِسَابَ يَوْمَئِذٍ يا عَائِشَةُ هَلَكَ\" .حدثنا نصر بن عليّ الجَهْضَمِيّ، قال: ثنا مسلم، عن الحريش بن الخرّيت أخي الزبير، عن ابن أبي مليكة، عن عائشة، قالت: من نُوقش الحساب، أو من حوسب عذّب، قال: ثم قالت: إنما الحساب اليسير: عَرْض على الله وهو يراهم .حدثنا ابن بشار، قال: ثنا عبد الوهاب، قال: ثنا أيوب، وحدثني يعقوب، قال: ثنا ابن علية، قال: أخبرنا أيوب، عن ابن أبي مليكة، عن عائشة أن رسول الله صلى الله عليه وسلم، قال: \" مَنْ حُوسِبَ يَوْمَ الْقِيَامَةِ عُذَّبَ\"، فقلت: أليس الله يقول: ( فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ) قال: \" لَيْسَ ذَلِكَ الْحِسَابُ إنَّمَا ذلكَ العَرْضُ، وَلَكِنْ مَنْ نُوقِشَ الْحِسَابَ يَوْمَ الْقِيَامَةِ عُذِبَ\" .حدثنا ابن وكيع، قال: ثنا روح بن عبادة، قال: ثنا أبو عامر الخزاز، عن ابن أبي مليكة، عن عائشة قالت: قال رسول الله صلى الله عليه وسلم : \" إنَّهُ لَيْسَ أحَدٌ يُحَاسَبُ يَوْمَ القِيَامَةِ إلا مُعَذَّبًا \"، فقلت: أليس يقول الله: ( فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ) ؟ قال: \" ذَلِكَ الْعَرضُ، إنَّهُ مَنْ نُوقِشَ الْحِسَابَ عُذّبَ\"، وقال بيده على أصبعه كأنه ينكته .حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد في قوله: ( فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ) قال: الحساب اليسير: الذي يغفر ذنوبه، ويتقبَّل حسناته، ويسير الحساب الذي يعفى عنه، وقرأ:  وَيَخَافُونَ سُوءَ الْحِسَابِ  ، وقرأ:  أُولَئِكَ الَّذِينَ نَتَقَبَّلُ عَنْهُمْ أَحْسَنَ مَا عَمِلُوا وَنَتَجاوَزُ عَنْ سَيِّئَاتِهِمْ فِي أَصْحَابِ الْجَنَّةِ  .حدثنا ابن حميد، قال: ثنا مهران، عن عثمان بن الأسود، قال: ثني ابن أبي مليكة، عن عائشة، قالت: يا رسول الله ( فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ) قال: \" ذَلِكَ الْعَرْضُ يَا عَائِشَةُ، مَنْ نُوقِشَ الْحِسَابَ هَلَكَ\" .حدثنا ابن بشار، قال: ثنا عثمان بن عمرو وأبو داود، قالا ثنا أبو عامر الخزاز، عن ابن أبي مليكة، عن عائشة، قالت: قال رسول الله صلى الله عليه وسلم: \" مَنْ حُوسِبَ عُذّبَ \" ، قَالَتْ: فقلت: أليس الله يقول: ( فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ) قال: \" ذَلِكَ الْعَرْضُ يَا عَائِشَةُ، وَمَنْ نُوقِشَ الحِسَابَ عُذّبَ\" .إن قال قائل: وكيف قيل: ( فَسَوْفَ يُحَاسَبُ ) ، والمحاسبة لا تكون إلا من اثنين، والله القائم بأعمالهم ولا أحد له قِبَل ربه طَلِبة فيحاسبه؟ قيل: إن ذلك تقرير من الله للعبد بذنوبه، وإقرار من العبد بها وبما أحصاه كتاب عمله، فذلك المحاسبة على ما وصفنا، ولذلك قيل: يحاسب.حدثنا عمرو بن عليّ، قال: ثنا ابن أبي عديّ، عن أبي يونس القشيري، عن ابن أبي مليكة، عن القاسم بن محمد، عن عائشة قالت: قال رسول الله صلى الله عليه وسلم: \" لَيْسَ أحَدٌ يُحَاسَبُ يَوْمَ الْقِيَامَةِ إلا هَلَكَ\" قالت: فقلت: يا رسول الله &; 24-315 &; ( فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ * فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ) فقال: \" ذَلِكَ الْعَرْضُ، لَيْس أحَدٌ يُحَاسَبُ يَوْمَ الْقِيَامَةِ إلا هَلَكَ\" ."
      },
      {
        "resource_id": 166,
        "text": "<p>তার হিসেব-নিকেশ সহজেই নেয়া হবে [১]</p><p>[১] এতে মুমিনদের অবস্থা বর্ণনা করা হয়েছে যে, তাদের আমলনামা ডান হাতে আসবে এবং তাদের সহজ হিসাব নিয়ে জান্নাতের সুসংবাদ দান করা হবে। তারা তাদের পরিবার-পরিজনের কাছে হৃষ্টচিত্তে ফিরে যাবে। তার হিসেব নেয়ার ব্যাপারে কড়াকড়ি করা হবে না। তাকে জিজ্ঞেস করা হবে না, ওমুক ওমুক কাজ তুমি কেন করেছিলে? ঐসব কাজ করার ব্যাপারে তোমার কাছে কি কি ওযর আছে? নেকীর সাথে সাথে গোনাহও তার আমলনামায় অবশ্যি লেখা থাকবে। কিন্তু গোনাহের তুলনায় নেকীর পরিমাণ বেশী হবার কারণে তার অপরাধগুলো উপেক্ষা করা হবে এবং সেগুলো মাফ করে দেয়া হবে। কুরআন মজিদে অসৎকর্মশীল লোকদের কঠিন হিসেব-নিকেশের জন্য “সু-উল হিসাব” (খারাপভাবে হিসেব নেয়া) শব্দ ব্যবহার করা হয়েছে। [সূরা আর-রা‘দ ১৮] সৎলোকদের সম্পর্কে বলা হয়েছেঃ “এরা এমন লোক যাদের সৎকাজগুলো আমি গ্রহণ করে নেবো এবং অসৎকাজগুলো মাফ করে দেবো। ”[সূরা আল-আহকাফ ১৬] আয়েশা রাদিয়াল্লাহু ‘আনহা রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম থেকে বর্ণনা করেন, তিনি বলেন, কেয়ামতের দিন যার হিসাব নেয়া হবে, সে আযাব থেকে রক্ষা পাবে না। এ কথা শুনে আয়েশা রাদিয়াল্লাহু ‘আনহা প্রশ্ন করলেন, কুরআনেকি فَسَوْفَ يُحَا سَبْ مِاَبًا يَّسِيْرًا বলা হয়নি? রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বললেন, এই আয়াতে যাকে সহজ হিসাব বলা হয়েছে, সেটা প্রকৃতপক্ষে পরিপূর্ণ হিসাব নয়; বরং কেবল আল্লাহ্ রাব্ববুল আলামীনের সামনে পেশ করা। যে ব্যক্তির কাছ থেকে তার কাজকর্মের পুরোপুরি হিসাব নেয়া হবে, সে আযাব থেকে কিছুতেই রক্ষা পাবে না। [বুখারীঃ ৪৯৩৯, মুসলিম: ২৮৭৬]</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>তার হিসাব নেওয়া হবে সহজভাবে। [১]</p><p>[১] সহজ হিসাব এই যে, মুমিনের আমল-নামা পেশ করা হবে। তার ভুল-ত্রুটিও সামনে উপস্থিত করা হবে। অতঃপর আল্লাহ তাআলা নিজের রহমত এবং অনুগ্রহে তাদেরকে মার্জনা করে দেবেন। আয়েশা (রাঃ) বলেন যে, রসূল (সাঃ) বলেছেন, \"যার হিসাব নেওয়া হবে সে ধ্বংস হয়ে যাবে। আমি বললাম, হে আল্লাহর রসূল! আল্লাহ আমাকে আপনার জন্য কুরবান করুন, আল্লাহ তাআলা কি এ কথা বলেননি যে, যার ডান হাতে আমল-নামা দেওয়া হবে তার হিসাব সহজ হবে?\" (মা আয়েশা রাযিয়াল্লাহু আনহার উদ্দেশ্য ছিল যে, এই আয়াত অনুপাতে হিসাব তো মু'মিনদেরও হবে কিন্তু সে ধ্বংসগ্রস্ত হবে না।) তিনি (সাঃ) স্পষ্টভাবে বুঝিয়ে বললেন যে, \"পেশ করা হবে মাত্র।\" (অর্থাৎ, মুমিনের সাথে হিসাবের ব্যাপার হবে না বরং নামমাত্র পেশ করা হবে।) মু'মিনদেরকে আল্লাহর সম্মুখে পেশ করা হবে। কিন্তু যাকে জেরা করা হবে সে ধ্বংস হয়ে যাবে। <em>(সহীহ বুখারী, তাফসীর সূরা ইনশিক্বাক পরিচ্ছেদ)</em></p>"
      },
      {
        "resource_id": 14,
        "text": "أي سهلا بلا تعسير أي لا يحقق عليه جميع دقائق أعماله فإن من حوسب كذلك هلك لا محالة. وقال الإمام أحمد: حدثنا إسماعيل أخبرنا أيوب عن عبدالله بن أبي مليكة عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"من نوقش الحساب عذب\" قالت: فقلت: أفليس قال الله تعالى \"فسوف يحاسب حسابا يسيرا\" قال \"ليس ذاك بالحساب ولكن ذلك العرض من نوقش الحساب يوم القيامة عذب\" وهكذا رواه البخاري ومسلم والترمذي والنسائي وابن جرير من حديث أيوب السختياني به وقال ابن جرير حدثنا ابن وكيع حدثنا روح بن عبادة حدثنا أبو عامر الخزاز عن ابن أبي مليكه عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم \"إنه ليس أحد يحاسب يوم القيامة إلا معذبا\" فقلت أليس الله يقول \"فسوف يحاسب حسابا يسيرا\" قال \"ذاك العرض إنه من نوقش الحساب عذب\" وقال بيده على أصبعه كأنه ينكت وقد رواه أيضا عن عمرو بن علي عن ابن أبي عدي عن أبي يونس القشيري عن ابن أبي مليكة عن القاسم عن عائشة فذكر الحديث أخرجاه من طريق أبي يونس القشيري واسمه حاتم بن أبي صغيرة به قال ابن جرير: حدثنا نصر بن علي الجهضمي حدثنا مسلم عن الحريش بن الخريت أخي الزبير عن ابن أبي مليكة عن عائشة قالت: من نوقش الحساب - أو من حوسب - عذب. قال ثم قالت إنما الحساب اليسير عرض على الله تعالى وهو يراهم وقال أحمد حدثنا إسماعيل حدثنا محمد بن إسحاق حدثني عبدالواحد بن حمزة بن عبدالله بن الزبير عن عباد بن عبدالله بن الزبير عن عائشة قالت: سمعت رسول الله يقول في بعض صلاته \"اللهم حاسبني حسابا يسيرا\" فلما انصرف قلت يا رسول الله ما الحساب اليسير؟ قال \"أن ينظر في كتابه فيتجاوز له عنه إنه من نوقش الحساب يا عائشة يومئذ هلك\" صحيح على شرط مسلم."
      },
      {
        "resource_id": 94,
        "text": "\"فسوف يحاسب حساباً يسيراً\"أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا سعيد بن أبي مريم ، أخبرنا نافع ، عن ابن عمر ، حدثني ابن أبي مليكة أن عائشة زوج النبي - صلى الله عليه وسلم - كانت لا تسمع شيئا لا تعرفه إلا راجعت فيه حتى تعرفه ، قالت : قال النبي - صلى الله عليه وسلم - : \" من حوسب عذب \" قالت عائشة رضي الله عنها فقلت : يا رسول الله أوليس يقول الله - عز وجل - : \" فسوف يحاسب حسابا يسيرا \" ؟ قالت : فقال : \" إنما ذلك العرض ، ولكن من نوقش [ في الحساب هلك ] ."
      },
      {
        "resource_id": 92,
        "text": "فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا (8) هذا تفصيل الإِجمال الذي في قوله : { إنك كادح إلى ربك كدحاً فملاقيه } [ الانشقاق : 6 ] أي رجوع جميع الناس أولئك إلى الله ، فمن أوتي كتابه بيمينه فريق من الناس هم المؤمنون ومن أوتي كتابه وراء ظهره فريق آخر وهم المشركون كما دلّ عليه قوله : { إنه ظن أن لن يحور } ، وبين منتهاهما مراتب . وإنما جاءت هذه الآية على اعتبار تقسيم الناس يومئذ بين أتقياء ومشركين .والكِتاب : صحيفة الأعمال ، وجعل إيتاؤه إياه بيمينه شعاراً للسعادة لِما هو متعارف من أن اليد اليمنى تتناول الأشياء الزكية وهذا في غريزة البشر نشأ عن كون الجانب الأيمن من الجسد أقدر وأبدر للفعل الذي يتعلق العزم بعمله فارتكز في النفوس أن البركة في الجانب الأيمن حتى سَموا البركة والسعادة يُمناً ، ووسموا ضدها بالشؤم فكانت بركة اليمين مما وضعه الله تعالى في أصل فطرة الإنسان ، وتقدم عند قوله تعالى : { قالوا إنكم كنتم تأتوننا عن اليمين } في سورة [ الصافات : 28 ] ، وقوله : { وأصحاب اليمين ما أصحاب اليمين } [ الواقعة : 27 ] . وقوله : { وأصحاب الشمال ما أصحاب الشمال } في سورة [ الواقعة : 41 ] ، وقوله : { فأصحاب الميمنة ما أصحاب الميمنة وأصحاب المشأمة ما أصحاب المشأمة } في سورة [ الواقعة : 8 ، 9 ] .والباء في قوله : بيمينه } للملابسة أو المصاحبة ، أو هي بمعنى ( في ) ، وهي متعلقة ب { أوتي } .وحرف ( سوف ) أصله لحصول الفعل في المستقبل ، والأكثر أن يراد به المستقبل البعيد وذلك هو الشائع ، ويقصد به في الاستعمال البليغ تحقق حصول الفعل واستمراره ومنه قوله تعالى : { قال سوف أستغفر لكم ربي } في سورة [ يوسف : 98 ] ، وهو هنا مفيد للتحقق والاستمرار بالنسبة إلى الفعل القابل للاستمرارِ وهو ينقلب إلى أهله مسروراً وهو المقصود من هذا الوعد . وقد تقدم عند قوله تعالى : { فسوف نصليه ناراً } في سورة [ النساء : 30 ] .والحساب اليسير : هو عَرْض أعماله عليه دون مناقشة فلا يَطول زمنه فيعجَّلُ به إلى الجنة ، وذلك إذا كانت أعماله صالحة ، فالحساب اليسير كناية عن عدم المؤاخذة .ومن أوتي كتابه وراء ظهره } هو الكافر . والمعنى : إنه يؤتى كتابه بشماله كما تقتضيه المقابلة ب { من أوتي كتابه بيمينه } وذلك أيضاً في سورة الحاقة قوله : { وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه } ، أي يعطى كتابه من خلفه فيأخذه بشماله تحقيراً له ويناول له من وراء ظهره إظهاراً للغضب عليه بحيث لا ينظر مُناوِلُه كتابَه إلى وجهه ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 9,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 93,
        "text": "ثم ينقلب هذا الإِنسان بعد ذلك إلى أهله وعشيرته ، مبتهجا مسرورا ، بسبب فضل الله - تعالى - عليه ، ورحمته به .وعبر - سبحانه - عن فوز هذا الإِنسان : بأنه يؤتى كتابه بيمينه ، للإِشعار بأنه من أهل السعادة والتقوى ، فقد جرت العادة أن اليد اليمنى إنما تتناول بها الأشياء الزكية الحسنة . والباء فى قوله ( بيمينه ) للملابسة أو المصاحبة ، أو بمعنى فى .قال الآلوسى : والحساب اليسير : هو السهل الذى لا مناقشة فيه . وفسره صلى الله عليه وسلم بالعرض وبالنظر فى الكتاب ، مع التجاوز ، أخرج الشيخان عن عائشة أن النبى صلى الله عليه وسلم قال : \" ليس أحد يحاسب إلا هلك \" قلت يا رسول الله ، جعلنى الله فداك ، أليس الله - تعالى - يقول ( فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ .فَسَوْفَ يُحَاسَبُ حِسَاباً يَسِيراً ) ، قال : ذلك العرض يعرضون ومن نوقش الحساب هلك \" .وأخرج الإِمام أحمد عن عائشة - أيضا - قالت : \" سمعت رسول الله صلى الله عليه وسلم يقول فى بعض صلاته : \" اللهم حاسبنى حسابا يسيرا \" فلما انصرف قلت له : يا رسول الله ، ما الحساب اليسير؟ قال : \" أن ينظر فى كتابه فيتجاوز له عنه \" \" ."
      },
      {
        "resource_id": 16,
        "text": "فأما من أعطي صحيفة أعماله بيمينه، وهو مؤمن بربه، فسوف يحاسب حسابًا سهلا ويرجع إلى أهله في الجنة مسرورًا."
      },
      {
        "resource_id": 91,
        "text": "{ وَيَنْقَلِبُ إِلَى أَهْلِهِ } في الجنة { مَسْرُورًا } لأنه نجا من العذاب وفاز بالثواب. "
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "\"وينقلب إلى أهله\"، يعني في الجنة من الحور العين والآدميات، \"مسروراً\"، بما أوتي من الخير والكرامة."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "وينقلب إلى أهله مسرورا أزواجه في الجنة من الحور العين مسرورا أي مغتبطا قرير العين . ويقال إنها نزلت في أبي سلمة بن عبد الأسد ، هو أول من هاجر من مكة إلى المدينة . وقيل : إلى أهله الذين كانوا له في الدنيا ، ليخبرهم بخلاصه وسلامته . والأول قول قتادة . أي إلى أهله الذين قد أعدهم الله له في الجنة ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 9{ وَّیَنْقَلِبُ اِلٰٓی اَہْلِہٖ مَسْرُوْرًا۔ } ”اور وہ لوٹے گا اپنے گھر والوں کی طرف شاداں وفرحاں۔“ عدالت کے کٹہرے سے وہ شخص جب اپنے ان اہل و عیال ‘ رشتہ دار اور ساتھیوں کی طرف واپس لوٹے گا جو اسی کی طرح معاف کیے گئے ہوں گے تو بہت خوش ہوگا کہ اللہ تعالیٰ کی رحمت سے میری بھی خلاصی ہوگئی۔</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَيَنْقَلِبُ إِلَى أَهْلِهِ مَسْرُورًا ) يقول: وينصرف هذا المحاسَبُ حسابًا يسيرًا إلى أهله في الجنة مسرورًا.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( وَيَنْقَلِبُ إِلَى أَهْلِهِ مَسْرُورًا ) قال: إلى أهْلٍ أعدّ الله لهم الجنة."
      },
      {
        "resource_id": 170,
        "text": "Суд над счастливым праведником будет легким. Аллах покажет ему совершенные им грехи, и когда тот уже сочтет себя погибшим, Он скажет: «Я покрывал твои прегрешения в мирской жизни, и Я покрою их сегодня». Тогда человек вернется к своей семье в Раю и возликует от того, что он спасся от наказания и получил вознаграждение."
      },
      {
        "resource_id": 157,
        "text": "<p>وینقلب .................... مسرورا (9:84) ” اور وہ اپنے لوگوں کی طرف خوش خوش پلٹے گا “۔ یعنی ان لوگوں کی طرف جو اس سے پہلے جنت میں جاچکے ہوں گے۔ اس انداز تعبیر سے معلوم ہوتا ہے کہ جنت میں بھی ہم خیال لوگ آئے ہوں گے۔ اور ہر شخص اپنے صالح اہل و عیال اور دوستوں میں ہوگا۔ نجات پانے والے شخص کی تصویر کشی اسی طرح ہے کہ یہ یاروں ، دوستوں اور اپنے خاندان والوں کی طرف فرحاں و شاداں جارہا ہوگا اور اسے نجات اور ملاقات کی دوہری خوشی ہوگی اور پھر جنتوں میں۔</p><p>یہ تو تھی دائیں بازو والوں کی صورت حالات ، اس کے مقابلے میں بالکل ایک مختلف صورت حالات بھی ہے ان لوگوں کی جو پکڑے جائیں گے ، اپنے برے اعمال کی پاداش میں۔ یہ لوگ تو اپنا اعمال نامہ لینا بھی نہ چاہیں گے۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>এবং সে তার স্বজনদের নিকট প্রফুল্লচিত্তে ফিরে যাবে।[১]</p><p>[১] স্বজন বলতে তার পরিবারের মধ্যে থেকে যারা জান্নাতী হবে তারা অথবা এ হতে উদ্দেশ্য হল, সেই সমস্ত বেহেশ্তী হুর ও গিলমান, যা জান্নাতীগণ লাভ করবে।</p>"
      },
      {
        "resource_id": 14,
        "text": "أي ويرجع إلى أهله في الجنة قاله قتادة والضحاك: مسرورا أي فرحا مغتبطا بما أعطاه الله عز وجل. وقد روى الطبراني عن ثوبان مولى رسول الله صلى الله عليه وسلم أنه قال إنكم تعملون أعمالا لا تعرف ويوشك الغائب أن يثوب إلى أهله فمسرور أو مكظوم."
      },
      {
        "resource_id": 166,
        "text": "<p>এবং সে তার স্বজনদের কাছে [১] প্ৰফুল্লচিত্তে ফিরে যাবে;</p><p>[১] কোন কোন মুফাসসির বলেন, নিজের লোকজন বলতে পরিবার-পরিজন, আত্মীয়-স্বজন ও সাখী-সহযোগীদের কথা বুঝানো হয়েছে। তাদেরকেও একইভাবে মাফ করে দেয়া হয়ে থাকবে। কাতাদাহ বলেন, এখানে পরিবার বলে জান্নাতে তার যে পরিবার থাকবে তাদের বোঝানো হয়েছে। [কুরতুবী; ফাতহুল কাদীর]</p>"
      },
      {
        "resource_id": 92,
        "text": "وَيَنْقَلِبُ إِلَى أَهْلِهِ مَسْرُورًا (9) هذا تفصيل الإِجمال الذي في قوله : { إنك كادح إلى ربك كدحاً فملاقيه } [ الانشقاق : 6 ] أي رجوع جميع الناس أولئك إلى الله ، فمن أوتي كتابه بيمينه فريق من الناس هم المؤمنون ومن أوتي كتابه وراء ظهره فريق آخر وهم المشركون كما دلّ عليه قوله : { إنه ظن أن لن يحور } ، وبين منتهاهما مراتب . وإنما جاءت هذه الآية على اعتبار تقسيم الناس يومئذ بين أتقياء ومشركين .والكِتاب : صحيفة الأعمال ، وجعل إيتاؤه إياه بيمينه شعاراً للسعادة لِما هو متعارف من أن اليد اليمنى تتناول الأشياء الزكية وهذا في غريزة البشر نشأ عن كون الجانب الأيمن من الجسد أقدر وأبدر للفعل الذي يتعلق العزم بعمله فارتكز في النفوس أن البركة في الجانب الأيمن حتى سَموا البركة والسعادة يُمناً ، ووسموا ضدها بالشؤم فكانت بركة اليمين مما وضعه الله تعالى في أصل فطرة الإنسان ، وتقدم عند قوله تعالى : { قالوا إنكم كنتم تأتوننا عن اليمين } في سورة [ الصافات : 28 ] ، وقوله : { وأصحاب اليمين ما أصحاب اليمين } [ الواقعة : 27 ] . وقوله : { وأصحاب الشمال ما أصحاب الشمال } في سورة [ الواقعة : 41 ] ، وقوله : { فأصحاب الميمنة ما أصحاب الميمنة وأصحاب المشأمة ما أصحاب المشأمة } في سورة [ الواقعة : 8 ، 9 ] .والباء في قوله : بيمينه } للملابسة أو المصاحبة ، أو هي بمعنى ( في ) ، وهي متعلقة ب { أوتي } .وحرف ( سوف ) أصله لحصول الفعل في المستقبل ، والأكثر أن يراد به المستقبل البعيد وذلك هو الشائع ، ويقصد به في الاستعمال البليغ تحقق حصول الفعل واستمراره ومنه قوله تعالى : { قال سوف أستغفر لكم ربي } في سورة [ يوسف : 98 ] ، وهو هنا مفيد للتحقق والاستمرار بالنسبة إلى الفعل القابل للاستمرارِ وهو ينقلب إلى أهله مسروراً وهو المقصود من هذا الوعد . وقد تقدم عند قوله تعالى : { فسوف نصليه ناراً } في سورة [ النساء : 30 ] .والحساب اليسير : هو عَرْض أعماله عليه دون مناقشة فلا يَطول زمنه فيعجَّلُ به إلى الجنة ، وذلك إذا كانت أعماله صالحة ، فالحساب اليسير كناية عن عدم المؤاخذة .ومن أوتي كتابه وراء ظهره } هو الكافر . والمعنى : إنه يؤتى كتابه بشماله كما تقتضيه المقابلة ب { من أوتي كتابه بيمينه } وذلك أيضاً في سورة الحاقة قوله : { وأما من أوتي كتابه بشماله فيقول يا ليتني لم أوت كتابيه } ، أي يعطى كتابه من خلفه فيأخذه بشماله تحقيراً له ويناول له من وراء ظهره إظهاراً للغضب عليه بحيث لا ينظر مُناوِلُه كتابَه إلى وجهه ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 10,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 16,
        "text": "وأمَّا مَن أُعطي صحيفة أعماله من وراء ظهره، وهو الكافر بالله، فسوف يدعو بالهلاك والثبور، ويدخل النار مقاسيًا حرها. إنه كان في أهله في الدنيا مسرورًا مغرورًا، لا يفكر في العواقب، إنه ظنَّ أن لن يرجع إلى خالقه حيا للحساب. بلى سيعيده الله كما بدأه ويجازيه على أعماله، إن ربه كان به بصيرًا عليمًا بحاله من يوم خلقه إلى أن بعثه."
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : وأما من أوتي كتابه وراء ظهره نزلت في الأسود بن عبد الأسد أخي أبي سلمة قال ابن عباس . ثم هي عامة في كل مؤمن وكافر . قال ابن عباس : يمد يده اليمنى ليأخذ كتابه فيجذبه ملك ، فيخلع يمينه ، فيأخذ كتابه بشماله من وراء ظهره . وقال قتادة ومقاتل : يفك ألواح صدره وعظامه ثم تدخل يده وتخرج من ظهره ، فيأخذ كتابه كذلك ."
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 157,
        "text": "<p>واما من .................................... سعیرا (10:84 تا 12) رہے وہ لوگجن کا نامہ اعمال اس کی پیٹھ کے پیچھے دیا جائے گا تو وہ موت کو پکارے گا اور بھڑکتی ہوئی آگ میں جاپڑے گا “۔ ایسے مناظر کی تصویر کشی اس سے قبل قرآن کریم میں اس طرح کی گئی ہے کہ کامیاب ہونے والوں کا اعمال نامہ دائیں ہاتھ میں دیا گیا اور اہل جہنم کا بائیں ہاتھ میں۔ لیکن یہاں کی تصویر ذرا مختلف ہے۔ یہاں تصویر میں نظر یوں آتا ہے کہ اہل جہنم کو ان کا اعمال نامہ پیٹھ کے پیچھے سے دیا جارہا ہے۔ لہٰذا تصویر میں کوئی تضاد نہیں ہے بائیں ہاتھ میں پیچھے سے دیا جارہا ہے۔ یہ ایسے شخص کی تصویر ہے جو نامہ اعمال نہیں لینا چاہتا ہے ، وہ سامنا نہیں کرسکتا ، سخت پریشان وگریزاں ہے۔</p><p>اصل بات یہ ہے کہ ہم لوگ اعمال نامے ، دائیں ہاتھ میں دیئے جانے اور بائیں ہاتھ میں دیئے جانے کی کیفیات سے واقف نہیں ہیں ۔ ہم صرف یہ سمجھتے ہیں کہ پہلے لوگ نجات پانے والے ہیں اور جنت میں جائیں گے اور دوسرے لوگ ناکام ونامراد ہونے والے ہیں اور جہنم میں جائیں گے اور ہلاک ہوں گے۔ اصل مقصود یہی بات ہے نہ یہ کہ کیفیت کیسی ہوگی۔ اور قرآن کریم نے جو شکل و صورت بیان کی ہے اس سے بہرحال انسان پر گہرے اثرات پڑے ہیں۔ اور انسان خوف کے مارے کانپ اٹھتا ہے۔ حقیقت احوال اللہ ہی کے علم میں ہے کہ یہ مراحل کس طرح طے ہوں گے۔</p><p>یہ بدبخت جس نے زمین پر بھی اپنی زندگی ان تھک جدوجہد میں گزاری اور تھک تھکا کر اللہ کے سامنے پہنچا لیکن معصیت اور نافرمانی میں اوبا ہوا ، گناہوں کے بوجھ سے لدا پھندا۔ اب یہاں آکر اپنے انجام کو جان لیتا ہے۔ انجام بد سے دوچار ہوتا ہے۔ اب جانتا ہے کہ اب تو اس کی نہ ختم ہونے والی مشقت شروع ہوگئی ، تو یہ بدبخت اب موت کو پکارتا ہے ، موت دائمی موت اور فنا کی استدعا کرتا ہے تاکہ وہ اس بدبختی سے بچ جائے جو سا پر آنے ہی والی ہے۔ یاد رہے کہ انسان موت کی آغوش میں پناہ اس وقت لیتا ہے جب وہ سمجھ لیتا ہے کہ اس کے سوا کوئی اور راہ نجات نہیں ہے۔ نہ کوئی جائے فرار ہے تو اس وقت موت اس کی آخری تمنا ہوتی ہے ، یہ مفہوم متنبی نے اس شعر میں سمودیا ہے۔</p><p>کفی بک داء ان تری الموت شافیا</p><p>وحسب المنایا ان یکن امانیا</p><p>” اس سے بڑی اور کیا ہوگی کہ تم موت کو شفا سمجھنے لگو اور یہ مشقت کافی ہے کہ موت آرزو بن جائے ( اور آئے نہیں) “۔</p><p>لہٰذا اس سے بڑی بدبختی اور کیا ہوگی ، اور اس سے بڑی مصیبت اور کیا ہوگی کہ وہ ویصلی سعیرا (12:84) ” اور بڑھکتی ہوئی آگ میں جاپڑے گا “۔ اور یہ شخص اب موت کی تمنا کرے گا جو کبھی پوری نہ ہوگی .... اب ذرا ایک جھلک اس شخص کے ماضی کی یہاں دکھادی جاتی ہے ۔ جس کی وجہ سے یہ اس انجام تک پہنچا۔</p>"
      },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 94,
        "text": "( وأما من أوتي كتابه وراء ظهره ) فتغل يده اليمنى إلى عنقه وتجعل يده الشمال وراء ظهره ، فيؤتى كتابه بشماله من وراء ظهره . وقال مجاهد : تخلع يده اليسرى من وراء ظهره ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 10{ وَاَمَّا مَنْ اُوْتِیَ کِتٰـبَہٗ وَرَآئَ ظَہْرِہٖ۔ } ”اور جس کو دیا جائے گا اس کا اعمالنامہ اس کی پیٹھ کے پیچھے سے۔“ قرآن کریم کی اکثر آیات میں ایسے لوگوں کو بائیں ہاتھ میں اعمالنامے دیے جانے کا ذکر ہے۔ اس سیاق وسباق میں یہاں وَرَآئَ ظَہْرِہٖ کے الفاظ سے یوں لگتا ہے کہ فرشتہ ایک مجرم شخص کو جب اس کا اعمالنامہ پکڑانے لگے گا تو وہ اس سے بچنے کے لیے اپنا بایاں ہاتھ اپنی کمر کے پیچھے چھپالے گا۔ چناچہ اسی حالت میں اعمالنامہ پیچھے سے اس کے بائیں ہاتھ میں تھما دیا جائے گا۔</p>"
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 91,
        "text": "{ وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ } أي: بشماله من خلفه.   "
      },
      {
        "resource_id": 93,
        "text": "ثم بين - سبحانه - حال الأشقياء ، بعد بيانه لحال السعداء فقال : ( وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَآءَ ظَهْرِهِ . فَسَوْفَ يَدْعُواْ ثُبُوراً . ويصلى سَعِيراً ) . أى : وأما من أعطى صحيفة أعماله - لسوادها وقبح أعمالها - بشماله من وراء ظهره وهو الكافر - والعياذ بالله - قيل تغل يمناه إلى عنقه ، وتجعل شماله وراء ظهره ، على سبيل الإِهانة والإذلال له ."
      },
      {
        "resource_id": 14,
        "text": "أي بشماله من وراء ظهره تثنى يده إلى ورائه ويعطي كتابه بها كذلك."
      },
      {
        "resource_id": 165,
        "text": "<p>পক্ষান্তরে যাকে তার আমলনামা তার পিঠের পিছন দিক থেকে দেওয়া হবে,</p>"
      },
      {
        "resource_id": 92,
        "text": "وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ (10) وظرف { وراء ظهره } في موضع الحال من { كتابه } .و { ينقلب إلى أهله } أي يرجع . والانقلاب : الرجوع إلى المكان الذي جيء منه ، وقد تقدم قريباً في سورة المطففين .والأهل : العشيرة من زوجة وأبناء وقرابة .وهذا التركيب تمثيل لحال المحاسَب حساباً يسيراً في المسرّة والفوز والنجاة بعد العمل الصالح في الدنيا ، بحال المسافر لتجارة حين يرجع إلى أهله سالماً رابحاً لما في الهيئة المشبه بها من وفرة المسرة بالفوز والربح والسلامة ولقاء الأهل وكلهم في مسرة ، فذلك وجه الشبه بين الهيْأتين وهو السرور المألوف للمخاطبين فالكلام استعارة تمثيلية .وليس المراد رجوعه إلى منزله في الجنة لأنه لم يكن فيه من قبل حتى يقال لمصيره إليه انقلاب ، ولأنه قد لا يكون له أهل . وهو أيضاً كناية عن طول الراحة لأن المسافر إذا رجع إلى أهله فارق المتاعب زمان ."
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ (10)يقول تعالى ذكره: وأما من أعطي كتابه منكم أيها الناس يومئذ وراء ظهره، وذلك أن جعل يده اليمنى إلى عنقه وجعل الشمال من يديه وراء ظهره، فيتناول كتابه بشماله من وراء ظهره، ولذلك وصفهم جلَّ ثناؤه أحيانًا أنهم يؤتون كتبهم بشمائلهم، وأحيانًا أنهم يؤتونها من وراء ظهورهم.وبنحو الذي قلنا في ذلك أهل التأويل.* ذكر من قال ذلك:حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى؛ وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، قوله: ( وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ ) قال: يجعل يده من وراء ظهره."
      },
      {
        "resource_id": 166,
        "text": "<p>আর যাকে তার ‘আমলনামা তার পিঠের পিছনদিক থেকে দেয়া হবে,</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 11,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      { "resource_id": 157, "text": "" },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 93,
        "text": "( فَسَوْفَ يَدْعُواْ ثُبُوراً ) أى : فسوف يطلب الهلاك ، بأن ينادى عليه بحسرة وندامة ويقول : أيها الموت أقبل فهذا أوانك ، لتنقذنى مما أنا فيه من سوء .وفى طلبه للهلاك ، وتفضيله على ما هو فيه ، دليل على أن هذا الشقى - والعياذ بالله - قد وصل به الحال السيئ إلى أقصى مداه ، حتى لقد أصبح الهلاك نهاية أمانية ، كما قال الشاعر :كفى بك داء أن ترى الموت شافيا ... وحسب المنايا أن يكن أمانيافالمراد بالدعاء فى قوله ( يَدْعُواْ ثُبُوراً ) النداء . والثبور : الهلاك ، بأن يقول : يا ثبوراه أقبل فهذا أوان إقبالك ."
      },
      {
        "resource_id": 92,
        "text": "فَسَوْفَ يَدْعُو ثُبُورًا (11) والمراد بالدعاء في قوله : { يدعو ثبوراً } النداء ، أي ينادي الثبور بأن يقول : يا ثبوري ، أو يا ثبورا ، كما يقال : يا ويلي ويا ويلتنا .والثبور : الهلاك وسوء الحال وهي كلمة يقولها من وقع في شقاء وتعس .والنداء في مثل هذه الكلمات مستعمل في التحسر والتوجع من معنى الاسم الواقع بعد حرف النداء .{ ويصلى } قرأه نافع وابن كثير وابن عامر والكسائي بتشديد اللام مضاعف صلاهُ إذا أحرقَه ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "أي بالهلاك فيقول : يا ويلاه , يا ثبوراه ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 1 1{ فَسَوْفَ یَدْعُوْا ثُــبُوْرًا۔ } ”تو اب وہ موت کی طلب کرے گا۔“ اس وقت اس کی ایک ہی خواہش ہوگی کہ مجھے موت آجائے اور میں مر کر ختم ہو جائوں۔</p>"
      },
      { "resource_id": 14, "text": "أي خسارا وهلاكا." },
      {
        "resource_id": 15,
        "text": "وقوله: ( فَسَوْفَ يَدْعُو ثُبُورًا ) يقول: فسوف ينادي بالهلاك، وهو أن يقول: واثبوراه، واويلاه، وهو من قولهم: دعا فلان لهفه: إذا قال: والهفاه.وبنحو الذي قلنا في ذلك قال أهل التأويل.وقد ذكرنا معنى الثبور فيما مضى بشواهده، وما فيه من الرواية.حُدثت عن الحسين، قال: سمعت أبا معاذ يقول: ثنا عبيد، قال: سمعت الضحاك يقول في قوله: ( يَدْعُو ثُبُورًا ) قال: يدعو بالهلاك ."
      },
      {
        "resource_id": 94,
        "text": "\"فسوف يدعو ثبوراً\"، ينادي بالويل والهلاك إذا قرأ كتابه يقول: يا ويلاه يا ثبوراه، كقوله تعالى: \"دعوا هنالك ثبوراً\" (الفرقان- 13)."
      },
      {
        "resource_id": 91,
        "text": "{ فَسَوْفَ يَدْعُو ثُبُورًا } من الخزي والفضيحة، وما يجد في كتابه من الأعمال التي قدمها ولم يتب منها. "
      },
      {
        "resource_id": 165,
        "text": "<p>অচিরেই সে মৃত্যুকে আহবান করবে। [১]</p><p>[১] ثبور অর্থ হল ধ্বংস ও ক্ষতি। অর্থাৎ, সে চিল্লাবে ও চিৎকার করবে, 'আমি মরে গেলাম, ধ্বংস হয়ে গেলাম' বলে আর্তনাদ করতে থাকবে।</p>"
      },
      { "resource_id": 166, "text": "<p>সে অবশ্যই তার ধ্বংস ডাকবে;</p>" },
      {
        "resource_id": 16,
        "text": "وأمَّا مَن أُعطي صحيفة أعماله من وراء ظهره، وهو الكافر بالله، فسوف يدعو بالهلاك والثبور، ويدخل النار مقاسيًا حرها. إنه كان في أهله في الدنيا مسرورًا مغرورًا، لا يفكر في العواقب، إنه ظنَّ أن لن يرجع إلى خالقه حيا للحساب. بلى سيعيده الله كما بدأه ويجازيه على أعماله، إن ربه كان به بصيرًا عليمًا بحاله من يوم خلقه إلى أن بعثه."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 12,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 16,
        "text": "وأمَّا مَن أُعطي صحيفة أعماله من وراء ظهره، وهو الكافر بالله، فسوف يدعو بالهلاك والثبور، ويدخل النار مقاسيًا حرها. إنه كان في أهله في الدنيا مسرورًا مغرورًا، لا يفكر في العواقب، إنه ظنَّ أن لن يرجع إلى خالقه حيا للحساب. بلى سيعيده الله كما بدأه ويجازيه على أعماله، إن ربه كان به بصيرًا عليمًا بحاله من يوم خلقه إلى أن بعثه."
      },
      {
        "resource_id": 90,
        "text": "ويصلى سعيرا أي ويدخل النار حتى يصلى بحرها . وقرأ الحرميان وابن عامر والكسائي ( ويصلى ) بضم الياء وفتح الصاد ، وتشديد اللام ، كقوله تعالى : ثم الجحيم صلوه وقوله : وتصلية جحيم . الباقون ويصلى بفتح الياء مخففا ، فعل لازم غير متعد ; لقوله : إلا من هو صال الجحيم [ ص: 235 ] وقوله : يصلى النار الكبرى وقوله ثم إنهم لصالو الجحيم . وقراءة ثالثة رواها أبان عن عاصم وخارجة عن نافع وإسماعيل المكي عن ابن كثير ( ويصلى ) بضم الياء وإسكان الصاد وفتح اللام مخففا ; كما قرئ ( وسيصلون ) بضم الياء ، وكذلك في ( الغاشية ) قد قرئ أيضا : تصلى نارا وهما لغتان صلى وأصلى ; كقوله : ( نزل وأنزل ) ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "( ويصلى سعيرا ) قرأ أبو جعفر ، وأهل البصرة ، وعاصم ، وحمزة : و \" يصلى \" بفتح الياء خفيفا كقوله : \" يصلى النار الكبرى \" ( الأعلى - 12 ) وقرأ الآخرون بضم الياء [ وفتح الصاد ] وتشديد اللام كقوله : \" وتصلية جحيم \" ( الواقعة - 94 ) \" ثم الجحيم صلوه \" ( الحاقة - 31 ) ."
      },
      { "resource_id": 159, "text": "" },
      { "resource_id": 381, "text": "" },
      { "resource_id": 14, "text": "ناراً" },
      {
        "resource_id": 92,
        "text": "وَيَصْلَى سَعِيرًا (12) وقرأه أبو عمرو وعاصم وحمزة وأبو جعفر ويعقوب وخلف { ويصلى } بفتح التحتية وتخفيف اللام مضارع صَلِي اللازم إذا مسته النار كقوله : { يصْلَوْنَها يوم الدين } [ الانفطار : 15 ] .وانتصب { سعيراً } على نزع الخافض بتقدير يُصلَّى بسعير ، وهذا الوجه هو الذي يطرد في جميع المواضع التي جاء فيها لفظ النار ونحوه منصوباً بعد الأفعال المشتقة من الصلي والتصلية ، وقد قدمنا وجهه في تفسير قوله تعالى : { وسيصلون سعيراً } في سورة [ النساء : 10 ] فانظره ."
      },
      {
        "resource_id": 93,
        "text": "وقوله - تعالى - ( ويصلى سَعِيراً ) بيان للعذاب الذى يحل به . أى : ويدخل النار الشديدة الاشتعال فيتقلب فيها ، ويقاسى حرها ."
      },
      {
        "resource_id": 91,
        "text": "{ وَيَصْلَى سَعِيرًا } أي: تحيط به السعير من كل جانب، ويقلب على عذابها، وذلك لأنه في الدنيا"
      },
      {
        "resource_id": 165,
        "text": "<p>এবং সে জ্বলন্ত আগুনে প্রবেশ করবে।</p>"
      },
      { "resource_id": 166, "text": "<p>এবং জ্বলন্ত আগুনে দগ্ধ হবে;</p>" },
      {
        "resource_id": 170,
        "text": "Он получит свою книгу слева из-за спины и прочтет в ней о грехах, в которых он так и не покаялся. И тогда от стыда и позора он пожелает себе погибели. Пламень охватит его со всех сторон, и его ввергнут в адские муки."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَيَصْلَى سَعِيرًا ) اختلفت القرّاء في قراءة ذلك، فقرأته عامة قرّاء مكة والمدينة والشام: ( وَيُصَلَّى ) بضم الياء وتشديد اللام، بمعنى: أن الله يصليهم تصلية بعد تصلية، وإنضاجة بعد إنضاجة، كما قال تعالى:  كُلَّمَا نَضِجَتْ جُلُودُهُمْ بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا  ، واستشهدوا لتصحيح قراءتهم ذلك كذلك، بقوله:  ثُمَّ الْجَحِيمَ صَلُّوهُ  وقرأ ذلك بعض المدنيين وعامة قرّاء الكوفة والبصرة: ( وَيَصْلَى ) بفتح الياء وتخفيف اللام، بمعنى: أنهم يَصْلونها ويَرِدونها، فيحترقون فيها، واستشهدوا لتصحيح قراءتهم ذلك كذلك بقول الله:  يَصْلَوْنَهَا  و  إِلا مَنْ هُوَ صَالِ الْجَحِيمِ  .والصواب من القول في ذلك عندي أنهما قراءتان معروفتان صحيحتا المعنى، فبأيتهما قرأ القارئ فمصيب."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 13,
    "tafsirs": [
      {
        "resource_id": 16,
        "text": "وأمَّا مَن أُعطي صحيفة أعماله من وراء ظهره، وهو الكافر بالله، فسوف يدعو بالهلاك والثبور، ويدخل النار مقاسيًا حرها. إنه كان في أهله في الدنيا مسرورًا مغرورًا، لا يفكر في العواقب، إنه ظنَّ أن لن يرجع إلى خالقه حيا للحساب. بلى سيعيده الله كما بدأه ويجازيه على أعماله، إن ربه كان به بصيرًا عليمًا بحاله من يوم خلقه إلى أن بعثه."
      },
      {
        "resource_id": 14,
        "text": "أي فرحا لا يفكر في العواقب ولا يخاف مما أمامه فأعقبه ذلك الفرح اليسير الحزن الطويل."
      },
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 168,
        "text": "<p>إِنَّهُ كَانَ فِي أَهْلِهِ مَسْرُورًا (He had been joyful among his people...84:13). This verse tells us that those who will be given their Record in their left hands from behind their backs, they will desire death and destruction under the impression that this might end their misery. But it will not be possible for them to die. One of the reasons given here for his misery is that he used to live joyfully among his people in the world, and he was completely oblivious of the Hereafter. The believers, on the other hand, never for a moment were oblivious of the Hereafter in the life of this world. At every moment of pleasure and comfort, they were anxious and worried about the Hereafter. The Qur'an quotes the believers on another occasion as saying:</p><p>إِنَّا كُنَّا قَبْلُ فِي أَهْلِنَا مُشْفِقِينَ</p><p>'Indeed we were afraid (of Allah's punishment) when we were amidst of our family, [ At-Tur 26]</p><p>In other words, they lived among their families and yet were fearful and conscious of the Hereafter. The consequences of the two groups will be appropriate to their respective positions. Those who led a life of luxury and pleasure in this world with their families oblivious of the Hereafter, their portion will be punishment of Hell in the next world. Those who were aware of reckoning and feared punishment in the next world will live with their families in eternal luxury, pleasure and happiness. This indicates that a believer should not be immersed in the comforts of this life. At no time and in no circumstance should he be oblivious to the reckoning of the Hereafter.</p>"
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 94,
        "text": "\"إنه كان في أهله مسروراً\"، يعني في الدنيا، باتباع هواه وركوب شهوته."
      },
      {
        "resource_id": 92,
        "text": "إِنَّهُ كَانَ فِي أَهْلِهِ مَسْرُورًا (13) وقوله : { إنه كان في أهله مسروراً } مستعمل في التعجيب من حالهم كيف انقلبت من ذلك السرور الذي كان لهم في الحياة الدنيا المعروف من أحوالهم بما حكي في آيات كثيرة مثل قوله : { أولي النعمة } [ المزمل : 11 ] وقوله : { وإذا انقلبوا إلى أهلهم انقلبوا فاكهين } [ المطففين : 31 ] فآلوا إلى ألم النار في الآخرة حتى دَعوا بالثبور .وتأكيد الخبر من شأن الأخبار المستعملة في التعجيب كقول عمر لحذيفة بن اليمان : «إنَّك عَلَيه لجريء» ( أي على النبي صلى الله عليه وسلم . وهذه الجملة معترضة ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "إنه كان في أهله أي في الدنيا مسرورا قال ابن زيد : وصف الله أهل الجنة بالمخافة والحزن والبكاء والشفقة في الدنيا فأعقبهم به النعيم والسرور في الآخرة ، وقرأ قول الله تعالى : إنا كنا قبل في أهلنا مشفقين فمن الله علينا ووقانا عذاب السموم . قال : ووصف أهل النار بالسرور في الدنيا والضحك فيها والتفكه . فقال : إنه كان في أهله مسرورا"
      },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - ( إِنَّهُ كَانَ في أَهْلِهِ مَسْرُوراً . إِنَّهُ ظَنَّ أَن لَّن يَحُورَ ) تعليل لما أصابه من سوء . أى : إن هذا الشقى كان فى الدنيا فرحا بطرا بين أهله ، لا يفكر فى عاقبة ، ولا يعمل حسابا لغير ملذاته وشهواته ، وإنه فوق ذلك ( ظن ) أى : أيقن أنه لن يرجع إلى ربه يوم القيامة ، ليحاسبه على أعماله ، ويجازيه بما يستحقه من جزاء ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( إِنَّهُ كَانَ فِي أَهْلِهِ مَسْرُورًا ) يقول تعالى ذكره: إنه كان في أهله في الدنيا مسرورا لما فيه من خلافه أمرَ الله، وركوبه معاصيه.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( إِنَّهُ كَانَ فِي أَهْلِهِ مَسْرُورًا ) : أي في الدنيا ."
      },
      {
        "resource_id": 91,
        "text": "{ كَانَ فِي أَهْلِهِ مَسْرُورًا } لا يخطر البعث على باله، وقد أساء. "
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 13{ اِنَّہٗ کَانَ فِیْٓ اَہْلِہٖ مَسْرُوْرًا۔ } ”یقینا دنیا میں وہ اپنے اہل و عیال میں بہت خوش و خرم تھا۔“ دنیا میں وہ حرام کی کمائی سے اپنے اہل و عیال کے ساتھ عیش کرتا رہا اور آخرت کے محاسبے کا کبھی تصور بھی ذہن میں نہ لایا۔ یہاں پر ایک اہم نکتہ یہ بھی سمجھ لیجیے کہ اگر کوئی شخص اپنی روزی تو سو فیصد حلال ذرائع سے کما رہا ہے لیکن وہ اللہ کے دین کا حق ادا نہیں کر رہا تو ایسے شخص کی حلال ذرائع سے کمائی ہوئی وہ روزی بھی حلال نہیں۔ اس لیے کہ اس نے اپنی روزی کمانے کی اس تگ و دو میں جو وقت ‘ صلاحیتیں اور وسائل صرف کیے ہیں ان میں دین کے حقوق کا حصہ بھی شامل تھا۔ گویا اپنے وقت ‘ وسائل اور اپنی صلاحیتوں کا وہ حصہ جو اسے اللہ کے دین کے لیے خرچ کرنا چاہیے تھا اس حصے کو غصب کر کے وہ اپنے ذاتی استعمال میں لے آیا ہے۔ تو دین کے حقوق کو غصب کرکے کمائی ہوئی ایسی روزی حلال کیسے ہوسکتی ہے ؟ دراصل حلال و حرام کے معاملے کو بہت دقت نظری سے جانچنے اور پرکھنے کی ضرورت ہے۔ بدقسمتی سے ہمارے ہاں اس معاملے کو عام طور پر بہت سطحی انداز میں دیکھا اور پرکھا جاتا ہے۔ مثلاً ایک عام مسلمان سور کا گوشت کھانے کا تو تصور بھی نہیں کرسکتا لیکن وہ اس بکری کا گوشت بہت مزے اور رغبت سے کھا لیتا ہے جو اس نے کسی کی جیب پر ڈاکہ ڈال کر خریدی ہوتی ہے۔ اب ایسی بکری کے بارے میں کون کہے گا کہ وہ حلال ہے اور حرام نہیں ہے ! اس موضوع کا ایک پہلو یہ بھی ہے کہ اگر کوئی مسلمان باطل کے غلبے کے تحت اطمینان و سکون سے زندگی بسر کر رہا ہے اور اس نظام کو تبدیل کرنے کے لیے کوئی جدوجہد نہیں کر رہا تو وہ بزعم خویش بیشک ناپ تول کر حلال ہی کیوں نہ کھا رہا ہو ‘ اس کا کھانا پینا حتیٰ کہ اس ماحول میں سانس لینا سب حرام ہے۔ ایسے شخص کو خود سوچنا چاہیے کہ وہ کس نظام کی چاکری کر رہا ہے ؟ کس کے اقتدار کو کندھا دے رہا ہے ؟ تنخواہ کہاں سے لے رہا ہے ؟ اور اپنا کاروبار کس کی مدد سے آگے بڑھا رہا ہے ؟ ظاہر ہے وہ یہ سب کچھ باطل نظام کے لیے کر رہا ہے اور طاغوت کی فراہم کردہ چھتری کے سائے میں کررہا ہے۔ چناچہ کسی مسلمان کا کسی باطل نظام کے تحت ہنسی خوشی زندگی گزارنا کسی طور پر جائز نہیں۔ اِلا ّیہ کہ ایسی صورت حال میں وہ کراہت اور بےچینی میں زندگی بسرکرے ‘ اپنی ضروریات کو کم سے کم سطح پر رکھے اور باطل نظام کو بدلنے کے لیے اپنا تن من دھن کھپا دینے پر ہمہ وقت کمربستہ رہے۔ اس طرح امید کی جاسکتی ہے کہ اس کی یہ سوچ اور جدوجہد باطل نظام کے تحت زندگی بسر کرنے کے گناہ کا کفارہ بن جائے گی۔ آیات زیر مطالعہ میں دو انسانی کرداروں کا نقشہ دکھایا گیا ہے۔ ان میں ایک کردار تو اللہ کے اس بندے کا ہے جو دنیوی زندگی کے دوران آخرت کی جواب طلبی کے احساس سے ہر وقت لرزاں و ترساں رہتا تھا۔ ایسے لوگوں کے اعصاب پر آخرت کے احتساب کا خوف اس حد تک مسلط ہوتا ہے کہ وہ اپنی اس کیفیت کو جنت میں پہنچ کر بھی یاد کریں گے : { قَالُوْا اِنَّا کُنَّا قَبْلُ فِیْٓ اَہْلِنَا مُشْفِقِیْنَ۔ } الطور ”وہ کہیں گے کہ ہم پہلے دنیا میں اپنے اہل و عیال میں ڈرتے ہوئے رہتے تھے“۔ ایسے ہی ایک شخص کے بارے میں یہاں بتایا گیا ہے کہ وہ اللہ کی عدالت سے اپنی کامیابی کی نوید سننے کے بعد اپنے گھر والوں کی طرف شاداں وفرحاں لوٹے گا۔ اس کے مقابلے میں ایک کردار وہ ہے جو آخرت اور آخرت کے محاسبے سے بیخبر اپنے اہل و عیال کے ساتھ عیش و عشرت میں مست رہا۔ ایسے شخص نے دنیا میں بلاشبہ ایک خوشحال اور خوشیوں بھری زندگی گزاری ‘ لیکن آخرت میں اس کے لیے جہنم کی آگ کے سوا کچھ نہیں ہوگا۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>কেননা, সে তার স্বজনদের মধ্যে আনন্দে মত্ত ছিল।[১]</p><p>[১] অর্থাৎ, দুনিয়ায় নিজের প্রবৃত্তির চাহিদা মিটাতে মগ্ন এবং আপন পরিবারের মাঝে বড় আনন্দিত ছিল।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>নিশ্চয় সে তার স্বজনদের মধ্যে আনন্দে ছিল,</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>انہ کان .................... مسرور (13:84) ” وہ اپنے گھر والوں میں مگن تھا “۔ یہ حاضر وموجود کا فدائی تھا ، غلام تھا ، اور مستقبل سے غافل تھا۔ یہ اس بات سے لاپرواہ تھا کہ قیامت کے میدان میں اسے کیا پیش آنے والا ہے۔ یہ قیامت کو کوئی اہمیت نہیں دیتا تھا اور نہ اس کے لئے کوئی تیاری کرتا تھا۔</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 14,
    "tafsirs": [
      {
        "resource_id": 16,
        "text": "وأمَّا مَن أُعطي صحيفة أعماله من وراء ظهره، وهو الكافر بالله، فسوف يدعو بالهلاك والثبور، ويدخل النار مقاسيًا حرها. إنه كان في أهله في الدنيا مسرورًا مغرورًا، لا يفكر في العواقب، إنه ظنَّ أن لن يرجع إلى خالقه حيا للحساب. بلى سيعيده الله كما بدأه ويجازيه على أعماله، إن ربه كان به بصيرًا عليمًا بحاله من يوم خلقه إلى أن بعثه."
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "\"إنه ظن أن لن يحور\"، أن لن يرجع إلينا ولن يبعث."
      },
      { "resource_id": 159, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:15 for complete tafsir.</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>নিশ্চয় সে তার স্বজনদের মধ্যে আনন্দে ছিল,</p><p>[১] অর্থাৎ যার আমলনামা তার পিঠের দিক থেকে বাম হাতে আসবে, সে মরে মাটি হয়ে যাওয়ার আকাঙ্খা করবে, যাতে আযাব থেকে বেঁচে যায়। কিন্তু সেখানে তা সম্ভবপর হবে না। তাকে জাহান্নামে দাখিল করা হবে। এর এক কারণ এই বলা হয়েছে যে, সে দুনিয়াতে তার পরিবার-পরিজনের মধ্যে আখেরাতের প্রতি উদাসীন হয়ে আনন্দ-উল্লাসে দিন যাপন করত। সে তার রবের কাছে ফিরে যাওয়ার ব্যাপারে বিশ্বাসী ছিল না। হিসাব-নিকাশের জন্য পুনরুথিত হবে না। কারণ সে পুনরুত্থানে ও আখেরাতে মিথ্যারোপ করত। [ফাতহুল কাদীর]</p>"
      },
      {
        "resource_id": 90,
        "text": "إنه ظن أن لن يحور أي لن يرجع حيا مبعوثا فيحاسب ، ثم يثاب أو يعاقب . يقال : حار يحور إذا رجع ; قال لبيد :وما المرء إلا كالشهاب وضوئه يحور رمادا بعد إذ هو ساطعوقال عكرمة وداود بن أبي هند ، يحور كلمة بالحبشية ، ومعناها يرجع . ويجوز أن تتفق الكلمتان فإنهما كلمة اشتقاق ; ومنه الخبز الحوارى ; لأنه يرجع إلى البياض . وقال ابن عباس : ما كنت أدري : ما يحور ؟ حتى سمعت أعرابية تدعو بنية لها : حوري ، أي ارجعي إلي ، فالحور في كلام العرب الرجوع ; ومنه قوله - عليه السلام - : اللهم إني أعوذ بك من الحور بعد الكور يعني : من الرجوع إلى النقصان بعد الزيادة ، وكذلك الحور بالضم . وفي المثل ( حور في محارة ) أي نقصان في نقصان . يضرب للرجل إذا كان أمره يدبر ، قال الشاعر :واستعجلوا عن خفيف المضغ فازدردوا     والذم يبقى وزاد القوم في حوروالحور أيضا : الاسم من قولك : طحنت الطاحنة فما أحارت شيئا ; أي ما ردت شيئا من الدقيق . والحور أيضا الهلكة ; قال الراجز :في بئر لا حور     سرى ولا شعر[ ص: 236 ] قال أبو عبيدة : أي بئر حور ، و ( لا ) زائدة . وروي ( بعد الكون ) ومعناه من انتشار الأمر بعد تمامه . وسئل معمر عن الحور بعد الكون ، فقال : هو الكنتي . فقال له عبد الرزاق : وما الكنتي ؟ فقال : الرجل يكون صالحا ثم يتحول رجل سوء . قال أبو عمرو : يقال للرجل إذا شاخ : كنتي ، كأنه نسب إلى قوله : كنت في شبابي كذا . قال :فأصبحت كنتيا وأصبحت عاجنا     وشر خصال المرء كنت وعاجنعجن الرجل : إذا نهض معتمدا على الأرض من الكبر . وقال ابن الأعرابي : الكنتي : هو الذي يقول : كنت شابا ، وكنت شجاعا ، والكاني هو الذي يقول : كان لي مال وكنت أهب ، وكان لي خيل وكنت أركب ."
      },
      {
        "resource_id": 165,
        "text": "<p>যেহেতু সে ভাবতো যে, সে কখনই প্রত্যাবর্তিত হবে না।[১]</p><p>[১] এটা ছিল তার আনন্দিত হওয়ার কারণ। অর্থাৎ, আখেরাতের প্রতি তার বিশ্বাসই ছিল না। حور শব্দের অর্থ হল ফিরে যাওয়া। যেমন, নবী (সাঃ) এ দু'আ করতেন, 'আল্লাহুম্মা ইন্নী আউযু বিকা মিনাল হাওরি বা'দাল কাওর।' <em>(সহীহ মুসলিম হজ্জ্ব অধ্যায়, তিরিমিযী, ইবনে মাজাহ)</em> মুসলিম শরীফে 'বা'দাল কাওন' শব্দ এসেছে। উদ্দেশ্য হল যে, এ সকল কথা হতে আমি আশ্রয় প্রার্থনা করছি, যাতে আমি ঈমানের পর কুফরী, আনুগত্যের পর অবাধ্যতা অথবা ভালর পর মন্দের দিকে ফিরে না যাই।</p>"
      },
      {
        "resource_id": 14,
        "text": "أي كان يعتقد أنه لا يرجع إلى الله ولا يعيده بعد موته قاله ابن عباس وقتادة وغيرهما والحور هو الرجوع."
      },
      {
        "resource_id": 93,
        "text": "قال القرطبى : قوله ( إِنَّهُ ظَنَّ أَن لَّن يَحُورَ ) أى : لن يرجع حيا مبعوثا فيحاسب . ثم يثاب أو يعاقب . يقال : حار فلان يحور إذا رجع ، ومنه قول لبيد :وما المرء إلا كالشهاب وضوئه ... يحور رمادا بعد إذ هو ساطعفالحور فى كلام العرب : ومنه قوله صلى الله عليه وسلم \" اللهم إنى أعوذ بك من الحَوْر بعد الكَوْر \" يعنى : من الرجوع إلى النقصان بعد الزيادة . ."
      },
      {
        "resource_id": 91,
        "text": "ولم  يظن أنه راجع إلى ربه وموقوف بين يديه. "
      },
      {
        "resource_id": 170,
        "text": "Мысли о воскрешении не приходили ему в голову. Он грешил и не предполагал, что вернется к своему Господу и предстанет пред Ним."
      },
      {
        "resource_id": 157,
        "text": "<p>انہ کان ........................ یحور (14:84) ” وہ اپنے گھر والوں میں مگن تھا۔ اس نے سمجھا تھا کہ اسے کبھی پلٹنا نہیں ہے “۔ یہ حالت تو اس کی دنیا میں تھی اور وہ تو چلی گئی۔ آج تو قرآن ہمیں قیامت کے میدان میں لے گیا ہے اور دنیا تو بیت گئی ہے اور یہاں حساب و کتاب ہورہا ہے اور قرآن انداز نے زمان ومکان کو لپیٹ کر رکھ دیا ہے۔</p><p>انہ طن .................... یحور (14:84) ” اس نے سمجھا تھا کہ اسے کبھی پلٹنا نہیں ہے “۔ رب کی طرف پلٹ کر نہیں جانا ہے۔ اگر اس نے یہ سمجھا ہوتا کہ اللہ کے سامنے جانا ہے تو یہ اس حاضری کے لئے تو تیاری کرتا اور آخرت کو کچھ تو اہمیت دیتا لیکن اس کو یقین نہ تھا بلکہ ظن یہ تھا کہ قیامت ہی نہیں ہے۔</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( إِنَّهُ ظَنَّ أَنْ لَنْ يَحُورَ* بَلَى ) يقول تعالى ذكره: إنّ هذا الذي أُوتي كتابه وراء ظهره يوم القيامة، ظنّ في الدنيا أن لن يرجع إلينا، ولن يُبعث بعد مماته، فلم يكن يبالي ما ركب من المآثم؛ لأنه لم يكن يرجو ثوابًا، ولم يكن يخشى عقابًا، يقال منه: حار فلان عن هذا الأمر: إذا رجع عنه، ومنه الخبر الذي رُوي عن رسول الله صلى الله عليه وسلم أنه كان يقول في دعائه: \" اللَّهُمَّ إنّي أعُوذُ بِكَ مِنَ الحَوْرِ بَعْدَ الكَوْرِ\" يعني بذلك: من الرجُوع إلى الكفر، بعد الإيمان.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح، قال: ثني معاوية، عن عليّ، عن ابن عباس، قوله: ( إِنَّهُ ظَنَّ أَنْ لَنْ يَحُورَ ) يقول: يُبعث .حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى؛ وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، قوله: ( إِنَّهُ ظَنَّ أَنْ لَنْ يَحُورَ * بَلَى ) قال: أن لا يرجع إلينا .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( إِنَّهُ ظَنَّ أَنْ لَنْ يَحُورَ ) : أن لا مَعَادَ له ولا رجعة .حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة ( أَنْ لَنْ يَحُورَ ) قال: أن لن ينقلب: يقول: أن لن يبعث .حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، ( ظَنَّ أَنْ لَنْ يَحُورَ ) قال: يرجع .حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله: ( أَنْ لَنْ يَحُورَ ) قال: أن لن ينقلب ."
      },
      {
        "resource_id": 92,
        "text": "إِنَّهُ ظَنَّ أَنْ لَنْ يَحُورَ (14) وموقع جملة : { إنه ظن أن لن يحور } موقع التعليل لمضمون جملة : { وأما من أوتي كتابه وراء ظهره } إلى آخرها .وحرف ( إنّ ) فيها مُغْننٍ عن فاء التعليل ، فالمعنى : يصلى سعيراً لأنه ظن أن لن يحور ، أي لن يرجع إلى الحياة بعد الموت ، أي لأنه يُكَذِّبُ بالبعث ، يقال : حار يحور ، إذا رجع إلى المكان الذي كان فيه ، ثم أطلق على الرجوع إلى حالة كان فيها بعدَ أن فارقها ، وهو المراد هنا وهو من المجاز الشائع مثل إطلاق الرجوع عليه في قوله : { ثم إلينا مرجعكم } [ يونس : 23 ] وقوله : { إنه على رجعه لقادر } [ الطارق : 8 ] وسُمي يومُ البعث يومَ المعاد .وجيء بحرف { لن } الدال على تأكيد النفي وتأييده لحكاية جزمهم وقطعهم بنفيه .وحرف { بلى } يجاب به الكلام المنفي لإبطال نفيه وأكثر وقوعه بعد الاستفهام عن النفي نحو : { ألست بربكم قالوا بلى } [ الأعراف : 172 ] ويقع بعد غير الاستفهام أيضاً نحو قوله تعالى :{ زعم الذين كفروا أن لن يبعثوا قل بلى وربي لتبعثن } [ التغابن : 7 ] ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 15,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 94,
        "text": "ثم قال: \"بلى\"، أي: ليس كما ظن، بل يحور إلينا ويبعث، \" إن ربه كان به بصيرا \"، من يوم خلقه إلى أن بعثه."
      },
      {
        "resource_id": 16,
        "text": "وأمَّا مَن أُعطي صحيفة أعماله من وراء ظهره، وهو الكافر بالله، فسوف يدعو بالهلاك والثبور، ويدخل النار مقاسيًا حرها. إنه كان في أهله في الدنيا مسرورًا مغرورًا، لا يفكر في العواقب، إنه ظنَّ أن لن يرجع إلى خالقه حيا للحساب. بلى سيعيده الله كما بدأه ويجازيه على أعماله، إن ربه كان به بصيرًا عليمًا بحاله من يوم خلقه إلى أن بعثه."
      },
      {
        "resource_id": 14,
        "text": "يعني بلى سيعيده الله كما بدأه ويجازيه على أعماله خيرها وشرها فإنه كان به بصيرا أي عليما خبيرا."
      },
      {
        "resource_id": 381,
        "text": "<p><b> নামকরণ ও গুরুত্ব: </b></p><p>انشقاق শব্দের অর্থ ফেটে যাওয়া, বিদীর্ণ হওয়া। সূরার প্রথম আয়াতে বর্ণিত انشقاق শব্দ থেকেই সূরার নামকরণ করা হয়েছে।</p><p>আব্দুল্লাহ ইবনু ওমার (রাঃ) বলেন : রাসূলুল্লাহ (সাঃ) বলেন : যদি কেউ স্বচক্ষে কিয়ামতের দৃশ্য দেখে নিজেকে খুশি করতে চায় সে যেন সূরা তাকভীর, ইনফিতার ও সূরা ইনশিকাক পাঠ করে। (তিরমিযী হা. ৩৩৩৩, সহীহাহ হা. ১০৮১)</p><p>আবূ রাফে (রাঃ) বলেন : আমি আবূ হুরাইরাহ (রাঃ)-এর সাথে ইশার সালাত আদায় করেছি। তিনি</p><p class='arabic uthmani'>(إِذَا السَّمَا۬ءُ انْشَقَّتْ)</p><p>পড়লেন এবং সিজদা দিলেন। আমি তাঁকে এ সম্পর্কে জিজ্ঞাসা করলাম, তিনি বললেন : আমি আবুল কাশেম (সাঃ)-এর পেছনে (এ সূরা পাঠ শেষে) সিজদা করেছি। অতএব আমি তাঁর সাথে সাক্ষাত করা পর্যন্ত সিজদা করেই যাব। (সহীহ বুখারী হা. ৭৬৬)</p><p>অন্য বর্ণনাতে তিনি বলেন : আমরা রাসূলুল্লাহ (সাঃ)-এর সাথে</p><p>(إِذَا السَّمَا۬ءُ انْشَقَّتْ) ও (اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ)</p><p>এ দুটি সূরা পাঠান্তে সিজদা করেছি। (সহীহ মুসলিম, সিজদাতুত তিলাওয়াহ অধ্যায়)</p><p>কিয়ামতের দিন অবশ্যই মানুষকে কৃতকর্মের ফলাফল প্রদান করা হবে, সুখ আর দুঃখ এ দুটি মিলে মানুষের জীবন এবং কাফির ও মু’মিনদের জন্য যা প্রস্তুত করে রাখা হয়েছে সে সম্পর্কে সূরায় আলোচনা করা হয়েছে।</p><p><b> ১-১৫ নম্বর আয়াতের তাফসীর: </b></p><p>এ আয়াতগুলোতে কিয়ামতের দিন আকাশ ও জমিনের যে অবর্ণনীয় অবস্থা হবে এবং ডান হাতে আমলনামা প্রাপ্ত মু’মিনরা যে আনন্দ পাবে আর পেছন দিক থেকে বাম হাতে আমলনামা প্রাপ্ত কাফিররা যে দুঃখ কষ্টে থাকবে সে সম্পর্কে আলোচনা করা হয়েছে।</p><p>انْشَقَّتْ অর্থাৎ আকাশ কিয়ামতের দিন চূর্ণ-বিচূর্ণ ও বিদীর্ণ হয়ে যাবে। এর দ্বারা আকাশ যে মজবুত তার প্রমাণ পাওয়া যায়। যেমন আল্লাহ তা‘আলা বলেন :</p><p class='arabic uthmani'>(وَبَنَيْنَا فَوْقَكُمْ سَبْعًا شِدَادًا)</p><p>“আর নির্মাণ করেছি তোমাদের ওপর সাতটি মজবুত আসমান।” (সূরা নাবা ৭৮ : ১২)</p><p class='arabic uthmani'>(وَأَذِنَتْ لِرَبِّهَا)</p><p>অর্থাৎ আল্লাহ তা‘আলা তাকে ফেটে যাওয়ার যে আদেশ করবেন তা শুনবে এবং মেনে নেবে। এ আয়াত বলছে আকাশ-জমিন সব কিছু আল্লাহ তা‘আলার হুকুম মেনে চলে। এও প্রমাণ করছে যে, আকাশ আপনা-আপনিই সৃষ্টি হয়নি বরং এসবের একজন সৃষ্টিকর্তা রয়েছেন, তিনি হলেন আল্লাহ তা‘আলা।</p><p>وَحُقَّتْ অর্থাৎ তার দায়িত্ব হলো রবের ডাকে সাড়া দেয়া, তাই সে তার দায়িত্ব পালন করত ফেটে যাবে।</p><p>مُدَّتْ অর্থ : بسطت বা সম্প্রসারিত হয়ে যাবে। অথবা উদ্দেশ্য হলো জমিনের ওপরে পাহাড়সহ যা আছে সবকিছু চূর্ণ-বিচূর্ণ হয়ে সমান হয়ে যাবে। কোন উঁচু-নীচু থাকবে না।</p><p>আল্লাহ তা‘আলা বলেন :</p><p class='arabic uthmani'>(يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمٰوٰتُ وَبَرَزُوْا لِلّٰهِ الْوَاحِدِ الْقَهَّارِ ‏)‏</p><p>“যেদিন এ পৃথিবী পরিবর্তিত হয়ে অন্য পৃথিবী হবে এবং আকাশসমূহও; এবং মানুষ উপস্থিত হবে আল্লাহর সম্মুখেÑযিনি এক, পরাক্রমশালী।” (সূরা ইবরাহীম ১৪ : ৪৮)</p><p class='arabic uthmani'>(وَأَلْقَتْ مَا فِيْهَا)</p><p>অর্থাৎ জমিনের ভেতরে যে মুর্দা দাফনকৃত থাকবে সমস্ত মুর্দাকেই সে বের করে দেবে। আর যে সব গুপ্ত ধন তাতে মজুদ রয়েছে তা বের করে দিয়ে একেবারে খালি করে দেবে। একথাই আল্লাহ তা‘আলা অন্যত্র বলেন:</p><p class='arabic uthmani'>(وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا)</p><p>“এবং যখন পৃথিবী তার বোঝা বের করে দেবে”। (সূরা যিলযাল ৯৯: ২)</p><p>كَدْحًا অর্থ : কঠোর সাধনা বা পরিশ্রম, সে পরিশ্রম ভালও হতে পারে আবার মন্দও হতে পারে। অর্থাৎ যখন উল্লিখিত বস্তুসমূহ প্রকাশ পাবে তখন মানুষ তার কৃত ভাল-মন্দ সকল আমল দেখতে পাবে। জাবের (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ (সাঃ) বলেন : জিবরীল (আঃ) বললেন, হে মুহাম্মাদ! তুমি যত দিন ইচ্ছা বেঁচে থাক, তবে তোমাকে মৃত্যু বরণ করতেই হবে। তুমি যত ইচ্ছা ভালবাসা গড়ে তোলো তবে তোমাকে অবশ্যই সবাইকে ছেড়ে একদিন চলে যেতে হবে। তুমি যা ইচ্ছা আমল কর, তবে একদিন তোমাকে সে আমলের হিসাব দিতেই হবে। (আবূ দাঊদ আত তায়ালিসি পৃ. ২৪২) সুতরাং যদি সকল ভালবাসা ও মায়া ছিন্ন করে দুনিয়া ছেড়ে চলে যেতেই হয় আর আমলের হিসাব দিতেই হয় তাহলে আমাদের উচিত হবে ভাল আমল করা।</p><p>অর্থাৎ যাদের আমলনামা ডান হাতে দেয়া হবে এরা হল ডানপন্থী। এদের কথা সূরা ওয়াকিয়ার ২৭ নম্বরসহ কয়েক আয়াতে আলোচনা করা হয়েছে। এরা দুনিয়াতেও ছিল ডানপন্থী, তাদের সকল প্রকার কার্যকলাপ, আচার-আচরণ ও অবস্থা ডানপন্থীদের অন্তর্ভুক্ত ছিল।</p><p class='arabic uthmani'>(حِسَابًا يَّسِيْرًا)</p><p>বা সহজ হিসাব হলো মু’মিনের আমলনামা শুধু তার সামনে পেশ করা হবে। তার ভুল-ভ্রুটিও সামনে উপস্থিত করা হবে। অতঃপর আল্লাহ তা‘আলা নিজের রহমত ও অনুগ্রহে তাদের মার্জনা করে দেবেন। আয়িশাহ (রাঃ) হতে বর্ণিত তিনি বলেন : রাসূলুল্লাহ (সাঃ) বলেন : যার হিসাব নেয়া হবে সে ধ্বংস হয়ে যাবে। আমি বললাম : হে আল্লাহ তা‘আলার রাসূল (সাঃ) আল্লাহ তা‘আলা কি এ কথা বলেননি (فَسَوْفَ يُحَاسَبُ حِسَابًا يَّسِيْرًا) ‘তার হিসাব-নিকাশ অতি সহজ ভাবে নেয়া হবে।’ রাসূলুল্লাহ (সাঃ) বললেন : এটা হিসাব না। এটা কেবলমাত্র পেশ করা হবে। যার কিয়ামত দিবসে হিসাব নেয়া হবে তাকে শাস্তি দেয়া হবে। (সহীহ বুখারী হা. ৪৯৩৯)</p><p>আয়িশাহ (রাঃ) হতে বর্ণিত, তিনি বলেন : রাসূলুল্লাহ (সাঃ)-কে কোন এক সালাতে বলতে শুনেছি</p><p class='arabic uthmani'>اللّٰهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا</p><p>হে আল্লাহ তা‘আলা আমার হিসাব সহজ করে নিয়ো। সালাত শেষে আমি বললাম : হে আল্লাহ তা‘আলার রাসূল (সাঃ) সহজ হিসাব কী? তিনি বললেন :</p><p class='arabic uthmani'>(أَنْ يَنْظُرَ فِي كِتَابِهِ فَيَتَجَاوَزَ عَنْهُ)</p><p>শুধু আমলনামার প্রতি দৃষ্টি দেয়া হবে। অতঃপর তাকে ক্ষমা করে দেয়া হবে। কিন্তু হে আয়িশাহ! সেদিন যার হিসাব নেয়া হবে সে ধ্বংস হয়ে যাবে। (আহমাদ ৬/৪৮, সহীহ মুসলিমের শর্তানুপাতে।)</p><p>ইবনু উমার (রাঃ) হতে বর্ণিত রাসূলুল্লাহ (সাঃ) বলেন : কিয়ামতের দিন আল্লাহ তা‘আলা মু’মিন বান্দাকে কাছে ডেকে নেবেন, এমনকি তাকে ডানে রাখবেন ও ঢেকে নেবেন। অতঃপর বলবেন : তুমি যে অমুক গুনাহ করেছো তা জান, তুমি যে অমুক গুনাহ করেছো তা জান? বান্দা বলবে : হ্যাঁ, হে আমার রব জানি। এভাবে স্বীকার করতে করতে যখন দেখবে তার জন্য ধ্বংস অবধারিত তখন আল্লাহ তা‘আলা বলবেন :</p><p class='arabic uthmani'>سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا، وَأَنَا أَغْفِرُهَا لَكَ اليَوْمَ، فَيُعْطَي كِتَابَ حَسَنَاتِهِ</p><p>দুনিয়াতে এগুলো আমি তোমার ওপর গোপন রেখেছিলাম। আজ আমি তোমার এগুলো ক্ষমা করে দিলাম। অতঃপর ডান হাতে আমলনামা দেয়া হবে। কিন্তু কাফির ও মুনাফিকের ক্ষেত্রে সৃষ্টিকুল সাক্ষ্য দিয়ে বলবে ‘এরাই এদের প্রতিপালকের বিরুদ্ধে মিথ্যা আরোপ করেছিল।’ সাবধান! আল্লাহ তা‘আলার লা‘নত জালিমদের ওপর, (সহীহ বুখারী হা ২৪৪১)</p><p class='arabic uthmani'>(وَّيَنْقَلِبُ إِلٰٓي أَهْلِه۪)</p><p>অর্থাৎ জান্নাতী ব্যক্তির জন্য জান্নাতে তার যে সকল পরিবার-পরিজন আছে তাদের কাছে আনন্দচিত্তে ফিরে যাবে। পরিবার বলতে, জান্নাতী হুর, গিলমান যা জান্নাতীগণ লাভ করবে। ইবনু যায়েদ বলেন: আল্লাহ তা‘আলা ঈমানদারদেরকে দুনিয়ার ভীতি ও কষ্টের বিনিময়ে আখিরাতে জান্নাত দেবেন আর কাফিরদেরকে দুনিয়ার আনন্দ-ফুর্তির বিনিময়ে আখিরাতে জাহান্নাম দেবেন। একথা বলে তিনি সূরা তুরের ২৬-২৭ নম্বর আয়াতদ্বয় পাঠ করতেন। (তাফসীর কুরতুবী)</p><p>আর যারা কাফির তাদেরকে আমলনামা তাদের</p><p>(وَرَا۬ءَ ظَهْرِه۪)</p><p>অর্থাৎ বাম হাতে পেছন দিক থেকে দেয়া হবে। এরা ছিল দুনিয়াতে বামপন্থী, তাদের সকল কার্যকলাপ ছিল বাম। তারা আখিরাতে শত চেষ্টা করেও ডানহাতে আমলনামা নিতে পারবে না।</p><p>ثُبُوْرًا অর্থ : ধ্বংস, ক্ষতি। অর্থাৎ বামপন্থী চিৎকার করে বলবে, আমি মরে গেলাম, আমি ধ্বংস হয়ে গেলাম। আল্লাহ তা‘আলা বলেন :</p><p class='arabic uthmani'>(وَإِذَآ أُلْقُوْا مِنْهَا مَكَانًا ضَيِّقًا مُّقَرَّنِيْنَ دَعَوْا هُنَالِكَ ثُبُوْرًا لَا تَدْعُوا الْيَوْمَ ثُبُوْرًا وَّاحِدًا وَّادْعُوْا ثُبُوْرًا كَثِيْرًا)</p><p>“এবং যখন তাদেরকে শৃংখলিত অবস্থায় কোন সংকীর্ণ স্থানে নিক্ষেপ করা হবে তখন তারা তথায় ধ্বংস কামনা করবে। (তাদেরকে বলা হবে) ‘আজ তোমরা একবারের জন্য ধ্বংস কামনা কর না; বহুবার ধ্বংস হবার কামনা করতে থাক।’ (সূরা ফুরকান ২৫: ১৩-১৪)</p><p>অর্থাৎ বাম হাতে আমলনামা পাওয়া বামপন্থীদের পরিণতি হল একটাই, তা হল জাহান্নাম। আল্লাহ তা‘আলা বলেন:</p><p class='arabic uthmani'>(خُذُوْهُ فَغُلُّوْهُ ثُمَّ الْجَحِيْمَ صَلُّوْهُ ‏ ثُمَّ فِيْ سِلْسِلَةٍ ذَرْعُهَا سَبْعُوْنَ ذِرَاعًا فَاسْلُكُوْهُ) ‏</p><p>“(ফেরেশতাকে বলা হবে) তাকে ধর। অতঃপর তার গলায় বেড়ী পরিয়ে দাও। অতঃপর তাকে জাহান্নামে নিক্ষেপ কর। পুনরায় তাকে বেঁধে ফেলো এমন শেকল দ্বারা যা সত্তর হাত লম্বা।” (সূরা হাক্কাহ ৬৯: ৩০-৩২)</p><p class='arabic uthmani'>(إِنَّه كَانَ فِيْٓ أَهْلِه۪ مَسْرُوْرًا)</p><p>অর্থাৎ দুনিয়ায় নিজের প্রবৃত্তির চাহিদা মেটাতে মগ্ন এবং আপন পরিবারের মাঝে বড় আনন্দিত ছিল। আখিরাতের কোন তোয়াক্কা করত না, দীন-ধর্মের কোন পরওয়া করত না। দুনিয়াটা মস্ত বড় খাও-দাও ফুর্তি কর এ মতবাদে বিশ্বাসী ছিল।</p><p class='arabic uthmani'>(إِنَّه ظَنَّ أَنْ لَّنْ يَّحُوْرَ)</p><p>অর্থাৎ সে বিশ্বাস করত, কখনও সে আল্লাহ তা‘আলার কাছে ফিরে যাবে না এবং পুনরুত্থিত হবে না। এটাই ছিল দুনিয়াতে অন্যায়ে মত্ত ও আনন্দিত হওয়ার কারণ। নাবী (সাঃ) দু‘আ করে বলতেন :</p><p class='arabic uthmani'>اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْحَوْرِ بَعْدَ الْكَوْر</p><p>হে আল্লাহ তা‘আলা! আমি ঈমান ও আনুগত্যের পর যেন কুফরী ও অবাধ্যতায় ফিরে না যাই এ ব্যাপারে আশ্রয় চাচ্ছি। (সহীহ মুসলিম হা. ১৩৪৩)</p><p>আল্লাহ তা‘আলা মানুষের সকল কাজ কর্ম প্রত্যক্ষ করেন। সুতরাং তাঁর অগোচরে কোন কাজ করার সুযোগ নেই। সুতরাং সর্বদাই আমাদের সতর্ক থাকা উচিত আমাদের দ্বারা যেন কোন অন্যায় কাজ না হয়। কারণ সবকিছুই আল্লাহ তা‘আলার কাছে দৃশ্যমান।</p><p><b> আয়াত হতে শিক্ষণীয় বিষয়: </b></p><p>১. আকাশ, জমিন ও নক্ষত্র সবকিছু আল্লাহ তা‘আলার অনুমতিতেই ধ্বংস হয়ে যাবে।</p><p>২. মানুষ অবশ্যই তার কৃত আমলের প্রতিদান পাবে।</p><p>৩. যারা ডান হাতে আমলনামা পাবে তাদের হিসাব হবে হালকা ও তারা জান্নাতে সপরিবারে আনন্দে থাকবে।</p><p>৪. সহজ হিসাবের অর্থ জানলাম।</p><p>৫. যারা পেছন দিক থেকে বাম হাতে আমলনামা পাবে তাদের দুর্দশার শেষ হবে না। তাদের একমাত্র ঠিকানা জাহান্নাম।</p>"
      },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 157,
        "text": "<p>بلی ان ................................ بہ بصیرا (15:84) ” پلٹنا کیسے نہ تھا ، اس کا رب اس کے کرتوت دیکھ رہا تھا “۔ اس کا ظن یہ تھا کہ اللہ کی طرف لوٹ کر ہی نہیں جانا ہے ، لیکن حقیقت یہ ہے کہ اس کا رب تو اس کے حالات سے باخبر تھا ، اس کی حقیقت کو گھیرے میں لیے ہوئے تھا ، اس کے تمام اقدامات ، اور تمام حرکات سے واقف تھا ، اللہ کو معلوم تھا کہ اس نے کس انجام تک پہنچنا ہے اور یہ کہ اللہ نے اس کو اس کے کیے کی سزا دینی تھی ، چناچہ ایسا ہی ہوا ، جب اللہ کے علم کے مطابق اس نے اپنی زندگی جہنم کے مطابق گزار دی ، اور اس نے ایسا ہی کرنا تھا۔</p><p>اس بدبخت کی تصویر کے بالمقابل ایک دوسرے شخص کی تصویر ہے جو نیک بخت ہے ، اگرچہ یہ اپنی دنیا کی محدود زندگی میں اپنے گھر والوں کے دائرے کے اندر ہی خوش وخرم تھا لیکن اس کی زندگی مجموعی طور پر کسی نہ کسی طرح پر مشقت تھی۔ اس کے مقابلے میں یہ نیک بخت اب آخرت میں اپنے اہل و عیال کی طرف خوش وخرم لوٹ رہا ہے۔ یہ دنیا کی زندگی تو مختصر اور محدود تھی لیکن اخروی زندگی طویل اور لامحدود ہے۔ یہ زندگی اب بےقید ہے ، خوشگوار ہے ، طویل ہے اور ہر قسم کی مشقت اور پریشانی اور تھکاوٹ سے خالی ہے۔</p><p>اب قارئین اس طویل اور گہرے سفر سے فارغ ہوتے ہیں۔ اس میں انہوں نے بےشکار مناظر دیکھے اور تاثرات لئے ، اب سیاق کلام انہیں اس کائنات کے ایسے لمحات میں لے جاتا ہے جن میں ان کی زندگی بسر ہورہی ہے۔ یہاں انسانوں کو اس کائنات کے وہ مناظر دکھائے جاتے ہیں جن میں خود حضرت انسان کا منظر بھی ہے یہ چیزیں اس بات پر گواہ ہیں کہ انسان اور اس کے گرد پھیلی ہوئی یہ کائنات ایک گہری تدبیر اور نہایت ہی باریک اندازے اور تقدیر کے مطابق چل رہی ہے اور اس دنیا کے اور انسان کے بدلتے ہوئے لمحات و حالات اس گہری تدبیر اور تقدیر کے نتیجے میں ہیں۔</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : بلى أي ليس الأمر كما ظن ، بل يحور إلينا ويرجع . إن ربه كان به بصيرا قبل أن يخلقه ، عالما بأن مرجعه إليه . وقيل : بلى ليحورن وليرجعن . ثم استأنف فقال : إن ربه كان به بصيرا من يوم خلقه إلى أن بعثه . وقيل : عالما بما سبق له من الشقاء والسعادة ."
      },
      {
        "resource_id": 164,
        "text": "<p>ইমাম মালিক (রঃ)-এর মুআত্তা নামক হাদীস গ্রন্থে হযরত আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে যে, তিনি জনগণকে নামায পড়ান এবং ঐ নামাযে তিনি(আরবি) এ সূরাটি পাঠ করেন। অতঃপর তিনি (সিজদার আয়াতে নামাযের মধ্যেই) সিজদা করেন। নামায শেষে তিনি জনগণকে সংবাদ দেন যে, রাসূলুল্লাহ (সঃ) এভাবে নামাযের মধ্যে সিজদা করেছেন। (এ হাদীসটি সহীহ মুসলিম ও সুনানে নাসাঈতেও বর্ণিত হয়েছে)হযরত আবু রাফে (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি হযরত আবু হুরাইরার (রাঃ) সাথে এশার নামায পড়েছি। তিনি নামাযে (আরবি) সূরাটি পাঠ করেন এবং (সিজদার আয়াতে) সিজদা করেন। আমি তাকে এ সম্পর্কে জিজ্ঞেস করলে তিনি বলেনঃ আমি আবুল কাসেমের (সঃ) পিছনে (নামায পড়েছি এবং তার সিজদার সাথে) সিজদা করেছি। আমি তার সাথে সাক্ষাৎ না হওয়া পর্যন্ত (অর্থাৎ যতদিন বেঁচে আছি ততদিন পর্যন্ত) এই স্থলে সিজদা করতেই থাকবো। (ইমাম বুখারী (রঃ) হাদীসটি বর্ণনা করেছেন। এ হাদীসের আরো সনদ রয়েছে) সহীহ মুসলিম ও সুনানে নাসাঈতে হযরত আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে যে, তিনি বলেনঃ আমরা রাসূলুল্লাহ (সঃ)-এর সাথে (আরবি) এবং(আরবি) এই সূরাদ্বয়ে সিজদা করেছি।<b>১-১৫ নং আয়াতের তাফসীর</b>আল্লাহ তাআলা বলেনঃ কিয়ামতের দিন আকাশ ফেটে যাবে, ওটা স্বীয় প্রতিপালকের আদেশ পালনের জন্যে উৎকর্ণ হয়ে থাকবে এবং ফেটে যাওয়ার আদেশ পাওয়া মাত্র ফেটে টুকরো টুকরো হয়ে যাবে। তার করণীয়ই হলো আল্লাহর আদেশ পালন। কেননা, এটা ঐ আল্লাহর আদেশ যা কেউ ঠেকাতে পারে না, যিনি সবারই উপর বিজয়ী সবকিছুই যার সামনে অসহায় ও নাচার ।জমীনকে যখন সম্প্রসারিত করে দেয়া হবে। অর্থাৎ জমীনকে প্রসারিত করা হবে, বিছিয়ে দেয়া হবে এবং প্রশস্ত করা হবে। হযরত আলী ইবনে হুসাইন (রঃ) হতে বর্ণিত আছে যে, নবী পাক (সঃ) বলেছেনঃ “কিয়ামতের দিন আল্লাহ তাআলা জমীনকে চামড়ার মত টেনে নিবেন। তাতে সব মানুষ শুধু দুটি পা রাখার মত জায়গা পাবে। সর্বপ্রথম আমাকে ডাকা হবে। হযরত জিব্রাঈল (আঃ) আল্লাহ তা'আলার ডান দিকে থাকবেন। আল্লাহর কসম! হযরত জিবরাঈল (আঃ)-এর পূর্বে আল্লাহ তাআলাকে কখনো দেখেননি। আমি তখন বলবো: হে আমার প্রতিপালক! ইনি হযরত জিবরাঈল (আঃ), আমাকে খবর দিয়েছেন যে, আপনি তাকে আমার কাছে পাঠিয়েছেন। (এটা কি সত্য) তখন মহামহিমান্বিত আল্লাহ উত্তরে বলবেনঃ হ্যা, সত্য বলেছে।” অতঃপর আমি শাফাআতের অনুমতিপ্রাপ্ত হবো এবং বলবো: “হে আমার প্রতিপালক! আপনার বান্দারা পৃথিবীর প্রান্তে প্রান্তে আপনার ইবাদত করেছে।!” ঐ সময় তিনি মাকামে মাহমুদে থাকবেন। (এ হাদীসটি ইমাম ইবনু জারীর (রঃ) বর্ণনা করেছেন)আল্লাহ তাবারাকা ওয়া তা'আলা বলেনঃ পৃথিবী তার অভ্যন্তরে যা আছে তা বাইরে নিক্ষেপ করবে ও শূন্যগর্ভ হবে অর্থাৎ জমীন তার অভ্যন্তরভাগ থেকে সকল মৃতকে উঠিয়ে ফেলবে এবং এভাবে ও গর্ভ শূন্য হয়ে যাবে। সেও প্রতিপালকের ফরমানের অপেক্ষায় থাকবে তার জন্যে এটাই করণীয়ও বটে। এরপর মহান আল্লাহ বলেনঃ হে মানুষ! তোমরা তোমাদের প্রতিপালকের নিকট পৌছানো পর্যন্ত যে কঠোর সাধনা করে থাকো পরে তোমরা তাঁর সাক্ষাৎ লাভ করবে। অর্থাৎ তোমরা তোমাদের প্রতিপালকের প্রতি অগ্রসর হতে থাকবে,  আমল করতে থাকবে, অবশেষে একদিন তার সাথে মিলিত হবে এবং তার সম্মুখে দাঁড়াবে। তখন তোমরা নিজেদের প্রচেষ্টা ও কার্যাবলী স্বচক্ষে প্রত্যক্ষ করবে।হযরত জাবির (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ “হযরত জিবরাঈল (আঃ) বলেনঃ “হে মুহাম্মদ (সঃ) আপনি যতদিন ইচ্ছা জীবন যাপন করুন, অবশেষে একদিন আপনার মৃত্যু অনিবার্য। যা কিছুর প্রতি মনের আকর্ষণ সৃষ্টি করার করুন, একদিন তা থেকে বিচ্ছেদ অবধারিত। যা ইচ্ছা আমল করুন, একদিন তার সাথে সাক্ষাৎ হবে।” (আরবি) শব্দের (আরবি) সর্বনাম দ্বারা রব হবে বা প্রতিপালককে বুঝানো হয়েছে বলে কেউ কেউ মন্তব্য করেছেন। তখন অর্থ হবেঃ তোমার সাথে তোমার প্রতিপালকের সাক্ষাৎ হবেই। তিনি তোমাকে তোমার সকল আমলের পারিশ্রমিক দিবেন। তোমার সকল প্রচেষ্টার প্রতিফল তোমাকে প্রদান করবেন। এ উভয় কথাই পরস্পরের সাথে সম্পৃক্ত। কাতাদা (রঃ) বলেন যে, এর ভাবার্থ হচ্ছেঃ হে আদম সন্তান! তোমরা চেষ্টা কর বটে কিন্তু নিজেদের চেষ্টায় তোমরা দুর্বল। সকল চেষ্টা পুণ্যাভিমুখী যেন হতে পারে এ চেষ্টা করো। প্রকৃতপক্ষে পূণ্যকাজ করাবার এবং পাপকাজ হতে বিরত রাখার শক্তি একমাত্র আল্লাহর। তাঁর সাহায্য ছাড়া এটা সম্ভব নয়।মহান আল্লাহ বলেনঃ যাকে তার আমলনামা দক্ষিণ হস্তে দেয়া হবে তার হিসাব নিকাশ সহজেই নেয়া হবে। অর্থাৎ তার ছোট খাট পাপ ক্ষমা করে দেয়া হবে। আর খুটিনাটিভাবে যার আমলের হিসাব গ্রহণ করা হবে তার ধ্বংস অনিবার্য। সে শাস্তি হতে পরিত্রাণ পাবে না।হযরত আয়েশা (রাঃ) হতে বর্ণিত, তিনি বলেন যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ “(কিয়ামতের দিন) যার হিসাব যাচাই করা হবে, আযাব তার জন্য অবধারিত।” হযরত আয়েশা (রাঃ) একথা শুনে বলেনঃ আল্লাহ তা'আলা কি একথা বলেন নাই? “অতঃপর যার আমলনামা ডান হাতে প্রদান করা হবে তার হিসাব হবে সহজতর।” উত্তরে রাসূলুল্লাহ (সঃ) বলেন, সেটা তো হিসাবের নামে দৃশ্যতঃ পেশ করা মাত্র (যথার্থ হিসাব নয়)। কিয়ামতের দিন যে ব্যক্তির হিসাব যাচাই করা হবে, আযাব তার জন্যে অবধারিত।” (এ হাদীসটি ইমাম আহমদ (রঃ) ইমাম বুখারী (রঃ) ইমাম তিরমিযী (রঃ, ইমাম নাসাঈ (রঃ) এবং ইমাম ইবনে জারীর (রঃ) বর্ণনা করেছেন)অন্য একটি বিওয়াইয়াতে আছে যে, এটা বর্ণনা করার পর রাসূলুল্লাহ (সঃ) স্বীয় অক্ষুণী স্বীয় হস্তের উপর রেখে যেভাবে কেউ কোন জিনিস তন্ন তন্ন করে বুজে ঠিক সেইভাবে অঙ্গুলি নাড়াচাড়া করে বলেনঃ “অর্থাৎ যাকে তন্ন তন্ন করে জিজ্ঞাসাবাদ করা হবে সে আযাব থেকে বাঁচতে পারবে না।” হযরত আয়েশা (ব্রাঃ) বলেন যে, যার কাছ থেকে যথারীতি হিসাব নেয়া হবে সে আযাব থেকে রক্ষা পাবে না। তাকে শাস্তি ভোগ থেকে রেহাই দেয়া হবে না। (আরবি) দ্বারা শুধু পেশকরণ বুঝানো হয়েছে। হযরত আয়েশা (রাঃ) হতে বর্ণিত, তিনি বলেনঃ আমি রাসূলুল্লাহ (সঃ) কে তার কোন এক নামাযে বলতে শুনি? (আরবি) অর্থাৎ “হে আল্লাহ! আমার হিসাব আপনি সহজভাবে গ্রহণ করুন।” তিনি এ নামায হতে ফারেগ হলে আমি তাকে জিজ্ঞেস করলামঃ হে আল্লাহর রাসূল (সঃ)! এ সহজ হিসাব কি? তিনি উত্তরে বললেনঃ “শুধু আমলনামার প্রতি দৃষ্টি দেয়ানো হবে অর্থাৎ ভাসাভাসা ন্যর দেয়ানো হবে। তারপর বলা হবেঃ যাও, আমি তোমাকে মাফ করে দিয়েছি। কিন্তু হে আয়েশা (রাঃ)! আল্লাহ তা'আলা যার কাছ থেকে হিসাব নিবেন সে ধ্বংস হয়ে যাবে। মোটকথা, যার ডান হাতে আমলনামা দেয়া হবে সে তা পেশ হওয়ার পরপরই ছাড়া পেয়ে যাবে। তারপর দলীয় লোকদের কাছে উৎফুল্লভাবে ফিরে আসবে। হযরত সাওবান (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ \"তোমরা আমল করতে রয়েছে, কিন্তু প্রকৃত অবস্থা কারো জানা নেই। শীঘ্রই এমন সময় আসবে যখন তোমরা নিজেদের আমলসমূহ চিনতে পারবে। কোন কোন লোক উৎফুল্লভাবে দলীয় লোকদের সাথে মিলিত হবে। আর কোন কোন লোক বিমর্ষভাবে, মলিন মুখে এবং উদাসীন চেহারায় ফিরে আসবে। যারা পিঠের কাছে বাম হাতে আমলনামা পাবে তারা ক্ষতিগ্রস্ততা ও ধ্বংসের কথা ভেবে চীৎকার করবে, মৃত্যু কামনা করবে এবং জাহান্নামের আগুনে প্রবেশ করবে। পৃথিবীতে তারা খুব হাসিখুশী বা নিশ্চিন্ত আরাম আয়েশে দিন কাটিয়েছে। পরকালের জন্যে সামান্যতম ভয়ও তাদের ছিল না। আজ তাদেরকে সর্বপ্রকারের দুঃখ যাতনা, বিমর্ষতা, মলিনতা এবং উদাসীনতা সবদিক দিয়ে ঘিরে ফেলেছে। তারা মনে করেছিল যে মৃত্যুর পর আর পুনরুত্থান হবে না এবং আর কোন জীবন নেই। তারা আল্লাহ তাআলার কাছে যাওয়ার কথা মোটেই বিশ্বাস করেনি।তাই, আল্লাহ তাবারাকা ওয়া তা'আলা বলেনঃ নিশ্চয়ই তারা ফিরে যাবে। আল্লাহ অবশ্য তাদেরকে পুনরুজ্জীবিত করবেন। প্রথমবার তিনি যেভাবে সৃষ্টি করেছেন দ্বিতীয় বারও সেভাবেই সৃষ্টি করবেন। অতঃপর তিনি তাদেরকে পাপ ও পূণ্য কর্মের প্রতিফল প্রদান করবেন। তিনি তাদের প্রতি সবিশেষ দৃষ্টি রাখেন। তারা যা কিছু করছে সে সম্পর্কে তিনি পূর্ণ ওয়াকিফহাল।</p>"
      },
      {
        "resource_id": 170,
        "text": "Ему не подобает сотворить что-либо понапрасну и оставить Свои творения без внимания, без повеления и запретов, без награды и наказания."
      },
      {
        "resource_id": 91,
        "text": "{ بَلَى إِنَّ رَبَّهُ كَانَ بِهِ بَصِيرًا } فلا يحسن أن يتركه سدى، لا يؤمر ولا ينهى، ولا يثاب ولا يعاقب. "
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( بَلَى ) يقول تعالى ذكره: بلى لَيَحُورَنَّ وَلَيَرْجِعَنّ إلى ربه حيا كما كان قبل مماته.وقوله: ( إِنَّ رَبَّهُ كَانَ بِهِ بَصِيرًا ) يقول جلّ ثناؤه: إن ربّ هذا الذي ظن أن لن يحور، كان به بصيرا، إذ هو في الدنيا بما كان يعمل فيها من المعاصي، وما إليه يصير أمره في الآخرة، عالم بذلك كلِّه."
      },
      {
        "resource_id": 165,
        "text": "<p>অবশ্যই (সে প্রত্যাবর্তিত হবে)।[১] নিশ্চয়ই তার প্রতিপালক তার উপর সবিশেষ দৃষ্টি রাখেন। [২]</p><p>[১] একটা অর্থ এটাও হতে পারে যে, এটা কি করে সম্ভব হতে পারে যে, সে ফিরে আসবে না এবং পুনর্বার জীবিত হবে না? অথবা 'অবশ্যই', 'কেন নয়', সে অবশ্যই আল্লাহর নিকট ফিরে আসবে।</p><p>[২] অর্থাৎ, তার আমল আল্লাহর নিকট কোন রকমের গুপ্ত ছিল না।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>হ্যাঁ, [১] নিশ্চয় তার রব তার উপর সম্যক দৃষ্টি দানকারী।</p><p>[১] অর্থাৎ সে যা মনে করেছে তা ঠিক নয়। সে অবশ্যই তার রবের কাছে ফিরে যাবে। অবশ্যই সে পুনরুথিত হবে। [ফাতহুল কাদীর]</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 15{ بَلٰٓیج اِنَّ رَبَّہٗ کَانَ بِہٖ بَصِیْرًا۔ } ”کیوں نہیں ! یقینا اس کا رب تو اسے خوب دیکھ رہا تھا۔“ اگلی تین آیات میں تین قسمیں کھائی گئی ہیں۔ اپنے مضمون اور اسلوب کے اعتبار سے یہ آیات سورة المدثر کی ان آیات کے ساتھ خاص مناسبت اور بہت گہری مشابہت رکھتی ہیں : { کَلَّا وَالْقَمَرِ - وَالَّیْلِ اِذْ اَدْبَرَ - وَالصُّبْحِ اِذَآ اَسْفَرَ۔ } ”کیوں نہیں ‘ قسم ہے چاند کی۔ اور قسم ہے رات کی جب کہ وہ پیٹھ موڑے۔ اور قسم ہے صبح کی جبکہ وہ روشن ہوجائے“۔ ان دونوں مقامات کے مابین ایک مشابہت یہ بھی ہے کہ ان دونوں سورتوں میں قسموں پر مشتمل مذکورہ آیات سے بالکل نیا مضمون شروع ہوتا ہے۔ سورة المدثر میں بھی { کَلَّا وَالْقَمَرِ۔ } سے ایک نئے مضمون کا آغاز ہو رہا ہے اور بالکل ایسی ہی صورت حال زیرمطالعہ سورت کے اس مقام پر بھی نظر آتی ہے۔</p>"
      },
      {
        "resource_id": 92,
        "text": "بَلَى إِنَّ رَبَّهُ كَانَ بِهِ بَصِيرًا (15)وموقع { بلى } الاستئناف كأحرف الجواب .وجملة : { إن ربه كان به بصيراً } مبينة للإِبطال الذي أفاده حرف { بلى } على وجه الإجمال يعني أن ظنه باطل لأن ربه أنبأه بأنه يبعث .والمعنى : إن ربه عليم بمآله . وتأكيد ذلك بحرف { إنَّ } لرده إنكاره البعث الذي أخبر الله به على لسان رسوله صلى الله عليه وسلم فآل المعنى الحاصل من حرف الإِبطال ومن حرف التأكيد إلى معنى : أن ربه بصير به وأما هو فغير بصير بحاله كقوله : { واللَّه يعلم وأنتم لا تعلمون } [ البقرة : 216 ] .وتعدية { بصيراً } بالباء لأنه من بَصُر القاصر بضم الصاد به إذا رآه رؤية محققة ، فالباء فيه معناها الملابسة أو الإِلصاق .وفيه إشارة إلى حكمة البعث للجزاء لأن رب الناس عليم بأحوالهم فمنهم المصلح ومنهم المفسد والكل متفاوتون في ذلك فليس من الحكمة أن يذهب المفسد بفساده وما ألحَقَهُ بالموجودات من مضار وأن يهمل صلاح المصلح ، فجَعَل الله الحياة الأبدية وجعلها للجزاء على ما قدّم صاحبها في حياته الأولى .وأطلق البصر هنا على العلم التام بالشيء .وعلق وصف ( بصير ) بضمير الإنسان الذي ظن أن لن يحور ، والمراد : العِلم بأحواله لا بذاته .وتقديم المجرور على متعلَّقه للاهتمام بهذا المجرور ، أي بصير به لا محالة مع مراعاة الفواصل ."
      },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - ( بلى إِنَّ رَبَّهُ كَانَ بِهِ بَصِيراً ) إيجاب لما نفاه ، وإثبات لما استبعده ، وجملة \" إن ربه \" بمنزلة التعليل لما أفادته بلى من إبطال لما نفاه .أى : ليس الأمر كما زعم من أنه لن يبعث ولن يرجع إلى ربه . . بل الحق الذى لا يشوبه باطل ، أن هذا الشقى سيرجع إلى ربه يوم البعث والنشور ، ليجازيه على أعماله ، لأنه - سبحانه - كان - وما زال - عليما بأحوال هذا الشقى وغيره ، إذ لا يخفى عليه - سبحانه - شئ فى الأرض ولا فى السماء .فالمراد بالبصر هنا : العلم التام بأحوال الخلق ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 16,
    "tafsirs": [
      {
        "resource_id": 94,
        "text": "قوله - عز وجل - : ( فلا أقسم بالشفق ) قال مجاهد : هو النهار كله . وقال عكرمة : ما بقي من النهار . وقال ابن عباس وأكثر المفسرين : هو الحمرة التي تبقى في الأفق بعد غروب الشمس . وقال قوم : هو البياض الذي يعقب تلك الحمرة ."
      },
      {
        "resource_id": 16,
        "text": "أقسم الله تعالى باحمرار الأفق عند الغروب، وبالليل وما جمع من الدواب والحشرات والهوام وغير ذلك، وبالقمر إذا تكامل نوره، لتركبُنَّ- أيها الناس- أطوارا متعددة وأحوالا متباينة: من النطفة إلى العلقة إلى المضغة إلى نفخ الروح إلى الموت إلى البعث والنشور. ولا يجوز للمخلوق أن يقسم بغير الله، ولو فعل ذلك لأشرك."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 169,
        "text": "<h2>Swearing by the Various Stages of Man's Journey</h2><p>It has been reported from `Ali, Ibn `Abbas, `Ubadah bin As-Samit, Abu Hurayrah, Shaddad bin Aws, Ibn `Umar, Muhammad bin `Ali bin Al-Husayn, Makhul, Bakr bin `Abdullah Al-Muzani, Bukayr bin Al-Ashaj, Malik, Ibn Abi Dhi'b, and `Abdul-`Aziz bin Abi Salamah Al-Majishun, they all said, \"Ash-Shafaq is the redness (in the sky).`Abdur-Razzaq recorded from Abu Hurayrah that he said, \"Ash-Shafaq is the whiteness.\" So Ash-Shafaq is the redness of the horizon, either before sunset, as Mujahid said or after sunset, as is well known with the scholars of the Arabic Language. Al-Khalil bin Ahmad said, \"Ash-Shafaq is the redness that appears from the setting of sun until the time of the last `Isha' (when it is completely dark). When that redness goes away, it is said, `Ash-Shafaq has disappeared.\"' Al-Jawhari said, \"Ash-Shafaq is the remaining light of the sun and its redness at the beginning of the night until it is close to actual nighttime (darkness).\" `Ikrimah made a similar statement when he said, \"Ash-Shafaq is that what is between Al-Maghrib and Al-`Isha'.\" In the Sahih of Muslim, it is recorded from `Abdullah bin `Amr that the Messenger of Allah said,</p><div class=\"arabic uthmani\">«وَقْتُ الْمَغْرِبِ مَا لَمْ يَغِبِ الشَّفَق»</div><p>(The time of Al-Maghrib is as long as Ash-Shafaq has not disappeared.)\" In all of this, there is a proof that Ash-Shafaq is as Al-Jawhari and Al-Khalil have said. Ibn `Abbas, Mujahid, Al-Hasan and Qatadah, all said that,</p><div class=\"arabic uthmani\">وَمَا وَسَقَ</div><p>(and what it Wasaqa) means \"What it gathers.\" Qatadah said, \"The stars and animals it gathers.\" `Ikrimah said,</p><div class=\"arabic uthmani\">وَالَّيْلِ وَمَا وَسَقَ </div><p>(And by the night and what it Wasaqa,) \"What it drives into due to its darkness, because when it is nighttime everything goes to its home.\" Concerning Allah's statement,</p><div class=\"arabic uthmani\">وَالْقَمَرِ إِذَا اتَّسَقَ </div><p>(And by the moon when it Ittasaqa.) Ibn `Abbas said, \"When it comes together and becomes complete.\" Al-Hasan said, \"When it comes together and becomes full.\" Qatadah said, \"When it completes its cycle.\" These statements refer to its light when it is completed and becomes full, as the idea was initiated with \"The night and what it gathers.\" Allah said,</p><div class=\"arabic uthmani\">لَتَرْكَبُنَّ طَبَقاً عَن طَبقٍ </div><p>(You shall certainly travel from stage to stage.) Al-Bukhari recorded from Mujahid that Ibn `Abbas said,</p><div class=\"arabic uthmani\">لَتَرْكَبُنَّ طَبَقاً عَن طَبقٍ </div><p>(You shall certainly travel from stage to stage.) \"Stage after stage. Your Prophet has said this.\" Al-Bukhari recorded this statement with this wording. `Ikrimah said,</p><div class=\"arabic uthmani\">طَبَقاً عَن طَبقٍ</div><p>(From stage to stage.) \"Stage after stage. Weaned after he was breast feeding, and an old man after he was a young man.\" Al-Hasan Al-Basri said,</p><div class=\"arabic uthmani\">طَبَقاً عَن طَبقٍ</div><p>(From stage to stage.) \"Stage after stage. Ease after difficulty, difficulty after ease, wealth after poverty, poverty after wealth, health after sickness, and sickness after health.\"</p><h2>The Disapproval of Their Lack of Faith, giving Them Tidings of the Torment, that the Ultimate Pleasl</h2><p>Allah said,</p><div class=\"arabic uthmani\">فَمَا لَهُمْ لاَ يُؤْمِنُونَ - وَإِذَا قُرِىءَ عَلَيْهِمُ الْقُرْءَانُ لاَ يَسْجُدُونَ </div><p>(What is the matter with them, that they believe not And when the Qur'an is recited to them, they fall not prostrate.) meaning, what prevents them from believing in Allah, His Messenger and the Last Day, and what is wrong with them that when Allah's Ayat and His Words are recited to them they do not prostrate due to awe, respect and reverence Concerning Allah's statement,</p><div class=\"arabic uthmani\">بَلِ الَّذِينَ كَفَرُواْ يُكَذِّبُونَ </div><p>(Nay, those who disbelieve deny.) meaning, from their mannerism is rejection, obstinacy, and opposition to the truth.</p><div class=\"arabic uthmani\">وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ </div><p>(And Allah knows best what they gather,) Mujahid and Qatadah both said, \"What they conceal in their chests.\"</p><div class=\"arabic uthmani\">فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ </div><p>(So, announce to them a painful torment.) meaning, `inform them, O Muhammad, that Allah has prepared for them a painful torment.' Then Allah says,</p><div class=\"arabic uthmani\">إِلاَّ الَّذِينَ ءَامَنُواْ وَعَمِلُواْ الصَّـلِحَـتِ</div><p>(Save those who believe and do righteous good deeds,) This is a clear exception meaning, `but those who believe.' This refers to those who believe in their hearts. Then the statement, \"and do righteous good deeds,\" is referring to that which they do with their limbs.</p><div class=\"arabic uthmani\">لَهُمْ أَجْرٌ</div><p>(for them is a reward) meaning, in the abode of the Hereafter.</p><div class=\"arabic uthmani\">غَيْرُ مَمْنُونٍ</div><p>(that will never come to an end.) Ibn `Abbas said, \"Without being decreased.\" Mujahid and Ad-Dahhak both said, \"Without measure.\" The result of their statements is that it (the reward) is without end. This is as Allah says,</p><div class=\"arabic uthmani\">عَطَآءً غَيْرَ مَجْذُوذٍ</div><p>(A gift without an end.) (11:108) As-Suddi said, \"Some of them have said that this means without end and without decrease.\" This is the end of the Tafsir of Surat Al-Inshiqaq. All praise and thanks are due to Allah, and He is the giver of success and freedom from error.</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>আমি শপথ করি অস্তরাগের [১]</p><p>[১] شفق (অস্তরাগ) সেই লালবর্ণের আভাকে বলা হয় যা সূর্যাস্তের পর পশ্চিম আকাশে প্রকাশ পায় এবং তা এশার ওয়াক্ত শুরু হওয়া পর্যন্ত বাকী থাকে।</p>"
      },
      { "resource_id": 170, "text": "" },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  فَلا أُقْسِمُ بِالشَّفَقِ (16)وهذا قَسَمٌ أقسم ربنا بالشفق، والشفق: الحمرة في الأفق من ناحية المغرب من الشمس في قول بعضهم.واختلف أهل التأويل في ذلك، فقال بعضهم: هو الحمرة كما قلنا، وممن قال ذلك جماعة من أهل العراق.وقال آخرون: هو النهار.* ذكر من قال ذلك:حدثني محمد بن إسماعيل الأحمسيّ، قال: ثنا محمد بن عبيد، قال: ثنا العوّام بن حوشب، قال: قلت لمجاهد: الشفق، قال: لا تقل الشفق، إن الشفق من الشمس، ولكن قل: حمرة الأفق .حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى، وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد قوله: الشفق، قال: النهار كله .حدثنا أبو كريب، قال: ثنا وكيع، قال: ثنا سفيان، عن منصور، عن مجاهد ( فَلا أُقْسِمُ بِالشَّفَقِ ) قال: النهار .حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن منصور، عن مجاهد، مثله.وقال آخرون: الشفق: هو اسم للحمرة والبياض، وقالوا: هو من الأضداد.والصواب من القول في ذلك عندي أن يقال: إن الله أقسم بالنهار مدبرا، والليل مقبلا. وأما الشفق الذي تَحُلّ به صلاة العشاء، فإنه للحمرة عندنا للعلة التي قد بيَّنَّاها في كتابنا كتاب الصلاة."
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : فلا أقسم أي فأقسم و ( لا ) صلة .بالشفق أي بالحمرة التي تكون عند مغيب الشمس حتى تأتي صلاة العشاء الآخرة . قال أشهب وعبد الله بن الحكم ويحيى بن يحيى وغيرهم ، كثير عددهم عن مالك : الشفق الحمرة التي في المغرب ، فإذا ذهبت الحمرة فقد خرجت من وقت المغرب ووجبت صلاة العشاء . وروى ابن وهب قال : أخبرني غير واحد عن علي بن أبي طالب ومعاذ بن جبل وعبادة بن الصامت وشداد بن أوس وأبي هريرة : أن الشفق الحمرة ، وبه قال مالك بن أنس . وذكر غير ابن وهب من الصحابة : عمر وابن عمر وابن مسعود وابن عباس وأنسا وأبا قتادة وجابر بن عبد الله وابن الزبير ، ومن [ ص: 237 ] التابعين : سعيد بن جبير ، وابن المسيب وطاوسا ، وعبد الله بن دينار ، والزهري ، وقال به من الفقهاء الأوزاعي ومالك والشافعي وأبو يوسف وأبو ثور وأبو عبيدة وأحمد وإسحاق وقيل : هو البياض ; روي ذلك عن ابن عباس وأبي هريرة أيضا وعمر بن عبد العزيز والأوزاعي وأبي حنيفة في إحدى الروايتين عنه . وروى أسد بن عمرو أنه رجع عنه . وروي عن ابن عمر أيضا أنه البياض والاختيار الأول ; لأن أكثر الصحابة والتابعين والفقهاء عليه ، ولأن شواهد كلام العرب والاشتقاق والسنة تشهد له . قال الفراء : سمعت بعض العرب يقول لثوب عليه مصبوغ : كأنه الشفق وكان أحمر ، فهذا شاهد للحمرة ; وقال الشاعر :وأحمر اللون كمحمر الشفقوقال آخر :قم يا غلام أعني غير مرتبك     على الزمان بكأس حشوها شفقويقال للمغرة الشفق . وفي الصحاح : الشفق بقية ضوء الشمس وحمرتها في أول الليل إلى قريب من العتمة . قال الخليل : الشفق : الحمرة ، من غروب الشمس إلى وقت العشاء الآخرة ، إذا ذهب قيل : غاب الشفق . ثم قيل : أصل الكلمة من رقة الشيء ; يقال : شيء شفق أي لا تماسك له لرقته . وأشفق عليه . أي رق قلبه عليه ، والشفقة : الاسم من الإشفاق ، وهو رقة القلب ، وكذلك الشفق ; قال الشاعر :تهوى حياتي وأهوى موتها شفقا     والموت أكرم نزال على الحرمفالشفق : بقية ضوء الشمس وحمرتها فكأن تلك الرقة عن ضوء الشمس . وزعم الحكماء أن البياض لا يغيب أصلا . وقال الخليل : صعدت منارة الإسكندرية فرمقت البياض ، فرأيته يتردد من أفق إلى أفق ولم أره يغيب . وقال ابن أبي أويس : رأيته يتمادى إلى طلوع الفجر قال علماؤنا : فلما لم يتحدد وقته سقط اعتباره . وفي سنن أبي داود عن النعمان بن بشير قال : أنا أعلمكم بوقت صلاة العشاء الآخرة ; كان النبي - صلى الله عليه وسلم - يصليها لسقوط القمر لثالثة . وهذا تحديد ، ثم الحكم معلق بأول الاسم . لا يقال : فينقض عليكم بالفجر الأول ، فإنا نقول الفجر الأول لا يتعلق به حكم من صلاة ولا إمساك ; لأن النبي - صلى الله عليه وسلم - بين الفجر بقوله وفعله فقال : \" وليس الفجر أن تقول هكذا - فرفع يده إلى فوق - ولكن الفجر أن تقول هكذا وبسطها \" وقد [ ص: 238 ] مضى بيانه في آية الصيام من سورة ( البقرة ) ، فلا معنى للإعادة . وقال مجاهد : الشفق : النهار كله ألا تراه قال والليل وما وسق وقال عكرمة : ما بقي من النهار . والشفق أيضا : الرديء من الأشياء ; يقال : عطاء مشفق أي مقلل قال الكميت :ملك أغر من الملوك تحلبت     للسائلين يداه غير مشفق"
      },
      {
        "resource_id": 157,
        "text": "<p>یہ چند مناظر ہیں ، قرآن کریم ان کی قسم کھا کر قلب انسانی کو ان کی طرف متوجہ کرتا ہے کہ ان پر غور کرو ، اس طرح انسانی دل و دماغ کو اشارات اور تاثرات سے بھر دیا جاتا ہے۔ انسانی زندگی کے یہ لمحات ایک خاص نوعیت رکھتے ہیں ، ان میں ایک طرف خشوع اور دھیما پن ہے اور دوسری طرف پر جلال ہیبت ہے۔ جس طرح سورت کا آغاز پر جلال دھیمے مناظر سے تھا ، یہ لمحات اور مناظر بھی ایسے ہی ہیں۔</p><p>شفق کا وقت وہ ہوتا ہے جس میں ہر چیز سہم جاتی ہے ، غروب کے بعد نفس انسانی پر بھی ایک گہری خاموشی اور خوف کے سائے پڑجاتے ہیں۔ انسانی سوچ ان کو الوداع کہتی ہے اور الوداع میں ہمیشہ خاموشی اور دکھ کے سائے ہوتے ہیں اور پھر رات کے خوفناک لمحات آتے ہیں ، جن میں اندھیروں کی وحشت ہوتی ہے۔ اور آخر کار رات کی تاریکیوں میں ہر چیز لپٹ کر خاموش ہوجاتی ہے ، اور ایک مہیب سکون کی فضا ہوتی ہے۔</p>"
      },
      {
        "resource_id": 14,
        "text": "روي عن علي وابن عباس وعبادة بن الصامت وأبي هريرة وشداد بن أوس وابن عمر ومحمد بن علي بن الحسين ومكحول وبكر بن عبدالله المزني وبكير بن الأشج ومالك وابن أبي ذئب وعبدالعزيز بن أبي سلمة الماجشون أنهم قالوا الشفق الحمرة وقال عبدالرزاق عن معمر عن ابن خثيم عن ابن لبيبة عن أبي هريرة قال الشفق البياض فالشفق هو حمرة الأفق إما قبل طلوع الشمس كما قاله مجاهد وإما بعد غروبها كما هو معروف عند أهل اللغة قال الخليل بن أحمد: الشفق الحمرة من غروب الشمس إلى وقت العشاء الآخرة فإذا ذهب قيل غاب الشفق. وقال الجوهري: الشفق بقية ضوء الشمس وحمرتها في أول الليل إلى قريب من العتمة وكذا قال عكرمة الشفق الذي يكون بين المغرب والعشاء وفي صحيح مسلم عن عبدالله بن عمرو عن رسول الله صلى الله عليه وسلم أنه قال \"وقت المغرب ما لم يغب الشفق\" ففي هذا كله دليل على أن الشفق هو كما قاله الجوهري والخليل. ولكن صح عن مجاهد أنه قال في هذه الآية \"فلا أقسم بالشفق\" هو النهار كله وفى رواية عنه أيضا أنه قال الشفق الشمس رواهما ابن أبي حاتم."
      },
      {
        "resource_id": 168,
        "text": "<p>فَلَا أُقْسِمُ بِالشَّفَقِ وَاللَّيْلِ وَمَا وَسَقَ وَالْقَمَرِ إِذَا اتَّسَقَ (So, I swear by the twilight [ after sunset ], and by the night and what it envelops, and by the moon when it develops at the full...84:16-18) In these verses Allah takes oath by four phenomena and reinforces what was asserted in:</p><p>إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ</p><p>'you have to work hard constantly to reach your Lord'</p><p>If we consider the four phenomena by which oath is taken, it bears evidence to the subject which is forthcoming in the complement of the oath, that is, the condition of man never remains the same at all times. He undergoes changes and unexpected phases all the time. The first phenomenon that brings about a change in his life is the twilight after the sunset, or the red glow that remains on the west side of the sky after the sunset in the evening. This is the beginning of the night. This is the harbinger of a massive change in human conditions, that is, the light is disappearing and a flood of darkness is setting in. The second phenomenon by which oath is taken is night itself which completes the change in his life. The third phenomenon by which oath is taken includes all things that night envelops or shrouds. The primitive sense of the word wasaqa means to 'pile, gather, heap up the thing'. If it is taken in general sense, it embraces every member of the entire universe which the darkness of night covers, such as animals, vegetation, minerals and inorganic matter, mountains and oceans. By extension, the word would comprehend all things that normally disperse in the light of day and retreat to their own places at night. Human beings return to their homes, animals to their habitats and birds to their nests. Business goods and merchandise are or piled up in one place. This massive change is related to man himself. The fourth phenomenon by which oath is taken is in the following verse: وَالْقَمَرِ إِذَا اتَّسَقَ (and by the moon when it develops at the full...84:18). The word ittisaq is also derived from wasaqa and it means 'to gather'. The 'gathering of moon' signifies that it gathered its light, and it became complete and full [ badr ] the moon of the 14th night. The phrase إِذَا اتَّسَقَ , idhat-tasaqa in relation to moon points to the phenomenon that it goes through various phases. First, it appears as a very fine semicircle. Then its light grows progressively night after night, until it becomes badr kamil [ full moon of the 14th night ]. Having taken oath by the vicissitudes of the four phenomena, the Surah asserts the subject: لَتَرْكَبُنَّ طَبَقًا عَن طَبَقٍ (you shall certainly ascend from stage to stage....84:19) The word tabaq or tabqah refers to a 'stage'. Its plural is tabaqat. The verb لَتَرْكَبُنَّ latarkabunna is derived from rukub which means 'to mount or mount up'. The verse purports to say that mankind from the inception to the end of his life will continue to mount up stage by stage, or will pass through all the conditions, gradually and in stages referred to in the preceding verses, that is, periods of light and darkness and other phenomena. He never remains in one condition all the time. He gradually goes through the vicissitudes of life.</p><p>Vicissitudes of Human Life, His Eternal Journey and His Final Destination</p><p>In the first instance the male sperm is united with the female egg to form a new human organism. This is turned into a blood-clot which transforms into a lump of flesh, and the lump is formed into bones, and the bones are clothed in flesh. The limbs of the human body thus were completed. Then the soul was breathed into him, and he became a living human being. His first food in the womb of his mother was the unclean blood of the mother's womb. Nine months later, Allah made his way easy to come into the world. Now instead of the unclean blood, he got the [ pure ] milk of his mother's [ breast ]. When he saw the wide atmosphere and air of the world, he began to grow and develop. Within the first two years of his life, he started moving and walking about, and was able to talk. He weaned and began to eat more delicious and different types of food. As he grew a little older, he made play and amusement his daily preoccupation. When his intelligence developed [ sufficiently ], he was tied up in educational and training activities. When he grew into a youth, he abandoned all previous activities and replaced them with youth activities and ushered himself in a new era where marriage, children and house-keeping became his day-to-day preoccupation. Eventually, this era too neared its end. His physical and other prowess began to give up, and every day he fell prey to new ailments. Old age set in. The final stage of this life, that is, death, began to mount. All this happens in full view of everyone. No one dare deny this. But the ignoramus assumes that death or grave is his final stage, and there is nothing beyond. Allah, the Creator of the universe, the Omniscient, made it known, through the various Prophets [ through the ages ], to the heedless man that grave is not the final stage of his life, but it is merely a waiting-room to enter an enormously large and gigantic world that is yet to come, where the final examination will be conducted and the final stage of his life will be determined. In this world, he will celebrate the Divine remembrance and enjoy eternal comfort and pleasure or he will suffer eternal perdition and damnation [ depending on the final assessment ]. This is where the vicissitudes of his life will end. Thus the Qur'an says:</p><p>إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ</p><p>'Surely, to your Lord is the return [ 96:8] '</p><p>أَنَّ إِلَىٰ رَبِّكَ الْمُنتَهَىٰ</p><p>'and that to your Lord is the end (of every one), [ 42] '</p><p>إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا</p><p>'you have to work hard constantly to reach your Lord [ 84:6] '</p><p>The ignoramus and unmindful man is made aware of the fact that the vicissitudes of life are stages in the journey to his final destination. Man ought to realise that walking, moving about, sleeping, waking, and standing and sitting are conditions, in the process of which he is covering the stages of his journey. Eventually, he will reach his Lord and, accounting for his life-long deeds, he will find his final abode that will be a place of never-ending comfort, luxury and pleasure, or [ God forbid!] a place of never-ending retribution, torture and torment. A wise person should treat himself in this world as a traveller and prepare himself for the next world. His main goal in this life should be to cultivate for the next life as the Prophet\tﷺ said:</p><p>کُن فِی الدُّنیا کَاَنَّکَ غرِیبٌ اَو عِابِرُ سَبِیلٍ</p><p>\"Be in this world as though you are a stranger or a wayfarer.\"</p><p>Under the phrase above طَبَقًا عَن طَبَقٍ tabaqan ` an tabaq 'from stage to stage', a similar narration is cited by Abu Nu'aim from Sayyidna Jabir Ibn ` Abdullah that the Holy Prophet ﷺ stated that these verses remind the unmindful of his creation, the vicissitudes of his life and instructs him to reconsider his position and the consequences [ of his attitude in this life as there is still time ] and to prepare for next life. However, despite these clear guidelines, there are people who never desist from their heedlessness.</p>"
      },
      {
        "resource_id": 91,
        "text": " أقسم في هذا الموضع بآيات الليل، فأقسم بالشفق الذي هو بقية نور الشمس، الذي هو مفتتح الليل. "
      },
      {
        "resource_id": 160,
        "text": "<p>پیشین گوئی شفق سے مراد وہ سرخی ہے جو غروب آفتاب کے بعد آسمان کے مغربی کناروں پر ظاہر ہوتی ہے حضرت علی حضرت ابن عباس حضرت عبادہ بن صامت، حضرت ابوہریرہ، حضرت شداد بن اوس، حضرت عبداللہ بن عمر، محمد بن علی بن حسین مکحول، بکر بن عبداللہ مزنی، بکیر بن الشیخ، مالک بن ابی ذئب، عبدالعزیز بن ابو سلمہ، ماجشون یہی فرماتے ہیں کہ شفق اس سرخی کو کہتے ہیں حضرت ابوہریرہ سے یہ بھی مروی ہے کہ مراد سفیدی ہے، پس شفق کناروں کی سرخی کو کہتے ہیں وہ طلوع سے پہلے ہو یا غروب کے بعد اور اہل سنت کے نزدیک مشہور یہی ہے، خلیل کہتے ہیں عشاء کے وقت تک یہ شفق باقی رہتی ہے، جوہری کہتے ہیں سورج کے غروب ہونے کے بعد جو سرخی اور روشنی باقی رہتی ہے اسے شفق کہتے ہیں۔ یہ اول رات سے عشاء کے وقت تک رہتی ہے۔ عکرمہ فرماتے ہیں مغرب سے لے کر عشاء تک، صحیح مسلم کی حدیث میں ہے مغرب کا وقت شفق غائب ہونے تک ہے، مجاہد سے البتہ یہ مروی ہے کہ اس سے مراد سارا دن ہے۔ اور ایک روایت میں ہے کہ مراد سورج ہے، غالباً اس مطلب کی وجہ اس کے بعد کا جملہ ہے تو گویا روشنی اور اندھیرے کی قسم کھائی، امام ابن جریر فرماتے ہیں دن کے جانے اور رات کے آنے کی قسم ہے۔ اوروں نے کہا ہے سفیدی اور سرخی کا نام \" شفق \" ہے اور قول ہے کہ یہ لفظ ان دونوں مختلف معنوں میں بولا جاتا ہے۔ وسق کے معنی ہیں جمع کیا یعنی رات کے ستاروں اور رات کے جانوروں کی قسم، اسی طرح رات کے اندھیرے میں تمام چیزوں کا اپنی اپنی جگہ چلے جانا، اور چاند کی قسم جبکہ وہ پورا ہوجائے اور پوری روشنی والا بن جائے، لترکبن الخ کی تفسیر بخاری میں مرفوع حدیث سے مروی ہے۔ کہ ایک حالت سے دوسری حالت کی طرف چڑھتے چلے جاؤ گے، حضرت انس فرماتے ہیں جو سال آئے گا وہ اپنے پہلے سے زیادہ برا ہوگا۔ میں نے اسی طرح تمہارے نبی ﷺ سے سنا ہے اس حدیث سے اور اوپر والی حدیث کے الفاظ بالکل یکساں ہیں۔ بظاہر یہ معلوم ہوتا ہے کہ یہ مرفوع حدیث ہے۔ (اللہ اعلم) اور یہ مطلب بھی اسی حدیث کا بیان کیا گیا ہے کہ اس سے مراد ذات نبی ہے ﷺ اور اس کی تائید حضرت عمر ابن مسعود ابن عباس اور عام اہل مکہ اور اہل کوفہ کی قرأت سے بھی ہوتی ہے۔ ان کی قرأت ہے لترکبن۔ شعبی کہتے ہیں مطلب یہ ہے کہ اے نبی تم ایک آسمان کے بعد دوسرے آسمان پر چڑھو گے، مراد اس سے معراج ہے، یعنی منزل بمنزل چڑھتے چلے جاؤ گے سدی کہتے ہیں مراد یہ ہے کہ اپنے اپنے اعمال کے مطابق منزلیں طے کرو گے۔ جیسے حدیث میں ہے، کہ تم اپنے سے اگلے لوگوں کے طریقوں پر چڑھو گے بالکل برابر برابر یہاں تک کہ اگر ان میں سے کوئی گوہ کے سوراخ میں داخل ہوا ہو تو تم بھی یہی کرو گے، لوگوں نے کہا اگلوں سے مراد آپ کی کیا یہود و نصرانی ہیں ؟ آپ نے فرمایا پھر اور کون ؟ حضرت مکحول فرماتے ہیں ہر بیس سال کے بعد تم کسی نہ کسی ایسے کام کی ایجاد کرو گے جو اس سے پہلے نہ تھا، عبداللہ فرماتے ہیں، آسمان پھٹے گا پھر سرخ رنگ ہوجائے گا۔ پھر بھی رنگ بدلتے چلے جائیں گے، ابن مسعود فرماتے ہیں کبھی تو آسمان دھواں بن جائے گا پھر پھٹ جائے گا۔ حضرت سعید بن جیبر فرماتے ہیں یعنی بہت سے لوگ جو دنیا میں پست و ذلیل تھے آخرت میں بلندو ذی عزت بن جائیں گے، اور بہت سے لوگ دنیا میں مرتبے اور عزت والے تھے وہ آخرت میں ذلیل و نامراد ہوجائیں گے۔ عکرمہ یہ مطلب بیان کرتے ہیں کہ پہلے دودھ پیتے تھے پھر غذا کھانے لگے، پہلے جوان تھے پھر بڈھے ہوئے۔ حسن بصری فرماتے ہیں نرمی کے بعد سختی سختی کے بعد نرمی، امیری کے بعد فقیری، فقیری کے بعد امیری، صحت کے بعد بیماری، بیماری کے بعد تندروستی، ایک مرفوع حدیث میں ہے رسول اللہ ﷺ فرماتے ہیں ابن آدم غفلت میں ہے وہ پروا نہیں کرتا کہ کس لیے پیدا کیا گیا ہے، اللہ تعالیٰ جب کسی کو پیدا کرنا چاہتا ہے تو فرشتے سے کہتا ہے اس کی روزی اس کی اجل، اس کی زندگی، اس کا بدیا نیک ہونا لکھ لے پھر وہ فارغ ہو کر چلا جاتا ہے، اور دوسرا فرشتہ آتا ہے اور اس کی حفاظت کرتا ہے یہاں تک کہ اسے سمجھ آجائے پھر وہ فرشتہ اٹھ جاتا ہے پھر دو فرشتے اس کا نامہ اعمال لکھنے والے آجاتے ہیں۔ موت کے وقت وہ بھی چلے جاتے ہیں اور ملک الموت آجاتے ہیں اس کی روح قبض کرتے ہیں پھر قبر میں اس کی روح لوٹا دی جاتی ہے، ملک الموت چلے جاتے ہیں قیامت کے دن نیکی بدی کے فرشتے آجائیں گے اور اس کی گردن سے اس کا نامہ اعمال کھول لیں گے، پھر اس کے ساتھ ہی رہیں گے، ایک سائق ہے دوسرا شہید ہے پھر اللہ تعالیٰ فرمائے گا آیت (لَقَدْ كُنْتَ فِيْ غَفْلَةٍ مِّنْ ھٰذَا فَكَشَفْنَا عَنْكَ غِطَاۗءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيْدٌ 22؀) 50۔ ق :22) تو اس سے غافل تھا، پھر رسول اللہ ﷺ نے آیت لترکبن الخ پڑھی یعنی ایک حال سے دوسرا حال پھر فرمایا لوگو تمہارے آگے بڑے بڑے ہم امور آ رہے ہیں جن کی برداشت تمہارے بس کی بات نہیں لہذا اللہ تعالیٰ بلندو برتر سے مدد چاہو، یہ حدیث ابن ابی حاتم میں ہے، منکر حدیث ہے اور اس کی سند میں ضعیف راوی ہیں لیکن اس کا مطلب بالکل صحیح اور درست ہے۔ واللہ سبحانہ و تعالیٰ اعلم۔ امام ابن جریر نے ان تمام اقوال کو بیان کر کے فرمایا ہے کہ صحیح مطلب یہ ہے کہ آپ اے محمد ﷺ سخت سخت کاموں میں ایک کے بعد ایک سے گزرنے والے ہیں اور گو خطاب حضور ﷺ سے ہی ہے لیکن مراد سب لوگ ہیں کہ وہ قیامت کی ایک کے بعد ایک ہولناکی دیکھیں گے، پھر فرمایا کہ انہیں کیا ہوگیا یہ کیوں نہیں ایمان لاتے ؟ اور انہیں قرآن سن کر سجدے میں گر پڑنے سے کونسی چیز روکتی ہے، بلکہ یہ کفار تو الٹا جھٹلاتے ہیں اور حق کی مخالفت کرتے ہیں اور سرکشی میں اور برائی میں پھنسے ہوئے ہیں، اللہ تعالیٰ ان کے دلوں کی باتوں کو جنھیں یہ چھپا رہے ہیں بخوبی جانتا ہے، تم اے نبی ﷺ انہیں خبر پہنچا دو کہ اللہ تعالیٰ نے ان کے لیے عذاب تیار کر رکھے ہیں، پھر فرمایا کہ ان عذابوں سے محفوط ہونے والے بہترین اجر کے مستحق ایماندار نیک کردار لوگ ہیں، انہیں پورا پورا بغیر کسی کمی کے حساب اور اجر ملے گا، جیسے اور جگہ ہے آیت (عَطَاۗءً غَيْرَ مَجْذُوْذٍ01008) 11۔ ھود :108) بعض لوگوں نے یہ بھی کہہ دیا ہے کہ بلا احسان لیکن یہ معنی ٹھیک نہیں ہر آن پر لحظہ اور ہر وقت اللہ تعالیٰ عز و جل کے اہل جنت پر احسان و انعام ہوں گے بلکہ صرف اس کے احسان اور اس کے فعل و کرم کی بنا پر انہیں جنت نصیب ہوئی نہ کہ ان کے اعمال کی وجہ سے پس اس مالک کا تو ہمیشہ اور مدام والا احسان اپنی مخلوق پر ہے ہی، اس کی ذات پاک ہر طرح کی ہر وقت کی تعریفوں کے لائز ہمیشہ ہمیشہ ہے، اسی لیے اہل جنت پر اللہ کی تسبیح اور اس کی حمد کا الہام اسی طرح کیا جائے جس طرح سانس بلا تکلیف اور بےتکلف بلکہ بےارادہ چلتا رہتا ہے، قرآن فرماتا ہے آیت (واخر دعوٰ ھم ان الحمد اللّٰہ رب العالمین) یعنی ان کا آخری قول یہی ہوگا کہ سب تعریف جہانوں کے پالنے والے اللہ کے لیے ہی ہے، الحمد اللہ سورة انشقاق کی تفسیر ختم ہوئی۔ اللہ ہمیں توفیق خیر دے اور برائی سے بچائے، آمین۔</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>অতঃপর আমি শপথ করছি [১] পশ্চিম আকাশের</p><p>[১] এখানে আল্লাহ্ তা‘আলা তিনটি বস্তুর শপথ করে মানুষকে আবার اِنَّكَ كَادِحٌ اِلٰى رَبِّكَ আয়াতে বর্ণিত বিষয়ের প্রতি মনোযোগী করেছেন। শপথের জওয়াবে বলা হয়েছে যে, মানুষ এক অবস্থার উপর স্থিতিশীল থাকে না বরং তার অবস্থা প্রতিনিয়তই পরিবর্তিত হতে থাকে। যৌবন থেকে বাৰ্ধক্য, বাৰ্ধক্য থেকে মৃত্যু, মৃত্যু থেকে বরযখ (মৃত্যু ও কিয়ামতের মাঝখানের জীবন), বরযখ থেকে পুনরুজ্জীবন, পুনরুজ্জীবন থেকে হাশরের ময়দান তারপর হিসেব-নিকেশ এবং শাস্তি ও পুরস্কারের অসংখ্য মনযিল মানুষকে অতিক্রম করতে হবে। এ বিভিন্ন পৰ্যায় প্রমাণ করছে যে, একমাত্র আল্লাহ্ই তার মা‘বুদ, তিনি বান্দাদের কর্মকাণ্ড নিজস্ব প্রজ্ঞা ও রহমতে নিয়ন্ত্রণ করেন। আর বান্দা মুখাপেক্ষী, অপারগ, মহান প্রবল পরাক্রমশালী দয়ালু আল্লাহ্র কর্তৃত্বাধীন। [বাদায়‘উত তাফসীর; ফাতহুল কাদীর; সা‘দী]</p>"
      },
      {
        "resource_id": 92,
        "text": "فَلَا أُقْسِمُ بِالشَّفَقِ (16) الفاء لتفريع القسم وجوابه ، على التفصيل الذي في قوله : { فأما من أوتى كتابه بيمينه } [ الانشقاق : 7 ] إلى هنا : فإنه اقتضى أن ثمة حساباً وجزاء بخير وشر فكان هذا التفريع فذلكة وحوصلة لما فصل من الأحوال وكان أيضاً جمعاً إجمالياً لما يعترض في ذلك من الأهوال .وتقدم أن : «لا أقسم» يراد منه أُقسم ، وتقدم وجه القسم بهذه الأحوال والمخلوقات عند قوله : { فلا أقسم بالخنس } في سورة التكوير ( 15 ) .ومناسبة الأمور المقسم بها هنا للمقسَم عليه لأنّ الشفق والليل والقمر تخالط أحوالاً بين الظلمة وظهور النور معها ، أو في خلالها ، وذلك مناسب لما في قوله : { لتركبن طبقاً عن طبق } من تفاوت الأحوال التي يختبط فيها الناس يومَ القيامة أو في حياتهم الدنيا ، أو من ظهور أحوال خير من خلال أحوال شَرّ أو انتظار تغير الأحوال إلى ما يرضيهم إن كان الخطاب للمسلمين خاصة كما سيأتي .ولعل ذِكر الشفق إيماء إلى أنه يشبه حالة انتهاء الدنيا لأن غروب الشمس مِثْل حالة الموت ، وأن ذكر الليل إيماء إلى شدة الهول يوم الحساب وذكر القمر إيماء إلى حصول الرحمة للمؤمنين .والشفق : اسم للحمرة التي تظهر في أفق مغرب الشمس أثر غروبها وهو ضياء من شعاع الشمس إذا حجبها عن عيون الناس بعضُ جرم الأرض ، واختلف في تسمية البياض الذي يكون عقب الاحمرار شفقاً ."
      },
      {
        "resource_id": 93,
        "text": "ثم أقسم - سبحانه - ببعض مخلوقاته ، على أن مشيئته نافذة ، وقضاءه لا يرد ، وحكمه لا يتخلف . فقال : ( فَلاَ أُقْسِمُ بالشفق . والليل وَمَا وَسَقَ . والقمر إِذَا اتسق . لَتَرْكَبُنَّ طَبَقاً عَن طَبقٍ ) .والفاء فى قوله ( فَلاَ أُقْسِمُ ) واقعة فى جواب شرط مقدر ، وهى التى يعبر عنها بالفصيحة ، و \" لا \" مزيدة لتأكيد القسم ، وجوابه \" لتركبن \" .والشفق : الحمرة التى تظهر فى الأفق الغربى بعد غروب الشمس ، وهو ضياء من شعاعها ، وسمى شفقا لرقته ، ومنه الشفقة لرقة القلب .أى : أقسم بالحمرة التى تظهر فى الأفق العربى ، بعد غروب الشمس ، وبالليل وما يضمه تحت جناحه من مخلوقات وعجائب لا يعلمها إلا الله - تعالى - وبالقمر إذا ما اجتمع نوره ، وأكتمل ضاؤه ، وصار بدرا متلألئاً .وفى القسم بهذه الأشياء ، دليل واضح على قدرة الله - تعالى - الباهرة ، لأن هذه الأشياء تتغير من حال إلى حال ، ومن هيئة إلى هيئة . . فالشفق حالة تأتى فى أعقاب غروب الشمس ، والليل يأتى بعد النهار ، والقمر يكتمل بعد نقصان . . وكل هذه الحالات الطارئة ، دلائل على قدرة الله - تعالى - ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 17,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَاللَّيْلِ وَمَا وَسَقَ ) يقول: والليل وما جمع مما سكن وهدأ فيه من ذي روح كان يطير، أو يَدِب نهارًا، يقال منه: وسَقْتُه أسِقُه وَسْقا، ومنه طعام موسُوق، وهو المجموع في غرائر أو وعاء، ومنه الوَسْق، وهو الطعام المجتمع الكثير مما يُكال أو يوزن، يقال: هو ستون صاعًا، وبه جاء الخبر عن رسول الله صلى الله عليه وسلم .وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح قال: ثني معاوية، عن عليّ، عن ابن عباس، قوله: ( وَمَا وَسَقَ ) يقول: وما جمع .حدثنا ابن بشار، قال: ثنا محمد بن جعفر، قال: ثنا شعبة، عن أبي بشر، عن مجاهد، عن ابن عباس في هذه الآية ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: وما جمع . وقال ابن عباس:مُسْتَوْسِقَاتٍ لَوْ يَجِدْنَ سَائِقَا (2)حدثني يعقوب قال: ثنا ابن علية، عن أبي رجاء، قال: سأل حفص الحسن عن قوله: ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: وما جمع .حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى، وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: وما جمع، يقول: ما آوى فيه من دابة .حدثنا أبو كريب، قال: ثنا وكيع، عن سفيان، عن منصور، عن مجاهد ( وَاللَّيْلِ وَمَا وَسَقَ ) : وما لفّ .حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن منصور، عن مجاهد ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: وما أظلم عليه، وما أدخل فيه . وقال ابن عباس:* مُسْتَوْسِقَاتٍ لَوْ يَجِدْنَ حَادِيا *حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله: ( وَاللَّيْلِ وَمَا وَسَقَ ) يقول: وما جمع من نجم أو دابة .حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة ( وَمَا وَسَقَ ) قال: وما جمع .حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله: ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: وما جمع مجتمع فيه الأشياء التي يجمعها الله التي تأوي إليه، وأشياء تكون في الليل لا تكون في النهار ما جمع مما فيه ما يأوي إليه، فهو مما جمع .حدثنا ابن حميد، قال: ثنا حكام، قال: ثنا عمرو، عن منصور، عن مجاهد: ( وَاللَّيْلِ وَمَا وَسَقَ ) يقول: ما لُفّ عليه .قال: ثنا جرير، عن منصور، عن مجاهد، مثله.حدثنا ابن بشار، قال: ثنا عبد الرحمن، قال: ثنا سفيان، عن منصور، عن مجاهد ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: وما دخل فيه .حدثنا أبو كريب، قال: ثنا وكيع، عن إسرائيل، عن أبي الهيثم، عن سعيد بن جبير ( وَاللَّيْلِ وَمَا وَسَقَ ) : وما جمع .قال: ثنا وكيع، عن نافع، عن ابن عمر، عن ابن أبي مليكة، عن ابن عباس ( وَمَا وَسَقَ ) : وما جمع، ألم تسمع قول الشاعر:* مُسْتَوْسِقَاتٍ لَوْ يَجِدْنَ سَائِقَا *حدثنا هناد، قال: ثنا أبو الأحوص، عن سماك، عن عكرِمة، في قوله: ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: ما حاز إذا جاء الليل .وقال آخرون: معنى ذلك: وما ساق.* ذكر من قال ذلك:حدثنا عبد الله بن أحمد المَرْوَزيّ، قال: ثنا عليّ بن الحسن، قال: ثنا حسين، قال: سمعت عكرمة وسئل ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: ما ساق من ظلمة، فإذَا كان الليل، ذهب كلّ شيء إلى مأواه .حدثنا ابن حميد، قال: ثنا يحيى بن واضح، قال: ثنا الحسن، عن عكرمة ( وَاللَّيْلِ وَمَا وَسَقَ ) يقول: ما ساق من ظلمة إذا جاء الليل ساق كل شيء إلى مأواه .حُدثت عن الحسين، قال: سمعت أبا معاذ يقول: ثنا عبيد، قال: سمعت الضحاك يقول، في قوله: ( وَاللَّيْلِ وَمَا وَسَقَ ) قال: ما ساق معه من ظلمة إذا أقبل .حدثني محمد بن سعد، قال: ثني أبي، قال: ثني عمي، قال: ثني أبي، عن أبيه، عن ابن عباس، قوله: ( وَاللَّيْلِ وَمَا وَسَقَ ) يعني: وما ساق الليل من شيء جمعه النجوم، ويقال: والليل وما جمع .------------------------الهوامش:(2) هذا بيت من مشطور الرجز ، أنشده أبو عبيدة في مجاز القرآن ( 186 ) قال : { وما وسق } ما علاه لم يمتنع منه شيء ، فإذا جلل الليل الجبال والأشجار والبحار والأرض ، فاجتمعت له ، فقد وسقها ؛ قال الشاعر :* مستوسـقات لـو وجـدن سـائقًا *وفي الكامل للمبرد ( طبعة الحلبي 957 ) حدث أبو عبيدة معمر بن المثنى التيمي النسابة ، عن أسامة بن زيد ، عن عكرمة ، قال : رأيت عبد الله بن العباس وعنده نافع بن الأزرق وهو يسأله ، ويطلب منه الاحتجاج باللغة ، فسأله عن قول الله جل ثناؤه : { والليل وما وسق } ، فقال ابن عباس : وما جمع ، فقال : أتعرف ذلك العرب ؟ قال ابن عباس : أما سمعت قول الراجز :إنَّ لَنـــا قَلائِصًـــا حَقائِقَـــامُسْتَوْسِــقاتٍ لَــوْ يَجِــدْنَ سـائِقَاقال المبرد : هذا قول ابن عباس ؛ وهو الحق الذي لا يقدح فيه قادح . قلت : وبناء عليه يكون هذان البيتان معروفين في عصر ابن عباس ونافع بن الأزرق . وتكون نسبتهما إلى العجاج في ملحق ديوانه ، وفي إحدى روايات ( اللسان : وشق ) غير صحيحة . والنون في يجدن أو وجد : راجعة إلى الأبل ، وأن من الخطأ أن يقال : تجدن بالتاء في أول الفعل إلا إذا كان لجمع مؤنث للمخاطبات ، وقد وقع خطأ تجدن في اللسان ، وفي ديوان العجاج 84 . وخلاصة ما تقدم أن هذا الرجز عرفه ابن عباس وأنشده احتجاجا على ما سأله عنه نافع . ولابد إذن من حمل عبارة : وقال ابن عباس \" مستوسقات \" التي وردت في ثلاثة مواضع في الطبري على إرادة . وأنشد ابن عباس ؛ لأن ما ورد في التفسير مسوق روايات لبعض المفسرين ، وفيه تسمح في التعبير ."
      },
      {
        "resource_id": 16,
        "text": "أقسم الله تعالى باحمرار الأفق عند الغروب، وبالليل وما جمع من الدواب والحشرات والهوام وغير ذلك، وبالقمر إذا تكامل نوره، لتركبُنَّ- أيها الناس- أطوارا متعددة وأحوالا متباينة: من النطفة إلى العلقة إلى المضغة إلى نفخ الروح إلى الموت إلى البعث والنشور. ولا يجوز للمخلوق أن يقسم بغير الله، ولو فعل ذلك لأشرك."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 157,
        "text": "<p>والیل وما وسق (17:84) ” اور رات کی اور جو کچھ وہ سمیٹ لیتی ہے “۔ رات اور اس میں جو کچھ جمع ہوتا ہے ، اور جن چیزوں کو وہ اٹھالیتی ہے۔ نام لیے بغیر ہر معلوم ونامعلوم چیز جو رات کے پردے میں آجاتی ہے جو کچھ رات میں جمع ہوتا ہے ، جن چیزوں کو وہ سینے سے لگالیتی ہے۔ ان میں تمام چیزیں ، تمام زندہ مخلوق ، تمام جذبات اور تمام خفیہ جہان آجاتے ہیں۔ وہ تمام چیزیں جو زمین پر چلتی ہیں یا جو انسانی ضمیر میں خفیہ طور پر جاری وساری ہیں۔ غرض را ہوار خیال دور تک جاکر واپس ہوتا ہے اور انسانی فکر اور سوچ ان تمام مناظر کا احاطہ نہیں کرسکتی جو قرآن کے اس مختصر سے فقرے کا مدلول ہیں۔</p><p>والیل وما وسق (17:84) ” قسم ہے رات کی اور ان چیزوں کی جو وہ کچھ سمیٹ لیتی ہے “۔ جس سے انسانی شعور پر خضوع وخشوع اور خوفناک اور مہیب سکون کی حالت طاری ہوجاتی ہے اور یہ حالت شغق اور رات کے چھانے کی حالت سے ہم آہنگ ہے۔</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : والليل وما وسق أي جمع وضم ولف ، وأصله من سورة السلطان وغضبه فلولا أنه خرج إلى العباد من باب الرحمة ما تمالك العباد لمجيئه ولكن خرج من باب الرحمة فمزح بها ، فسكن الخلق إليه ثم ابذعروا والتفوا وانقبضوا ، ورجع كل إلى مأواه فسكن فيه من هوله وحشا ، وهو قوله تعالى : ومن رحمته جعل لكم الليل والنهار لتسكنوا فيه أي بالليل ولتبتغوا من فضله أي بالنهار على ما تقدم . فالليل يجمع ويضم ما كان منتشرا بالنهار في تصرفه . هذا معنى قول ابن عباس ومجاهد ومقاتل وغيرهم ; قال ضابئ بن الحارث البرجمي :فإني وإياكم وشوقا إليكم     كقابض ماء لم تسقه أناملهيقول : ليس في يده من ذلك شيء كما أنه ليس في يد القابض على الماء شيء ; فإذا جلل الليل الجبال والأشجار والبحار والأرض فاجتمعت له ، فقد وسقها . والوسق : ضمك الشيء بعضه إلى بعض ، تقول : وسقته أسقه وسقا . ومنه قيل للطعام الكثير المجتمع : وسق ، وهو ستون صاعا . وطعام موسق : أي مجموع ، وإبل مستوسقة أي مجتمعة ; قال الراجز [ العجاج ] :إن لنا قلائصا حقائقا     متوسقات لو يجدن سائقاوقال عكرمة : وما وسق أي وما ساق من شيء إلى حيث يأوي ، فالوسق بمعنى الطرد ، ومنه قيل للطريدة من الإبل والغنم والحمر : وسيقة ، قال الشاعر [ الأسود بن يعفر ] :كما قاف آثار الوسيقة قائفوعن ابن عباس : وما وسق أي وما جن وستر . وعنه أيضا : وما حمل ، وكل شيء حملته فقد وسقته ، والعرب تقول : لا أفعله ما وسقت عيني الماء ، أي حملته . ووسقت الناقة تسق وسقا : أي حملت وأغلقت رحمها على الماء ، فهي ناقة واسق ، ونوق وساق مثل نائم ونيام ، وصاحب وصحاب ، قال بشر بن أبي خازم :[ ص: 239 ] ألظ بهن يحدوهن حتى     تبينت الحيال من الوساقومواسيق أيضا . وأوسقت البعير : حملته حمله ، وأوسقت النخلة : كثر حملها . وقال يمان والضحاك ومقاتل بن سليمان : حمل من الظلمة . قال مقاتل : أو حمل من الكواكب . القشيري : ومعنى حمل : ضم وجمع ، والليل يجلل بظلمته كل شيء فإذا جللها فقد وسقها . ويكون هذا القسم قسما بجميع المخلوقات ، لاشتمال الليل عليها ، كقوله تعالى : فلا أقسم بما تبصرون وما لا تبصرون . وقال ابن جبير : وما وسق أي وما عمل فيه ، يعني التهجد والاستغفار بالأسحار ، قال الشاعر :ويوما ترانا صالحين وتارة     تقوم بنا كالواسق المتلببأي كالعامل ."
      },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 14,
        "text": "أي جمع كأنه أقسم بالضياء والظلام وقال ابن جرير: أقسم الله بالنهار مدبرا وبالليل مقبلا. وقال ابن جرير وقال آخرون الشفق أسم للحمرة والبياض وقالوا هو من الأضداد. قال ابن عباس ومجاهد والحسن وقتادة \"وما وسق\" وما جمع قال قتادة وما جمع من نجم ودابة واستشهد ابن عباس بقول الشاعر: مستوسقات لو يجدن سائقا وقد قال عكرمة \"والليل وما وسق\" يقول ما ساق من ظلمة إذا كان الليل ذهب كل شيء إلى مأواه."
      },
      {
        "resource_id": 165,
        "text": "<p>এবং রজনীর আর তাতে যা কিছুর সমাবেশ ঘটে [১] তার শপথ।</p><p>[১] অন্ধকার নেমে আসতেই প্রতিটি বস্তু নিজ নিজ বাসা ও বাসস্থানে জমা ও সমাবিষ্ট হয়। অর্থাৎ, রাতের অন্ধকার যে সকল বস্তুকে নিজের আঁচল দ্বারা ঢেকে নেয়।</p>"
      },
      {
        "resource_id": 92,
        "text": "وَاللَّيْلِ وَمَا وَسَقَ (17) و { ما وَسَق } ( مَا ) فيه مصدرية ، ويجوز أن يكون موصولة على طريقة حذف العائد المنصوب .والوسْق : جمع الأشياء بعضها إلى بعض فيجوز أن يكون المعنى وما جمع مما كان منتشراً في النهار من ناس وحيوان فإنها تأوي في الليل إلى مآويها وذلك مما جعل الله في الجبلة من طلب الأحياء السكون في الليل قال تعالى : { ومن رحمته جعل لكم الليل والنهار لتسكنوا فيه ولتبتغوا من فضله } [ القصص : 73 ] ، وذلك من بديع التكوين فلذلك أقْسم به قسماً أدمجت فيه منّة . وقيل : ما وسقه الليل : النجوم ، لأنها تظهر في الليل ، فشبه ظهورها فيه بوسق الواسِق أشياء متفرقة . وهذا أنسب بعطف القمر عليه ."
      },
      {
        "resource_id": 91,
        "text": "{ وَاللَّيْلِ وَمَا وَسَقَ } أي: احتوى عليه من حيوانات وغيرها. "
      },
      {
        "resource_id": 166,
        "text": "<p>আর শপথ রাতের এবং তা যা কিছুর সমাবেশ ঘটায় তার,</p>"
      },
      {
        "resource_id": 94,
        "text": "( والليل وما وسق ) أي جمع وضم ، يقال : وسقته أسقه وسقا ، أي : جمعته ، واستوسقت الإبل : إذا اجتمعت وانضمت . والمعنى : والليل وما جمع وضم ما كان بالنهار منتشرا من الدواب ، وذلك أن الليل إذا أقبل أوى كل شيء إلى مأواه . روى منصور عن مجاهد قال : ما لف وأظلم عليه . وقال مقاتل بن حيان : أقبل من ظلمة أو كوكب . وقال سعيد بن جبير . وما عمل فيه ."
      },
      {
        "resource_id": 93,
        "text": "والوسق : جمع الأشياء ، وضم بعضها إلى بعض . يقال : وسَق الشئَ يسِقُه - كضرب - إذا جمعه فاجتمع ، ومنه قولهم : إبل مستوسقة ، أى : مجتمعة ، وأمر متسق . أى : مجتمع على ما يسر صاحبه ويرضيه .أى : أقسم بالحمرة التى تظهر فى الأفق العربى ، بعد غروب الشمس ، وبالليل وما يضمه تحت جناحه من مخلوقات وعجائب لا يعلمها إلا الله - تعالى - وبالقمر إذا ما اجتمع نوره ، وأكتمل ضاؤه ، وصار بدرا متلألئاً .وفى القسم بهذه الأشياء ، دليل واضح على قدرة الله - تعالى - الباهرة ، لأن هذه الأشياء تتغير من حال إلى حال ، ومن هيئة إلى هيئة . . فالشفق حالة تأتى فى أعقاب غروب الشمس ، والليل يأتى بعد النهار ، والقمر يكتمل بعد نقصان . . وكل هذه الحالات الطارئة ، دلائل على قدرة الله - تعالى - ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 18,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 91,
        "text": "{ وَالْقَمَرِ إِذَا اتَّسَقَ } أي: امتلأ نورًا بإبداره، وذلك أحسن ما يكون وأكثر منافع. "
      },
      {
        "resource_id": 16,
        "text": "أقسم الله تعالى باحمرار الأفق عند الغروب، وبالليل وما جمع من الدواب والحشرات والهوام وغير ذلك، وبالقمر إذا تكامل نوره، لتركبُنَّ- أيها الناس- أطوارا متعددة وأحوالا متباينة: من النطفة إلى العلقة إلى المضغة إلى نفخ الروح إلى الموت إلى البعث والنشور. ولا يجوز للمخلوق أن يقسم بغير الله، ولو فعل ذلك لأشرك."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 14,
        "text": "قال ابن عباس إذا اجتمع واستوى وكذا قال عكرمة ومجاهد وسعيد بن جبير ومسروق وأبو صالح والضحاك وابن زيد \"والقمر إذا اتسق\" إذا استوى. وقال الحسن إذا اجتمع إذا امتلأ وقال قتادة إذا استدار ومعنى كلامهم أنه إذا تكامل نوره وأبدر جعله مقابلا لليل وما وسق."
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : والقمر إذا اتسق أي تم واجتمع واستوى . قال الحسن : اتسق : أي امتلأ واجتمع . ابن عباس : استوى . قتادة : استدار . الفراء : اتساقه : امتلاؤه واستواؤه ليالي البدر ، وهو افتعال من الوسق الذي هو الجمع ، يقال : وسقته فاتسق ، كما يقال : وصلته فاتصل ، ويقال : أمر فلان متسق : أي مجتمع على الصلاح منتظم . ويقال : اتسق الشيء : إذا تتابع"
      },
      {
        "resource_id": 93,
        "text": "واتساق القمر : اجتماع ضيائه ونوره ، وهو افتعال من الوسق . وهو الجمع والضم ، وذلك يكون فى الليلة الرابعة عشرة من الشهر .أى : أقسم بالحمرة التى تظهر فى الأفق العربى ، بعد غروب الشمس ، وبالليل وما يضمه تحت جناحه من مخلوقات وعجائب لا يعلمها إلا الله - تعالى - وبالقمر إذا ما اجتمع نوره ، وأكتمل ضاؤه ، وصار بدرا متلألئاً .وفى القسم بهذه الأشياء ، دليل واضح على قدرة الله - تعالى - الباهرة ، لأن هذه الأشياء تتغير من حال إلى حال ، ومن هيئة إلى هيئة . . فالشفق حالة تأتى فى أعقاب غروب الشمس ، والليل يأتى بعد النهار ، والقمر يكتمل بعد نقصان . . وكل هذه الحالات الطارئة ، دلائل على قدرة الله - تعالى - ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>এবং শপথ চন্দ্রের যখন তা পরিপূর্ণ হয়। [১]</p><p>[১] إذا اتسق এর অর্থ হল, যখন সে পূর্ণিমাতে পরিপূর্ণতা লাভ করে। যেমন ১৩ তারীখের রাত্রি থেকে নিয়ে ১৬ তারীখের রাত্রি পর্যন্ত তার উক্ত অবস্থা বিদ্যমান থাকে।</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَالْقَمَرِ إِذَا اتَّسَقَ ) يقول: وبالقمر إذا تمّ واستوى.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح، قال: ثني معاوية، عن عليّ، عن ابن عباس، قوله: ( وَالْقَمَرِ إِذَا اتَّسَقَ ) يقول: إذا استوى .حدثني محمد بن سعد، قال: ثني أبي، قال: ثني عمي، قال: ثني أبي، عن أبيه، عن ابن عباس ( وَالْقَمَرِ إِذَا اتَّسَقَ ) قال: إذا اجتمع واستوى .حدثنا هناد، قال: ثنا أبو الأحوص، عن سماك، عن عكرِمة ( وَالْقَمَرِ إِذَا اتَّسَقَ ) قال: إذا استوى .حدثني يعقوب، قال: ثنا ابن عُليّة، عن أبي رجاء، قال: سأل حفص الحسن، عن قوله: ( وَالْقَمَرِ إِذَا اتَّسَقَ ) قال: إذا اجتمع، إذا امتلأ .حدثني أبو كدينة، قال: ثنا ابن يمان، عن أشعث، عن جعفر بن أبي المغيرة، عن سعيد، في قوله: ( وَالْقَمَرِ إِذَا اتَّسَقَ ) قال: لثلاث عَشْرة .حدثنا ابن بشار، قال: ثنا عبد الرحمن، قال: ثنا سفيان، عن منصور، عن مجاهد، مثله.حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن منصور، عن مجاهد، مثله.حدثنا ابن حميد، قال: ثنا حكام، قال: ثنا عمرو، عن منصور، عن مجاهد، مثله.قال ثنا جرير، عن منصور، عن مجاهد، مثله.حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى، وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، قوله ( إِذَا اتَّسَقَ ) قال: إذا استوى .حدثنا أبو كريب، قال: ثنا وكيع، عن إسرائيل، عن أبي الهيثم، عن سعيد بن جبير ( وَالْقَمَرِ إِذَا اتَّسَقَ ) : إذا استوى .حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة ( إِذَا اتَّسَقَ ) : إذا استدار .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة ( وَالْقَمَرِ إِذَا اتَّسَقَ ) : إذا استوى .حُدثت عن الحسين، قال: سمعت أبا معاذ يقول: ثنا عبيد، قال: سمعت الضحاك يقول في قوله: ( وَالْقَمَرِ إِذَا اتَّسَقَ ) قال: إذا اجتمع فاستوى .حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله: ( وَالْقَمَرِ إِذَا اتَّسَقَ ) قال: إذا استوى ."
      },
      {
        "resource_id": 94,
        "text": "( والقمر إذا اتسق ) اجتمع واستوى وتم نوره وهو في الأيام البيض . وقال قتادة : استدار ، وهو افتعل من الوسق الذي هو الجمع ."
      },
      {
        "resource_id": 92,
        "text": "وَالْقَمَرِ إِذَا اتَّسَقَ (18) واتساق القمر : اجتماع ضيائه وهو افتعال من الوَسْق بمعنى الجمع كما تقدم آنفاً وذلك في ليلة البدر ، وتقييد القسم به بتلك الحالة لأنها مظهر نعمة الله على الناس بضيائه .وأصل فعل اتّسق : اوِتَسَق قلبت الواو تاء فوقية طلباً لإِدغامها في تاء الافتعال وهو قلب مطرد .وجملة : { لتركبن طبقاً عن طبق } نسج نظمها نسجاً مجملاً لتوفير المعاني التي تذهب إليْها أفهام السامعين ، فجاءت على أبدع ما يُنسج عليه الكلام الذي يُرسل إرسال الأمثال من الكلام الجامع البديع النسْج الوافر المعنى ولذلك كثرت تأويلات المفسرين لها .فلمعاني الركوب المجازية ، ولمعاني الطبَق من حقيقي ومجازي ، مُتَّسَع لما تفيده الآية من المعاني ، وذلك ما جعَل لإِيثار هذين اللفظين في هذه الآية خصوصية من أفنان الإِعجاز القرآني ."
      },
      {
        "resource_id": 157,
        "text": "<p>والقمر اذا تسق (18:84) ” اور قسم ہے چاند کی جبکہ وہ ماہ کامل بن جائے “۔ یہ بھی ایک دھیما اور سحر انگیز خوبصورت منظر ہے۔ چاند جن راتوں میں مکمل ہوتا ہے۔ اور زمین پر اپنا ٹھنڈا ، دھیما اور فکر انگیز نور بکھیرتا ہے۔ خاموشی ، ٹھنڈے ماحول میں کیا ہی خوبصورت نظارہ ہوتا ہے۔ مادی اور ظاہری بھی اور معنوی اور فکری بھی۔ یہ ایک ایسا نظارہ اور سفر ہے جو شام ، شفق اور ات کے چھاجانے سے ہم آہنگ ہے ، اسی نظارے کے بنیادی عناصر جمال و جلال اور خضوع وخشوع اور خاموشی اور سکون ہیں۔</p><p>یہ عظیم کائناتی مناظر ، نہایت ہی خوبصورت ، نہایت ہی فکر انگیز ، اور نہایت مرعوب کن ، تیز رفتار جھلکیوں کی شکل میں ہمارے سامنے آتے ہیں اور انسانی قلب ونظر سے مخاطب ہوتے ہیں ، ان دلوں کو جو اس کائنات کی پکار کو نہیں سنتے۔ ان مناظر کی قسم اٹھائی جاتی ہے تاکہ انسانی قلب وضمیر پر اثر ہو اور وہ ان کی تروتازگی ، ان کی خوبصورتی اور ان کے اشارات اور ان کے اثرات کو قبول کرسکے اور اس ہاتھ کو دیکھ سکے جس نے اس کے خطوط کو متعین کیا ہے اور جو ان مناظر اور جھلکیوں کو پے درپے سامنے لاتا ہے ، ان جھلکیوں میں یہ مناظر بھی ہوتے ہیں اور لوگ بھی بدلتے ہیں اور ان کے حالات بھی بدلتے ہیں ، لیکن نہایت افسوس کا مقام ہے کہ ان مناظر کو دیکھتے ہوئے بھی لوگ غافل ہیں۔</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>এবং শপথ চাঁদের, যখন তা পূর্ণ হয়;</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 18{ وَالْقَمَرِ اِذَا اتَّسَقَ۔ } ”اور چاند کی جب وہ پورا ہوجاتا ہے۔“ میری خالص ذاتی رائے کے مطابق واللہ اعلم ! سورة المدثر کی مذکورہ آیات 32 ‘ 33 ‘ 34 میں بعثت ِمحمدی ﷺ کی خبر دی گئی ہے ‘ جبکہ زیر مطالعہ آیات میں اسلام کی نشاۃ ثانیہ کی نشاندہی کی گئی ہے۔ سورة المدثر کے مطالعے کے دوران اس موضوع پر تفصیلی گفتگو ہوچکی ہے۔ اس تفصیل کا خلاصہ یہ ہے کہ رات { وَالَّـیْلِ اِذْ اَدْبَرَ۔ } سے مراد چھ سو سال حضرت عیسیٰ علیہ السلام کے بعد سے حضور ﷺ کی نبوت کے ظہور تک کا وہ طویل عرصہ ہے جس کے دوران وحی و نبوت کا سلسلہ منقطع رہا اور دنیا پر مجموعی طور پر کفر و شرک اور ضلالت و جہالت کے اندھیرے چھائے رہے۔ چاند کی قسم { کَلَّا وَالْقَمَرِ۔ } میں علم و ہدایت کی اس مدھم روشنی کا استعارہ ہے جو ِجن و اِنس کے نیک افراد کی صورت میں اس دوران کہیں کہیں موجود رہی ‘ جبکہ صبح کی قسم { وَالصُّبْحِ اِذَآ اَسْفَرَ۔ } کے پردے میں نبوت محمدی ﷺ کے خورشید کے طلوع ہونے کی خبر دی گئی ہے ‘ اور اس کے بارے میں یہ بھی واضح کردیا گیا ہے : { اِنَّھَا لَاِحْدَی الْکُبَرِ۔ } کہ یہ بلاشبہ ایک بہت عظیم واقعہ ہے۔ ظاہر ہے نوع انسانی کی تاریخ میں نبوت محمدی ﷺ کے ظہور سے بڑا کوئی اور واقعہ کیا ہوگا۔ بہرحال نبوت و رسالت ِمحمدی ﷺ کے خورشید جہاں تاب کی تابانیوں سے چھ سو سال کی تاریکیاں چھٹ گئیں۔ حضور ﷺ کی وساطت سے ابنائے آدم کو ”اَکْمَلْتُ لَـکُمْ دِیْنَـکُمْ“ کی خصوصی سند بھی عطا ہوئی ‘ جزیرہ نمائے عرب میں انسانی تاریخ کا عظیم ترین انقلاب بھی رونما ہوگیا اور پھر دیکھتے ہی دیکھتے اس انقلاب کی فتوحات و برکات تین براعظموں تک پھیل گئیں۔ لیکن چند ہی دہائیوں کے بعد مشیت خداوندی سے نہ صرف مسلمانوں کے بڑھتے ہوئے قدم رک گئے ‘ بلکہ رفتہ رفتہ وہ پسپائی پر مجبور ہوگئے۔ پسپائی کا یہ عمل جب شروع ہوا تو صرف جنگی محاذوں سے پیچھے ہٹنے تک ہی محدود نہ رہا بلکہ مسلمان بحیثیت قوم زندگی کے ہر شعبے اور ہر میدان سے دست بردار ہو کر نکبت و ادبار کی پستیوں میں لڑھکتے چلے گئے۔ یہ سفر آج بھی جاری ہے اور ابھی اس کے رکنے کے بظاہر کوئی آثار بھی نظر نہیں آتے۔ یہ گھمبیر صورت حال اپنی جگہ پر ایک زمینی حقیقت ہے ‘ لیکن دوسری طرف ہمارا ایمان ہے کہ قیامت سے پہلے اسلام پوری دنیا پر غالب آئے گا۔ اس بارے میں حضور ﷺ کے فرمودات بہت واضح ہیں اس مضمون کی احادیث ”نوید ِخلافت“ کے عنوان سے ایک کتابچے میں جمع کردی گئی ہیں۔ تفصیل جاننے کے لیے اس کتابچے سے استفادہ کیا جاسکتا ہے۔ میں سمجھتا ہوں کہ زیر مطالعہ آیات میں اسلام کے اسی غلبے کی بشارت دی گئی ہے جس کی تفصیل حضور ﷺ کے فرمودات میں ملتی ہے۔  میرے نزدیک یہاں پہلی قسم { فَلَآ اُقْسِمُ بِالشَّفَقِ۔ } میں اسلام کے رفتہ رفتہ زوال پذیر ہونے کی صورت حال کا نقشہ دکھایا گیا ہے۔ یعنی سورج غروب ہوچکا ہے اور اب افق پر صرف شفق کی سرخی نظر آرہی ہے۔ دوسری قسم { وَالَّـیْلِ وَمَا وَسَقَ۔ } میں حالات کے مزید گھمبیر ہونے کی طرف اشارہ ہے کہ دین پر عمل کے اعتبار سے دنیا میں ایک دفعہ پھر تاریکی چھا جائے گی ‘ صرف مدھم سی روشنی باقی رہے گی جو وقت آنے پر آہستہ آہستہ بڑھتی جائے گی۔ درجہ بدرجہ بڑھتے ہوئے چاند کی قسم : { وَالْقَمَرِ اِذَا اتَّسَقَ۔ } اسی مدھم اور تدریجاً بڑھتی ہوئی روشنی کا استعارہ ہے۔ ظاہر ہے جب چاند پورا ہوجاتا ہے تو اس کی چاندنی ایک حد تک رات کو روشن کردیتی ہے۔ اس کے بعد فرمایا :</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 19,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 14,
        "text": "قال البخاري أخبرنا سعيد بن النضر أخبرنا هشيم أخبرنا أبو بشر عن مجاهد قال: قال ابن عباس \"لتركبن طبقا عن طبق\" حالا بعد حال قال هذا نبيكم صلى الله عليه وسلم وهكذا رواه البخاري بهذا اللفظ وهو محتمل أن يكون ابن عباس أسند هذا التفسير عن النبي صلى الله عليه وسلم كأنه قال سمعت هذا من نبيكم صلى الله عليه وسلم فيكون قوله نبيكم مرفوعا على الفاعلية من قال وهو الأظهر والله أعلم كما قال أنس: لا يأتي عام إلا والذي بعده شر منه سمعته من نبيكم صلى الله عليه وسلم. وقال ابن جرير حدثني يعقوب بن إبراهيم حدثنا هشيم أخبرنا أبو بشر عن مجاهد أن ابن عباس كان يقول \"لتركبن طبقا عن طبق\" قال يعني نبيكم صلى الله عليه وسلم يقول حالا بعد حال وهذا لفظه وقال علي ابن أبي طلحة عن ابن عباس \"طبقا عن طبق\" حالا بعد حال وكذا قال عكرمة ومرة والطيب ومجاهد والحسن والضحاك ومسروق وأبو صالح ويحتمل أن يكون المراد \"لتركبن طبقا عن طبق\" حالا بعد حال قال هذا يعني المراد بهذا نبيكم صلى الله عليه وسلم فيكون مرفوعا على أن هذا ونبيكم يكونان مبتدأ وخبرا والله أعلم ولعل هذا قد يكون هو المتبادر إلى كثير من الرواة كما قال أبو داود الطيالسي وغندر حدثنا شعبة عن أبي بشر عن سعيد بن جبير عن ابن عباس \"لتركبن طبقا عن طبق\" قال محمد صلى الله عليه وسلم ويؤيد هذا المعنى قراءة عمر وابن مسعود وابن عباس وعامة أهل مكة والكوفة لتركبن بفتح التاء والباء. وقال ابن أبي حاتم حدثنا أبو سعيد الأشج حدثنا أبو أسامة عن إسماعيل عن الشعبي \"لتركبن طبقا عن طبق\" قال لتركبن يا محمد سماء بعد سماء. وهكذا روي عن ابن مسعود ومسروق وأبي العالية \"طبقا عن طبق\" سماء بعد سماء \"قلت\" يعنون ليلة الإسراء؟ وقال أبو إسحاق والسدي عن رجل عن ابن عباس \"طبقا عن طبق\" منزلا على منزل وكذا رواه العوفي عن ابن عباس مثله وزاد ويقال أمرا بعد أمر وحالا بعد حال. وقال السدي نفسه \"لتركبن طبقا عن طبق\" أعمال من قبلكم منزلا بعد منزل \"قلت\" كأنه أراد معنى الحديث الصحيح: \"لتركبن سنن من كان قبلكم حذو القذة بالقذة حتى لو دخلوا جحر ضب لدخلتموه\" قالوا يا رسول الله: اليهود والنصارى ؟ قال \"فمن؟\" وهذا محتمل. وقال ابن أبي حاتم حدثنا أبي حدثنا هشام بن عمار حدثنا صدقة حدثنا ابن جابر أنه سمع مكحولا يقول في قول الله \"لتركبن طبقا عن طبق\" قال في كل عشرين سنة تحدثون أمرا لم تكونوا عليه وقال الأعمش حدثنا إبراهيم قال: قال عبدالله \"لتركبن طبقا عن طبق\" قال السماء تتشقق ثم تحمر ثم تكون لونا بعد لون وقال الثوري عن قيس بن وهب عن مرة عن ابن مسعود \"لتركبن طبقا عن طبق\" قال: السماء مرة كالدهان ومرة تنشق وروى البزار من طريق جابر الجعفي عن الشعبي عن علقمة عن عبدالله بن مسعود \"لتركبن طبقا عن طبق\" يا محمد يعني حالا بعد حال ثم قال ورواه جابر عن مجاهد عن ابن عباس وقال سعيد بن جبير \"لتركبن طبقا عن طبق\" قال قوم كانوا في الدنيا خسيس أمرهم فارتفعوا فى الآخرة وآخرون كانوا أشرافا في الدنيا فاتضعوا في الآخرة وقال عكرمة \"طبقا عن طبق\" حالا بعد حال فطيما بعدما كان رضيعا وشيخا بعدما كان شابا وقال الحسن البصري: \"طبقا عن طبق\" يقول حالا بعد حال رخاء بعد شدة وشدة بعد رخاء وغنى بعد فقر وفقرا بعد غنى وصحة بعد سقم وسقما بعد صحة وقال ابن أبي حاتم ذكر عن عبدالله بن زاهر حدثني أبي عن عمرو بن شمر عن جابر هو الجعفي عن محمد بن علي عن جابر بن عبدالله قال: سمعت رسول الله صلى الله عليه وسلم يقول \"إن ابن آدم لفي غفلة مما خلق له إن الله تعالى إذا أراد خلقه قال للملك اكتب رزقه. اكتب أجله. اكتب أثره. اكتب شقيا أو سعيدا. ثم يرتفع ذلك الملك ويبعث الله إليه ملكا آخر فيحفظه حتى يدرك ثم يرتفع ذلك الملك ثم يوكل الله به ملكين يكتبان حسناته وسيئاته فإذا حضره الموت ارتفع ذانك الملكان وجاءه ملك الموت فقبض روحه فإذا دخل قبره رد الروح في جسده ثم ارتفع ملك الموت وجاءه ملكا القبر فامتحناه ثم يرتفعان فإذا قامت الساعة انحط عليه ملك الحسنات وملك السيئات فانتشطا كتابا معقودا في عنقه ثم حضرا معه واحدا سائقا وآخر شهيدا ثم قال الله تعالى \"لقد كنت في غفلة من هذا\" قال رسول الله صلى الله عليه وسلم \"لتركبن طبقا عن طبق\" قال حالا بعد حال ثم قال النبي صلى الله عليه وسلم \"إن قدامكم لأمرا عظيما لا تقدرونه فاستعينوا بالله العظيم\" هذا حديث منكر وإسناده فيه ضعفاء ولكن معناه صحيح والله سبحانه وتعالى أعلم. ثم قال ابن جرير بعدما حكى أقوال الناس في هذه الآية من القراء والمفسرين: والصواب من التأويل قول من قال لتركبن أنت يا محمد حالا بعد حال وأمرا بعد أمر من الشدائد والمراد بذلك وإن كان الخطاب موجها إلى رسول الله صلى الله عليه وسلم جميع الناس وأنهم يلقون من شدائد يوم القيامة وأحواله أهوالا."
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ ) اختلفت القرّاء في قراءته، فقرأه عمر بن الخطاب وابن مسعود وأصحابه وابن عباس وعامة قرّاء مكة والكوفة ( لَتَرْكَبَنَّ ) بفتح التاء والباء. واختلف قارئو ذلك كذلك في معناه، فقال بعضهم: لَتَرْكَبنَ يا محمد أنت حالا بعد حال، وأمرًا بعد أمر من الشدائد.* ذكر من قال ذلك:حدثني يعقوب، قال: ثنا هشيم، قال: أخبرنا أبو بشر، عن مجاهد، أن ابن عباس كان يقرأ: ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) يعني نبيكم صلى الله عليه وسلم حالا بعد حال .حدثنا أبو كريب، قال: ثنا ابن عُلَيَة، قال: ثنا إسرائيل، عن أبي إسحاق، عن رجل حدّثه، عن ابن عباس في ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: منـزلا بعد منـزل .حدثني عليّ، قال: ثنا أبو صالح، قال: ثني معاوية، عن عليّ، عن ابن عباس، في قوله: ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) يقول: حالا بعد حال .حدثني محمد بن سعد، قال: ثني أبي، قال: ثني عمي، قال: ثني أبي، عن أبيه، عن ابن عباس ( لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ ) يعني: منـزلا بعد منـزل، ويقال: أمرًا بعد أمر، وحالا بعد حال .حدثنا ابن بشار، قال: ثنا محمد بن جعفر، قال: ثنا شعبة، عن أبي بشر، قال: سمعت مجاهدًا، عن ابن عباس ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: محمد صلى الله عليه وسلم.حدثنا هناد، قال: ثنا أبو الأحوص، عن سماك، عن عكرِمة في قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: حالا بعد حال .حدثنا ابن بشار، قال: ثنا هَوْذة، قال: ثنا عوف، عن الحسن، في قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: حالا بعد حال .حدثني يعقوب، قال: ثنا ابن علية، عن أبي رجاء، قال: سأل حفص الحسن عن قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: منـزلا عن منـزل، وحالا بعد حال .حدثنا ابن بشار، قال: ثنا عبد الرحمن، قال: ثنا شريك، عن موسى بن أبي عائشة، قال: سألت مرّة عن قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: حالا بعد حال .حدثنا ابن حميد، قال: ثنا يعقوب، عن جعفر، عن سعيد ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: حالا بعد حال .حدثنا أبو كريب، قال: ثنا وكيع، عن سفيان، عن منصور، عن مجاهد ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: حالا بعد حال .قال ثنا وكيع، عن نصر، عن عكرِمة، قال: حالا بعد حال.حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى، وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: لَتَرْكَبُنَّ الأمور حالا بعد حال .حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) يقول: حالا بعد حال، ومنـزلا عن منـزل .حُدثت عن الحسين، قال: سمعت أبا معاذ يقول: أخبرنا عبيد، قال: سمعت الضحاك يقول في قوله: ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) منـزلا بعد منـزل، وحالا بعد حال .حدثنا ابن حميد، قال: ثنا حكام، قال: ثنا عمرو، عن منصور، عن مجاهد ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: أمرًا بعد أمر .حدثنا ابن حميد، قال: ثنا جرير، عن منصور، عن مجاهد، في قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: أمرًا بعد أمر .وقال آخرون ممن قرأ هذه المقالة، وقرأ هذه القراءة عُنِي بذلك: لتركبنّ أنت يا محمد سماء بعد سماء.* ذكر من قال ذلك:حدثنا بشر، قال: ثنا يزيد، قال: ثنا سعيد، عن قتادة، قال: قال الحسن وأبو العالية ( لَتَرْكَبَنَّ ) يعني محمدًا صلى الله عليه وسلم ( طَبَقًا عَنْ طَبَقٍ ) السموات .حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن جابر، عن أبي الضحى، عن مسروق ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: أنت يا محمد سماء عن سماء .حدثنا أبو كريب، قال: ثنا وكيع، عن إسماعيل، عن الشعبيّ، قال: سماء بعد سماء .حدثنا أبو كريب، قال: ثنا وكيع، عن إسرائيل، عن جابر، عن عامر، عن علقمة، عن عبد الله، قال: سماء فوق سماء .وقال آخرون: بل معنى ذلك: لتركَبَنّ الآخرة بعد الأولى.* ذكر من قال ذلك:حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: الآخرة بعد الأولى .وقال آخرون ممن قرأ هذه القراءة: إنما عُنِي بذلك أنها تتغير ضروبًا من التغيير، وتُشَقَّقُ بالغمام مرّة وتحمرّ أخرى، فتصير وردة كالدهان، وتكون أخرى كالمهل.* ذكر من قال ذلك:حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن قيس بن وهب، عن مرّة، عن ابن مسعود ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: السماء مرّة كالدِّهان، ومرّة تَشَقَّق .حدثنا ابن المثني، قال: ثنا محمد بن جعفر، قال: سمعت أبا الزرقاء الهَمْداني، وليس بأبي الزرقاء الذي يحدث في المسح على الجوربين، قال: سمعت مُرّة الهمداني، قال: سمعت عبد الله يقول في هذه الآية ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: السماء .حدثني عليّ بن سعيد الكنديّ، قال: ثنا عليّ بن غراب، عن الأعمش، عن إبراهيم، عن عبد الله في قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: هي السماء تغبرّ وتحمرّ وتَشَقَّق.حدثنا أبو السائب، قال: ثني أبو معاوية، عن الأعمش، عن إبراهيم، عن عبد الله، في قوله: ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: هي السماء تَشَقَّق، ثم تحمرّ، ثم تنفطر؛ قال: وقال ابن عباس: حالا بعد حال .حدثني يحيى بن إبراهيم المسعوديّ، قال: ثني أبي، عن أبيه، عن جدّه، عن الأعمش، عن إبراهيم قال: قرأ عبد الله هذا الحرف ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: السماء حالا بعد حال، ومنـزلة بعد منـزلة .حدثنا ابن حميد، قال: ثنا مهران، عن سفيان، عن الأعمش، عن إبراهيم، عن عبد الله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) قال: هي السماء .حدثنا مهران، عن سفيان، عن أبي فروة، عن مرّة، عن ابن مسعود أنه قرأها نصبًا، قال: هي السماء .حدثنا أبو كريب، قال: ثنا وكيع، عن الأعمش، عن إبراهيم، عن عبد الله، قال: هي السماء تغير لونًا بعد لون .وقرأ ذلك عامة قرّاء المدينة وبعض الكوفيين ( لَتَرْكَبُنَّ ) بالتاء، وبضم الباء على وجه الخطاب للناس كافة أنهم يركبون أحوال الشدّة حالا بعد حال. وقد ذكر بعضهم أنه قرأ ذلك بالياء وبضم الباء، على وجه الخبر عن الناس كافة، أنهم يفعلون ذلك.وأولى القراءات في ذلك عندي بالصواب: قراءة من قرأ بالتاء وبفتح الباء، لأن تأويل أهل التأويل من جميعهم بذلك ورد وإن كان للقراءات الأخَر وجوه مفهومة. وإذا كان الصواب من القراءة في ذلك ما ذكرنا فالصواب من التأويل قول من قال ( لَتَرْكَبَنَّ ) أنت يا محمد حالا بعد حال، وأمرًا بعد أمر من الشدائد. والمراد بذلك -وإن كان الخطاب إلى رسول الله صلى الله عليه وسلم موجهًا- جميع الناس، أنهم يلقون من شدائد يوم القيامة وأهواله أحوالا.وإنما قلنا: عُنِي بذلك ما ذكرنا أن الكلام قبل قوله ( لَتَرْكَبَنَّ طَبَقًا عَنْ طَبَقٍ ) جرى بخطاب الجميع، وكذلك بعده، فكان أشبه أن يكون ذلك نظير ما قبله وما بعده.وقوله: ( طَبَقًا عَنْ طَبَقٍ ) من قول العرب: وقع فلان في بنات طبق: إذا وقع في أمر شديد."
      },
      {
        "resource_id": 91,
        "text": "والمقسم عليه قوله: { لَتَرْكَبُنَّ } [أي:] أيها الناس { طَبَقًا عَنْ طَبَقٍ } أي: أطوارا متعددة وأحوالا متباينة، من النطفة إلى العلقة، إلى المضغة، إلى نفخ الروح، ثم يكون وليدًا وطفلًا، ثم مميزًا، ثم يجري عليه قلم التكليف، والأمر والنهي، ثم يموت بعد ذلك، ثم يبعث ويجازى بأعماله، فهذه الطبقات المختلفة الجارية على العبد، دالة على أن الله وحده هو المعبود، الموحد، المدبر لعباده بحكمته ورحمته، وأن العبد فقير عاجز، تحت تدبير العزيز الرحيم. "
      },
      {
        "resource_id": 92,
        "text": "لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ (19)فأما فعل { لتركبن } فحقيقته متعذرة هنا وله من المعاني المجازية المستعملة في الكلام أو التي يصح أن تراد في الآية عدةٌ ، منها الغلَب والمتابعة ، والسلوك ، والاقتحام ، والملازمة ، والرفعة .وأصل تلك المعاني إما استعارة وإما تمثيل يقال : رَكب أمراً صعباً وارتكب خطَأ .وأما كلمة { طبق } فحقيقتها أنها اسم مفرد للشيء المساوي شيئاً آخر في حجمه وقدره ، وظاهر كلام «الأساس» و«الصحاح» أن المساواة بقيد كون الطبق أعلى من الشّيء لمُسَاويه فهو حقيقة في الغِطاء فيكون من الألفاظ الموضوعة لمعنى مقيَّد كالخِوان والكأس ، وظاهر «الكشاف» أن حقيقته مطلق المساواة فيكون قَيد الاعتلاء عارضاً بغلبة الاستعمال ، يقال : طابَق النعل النعل .وأيّامَّا كان فهو اسم على وزن فَعَل إما مشتق من المطابقة كاشتقاق الصفة المشبهة ثم عومل معاملة الأسماء وتنوسي منه الاشتقاق . وإما أن يكون أصله اسمَ الطبَق وهو الغطاء لُوحظ فيه التشبيه ثم تنوسي ذلك فجاءت منه مادة المطابقة بمعنى المُساواة فيكون من المشتقات من الأسماء الجامدة .ويطلق اسماً مفرداً للغطاء الذي يغطى به ، ومنه قولهم في المثل : «وافَقَ شنّ طبَقه» أي غِطآءَه وهذا من الحقيقة لأن الغطاء مساوٍ لما يغطّيه . ويطلق الطبق على الحالة لأنها ملابسة لصاحبها كملابسة الطبق لما طُبق عليه .ويطلق اسماً مفرداً أيضاً على شيء متخذ من أدم أوْ عود ويؤكل عليه وتوضع فيه الفواكه ونحوها ، وكأنه سمي طبقاً لأن أصله أن يستعمل غِطَاءَ الآنية فتوضع فيه أشياء .ويطلق اسمَ جمععٍ لطبقة : وهي مكان فوق مكان آخر معتبر مثلَه في المقدار إلا أنه مرتفع عليه . وهذا من المجاز يقال : أتانا طَبق من الناس ، أي جماعة .ويقارن اختلاف معاني اللفظين اختلاف معنى { عن } من مجاوزة وهي معنى حقيقي ، أو من مرادفةِ كلمة ( بعد ) وهو معنى مجازي .وكذلك اختلاف وجه النصب للفظ طبقاً بين المفعول به والحال ، وتزداد هذه المحامل إذا لم تُقْصَر الجمل على ما له مناسبة بسياق الكلام من موقع الجملة عقب آية : { يا أيها الإنسان إنك كادح } [ الانشقاق : 6 ] الآيات . ومن وقوعها بعد القسم المشعر بالتأكيد ، ومن اقتضاء فعل المضارعة بعد القسم أنه للمستقبل . فتتركب من هذه المحامل معاننٍ كثيرة صالحة لتأويل الآية .فقيل المعنى : لتركُبن حالاً بعد حال ، رواه البخاري عن ابن عباس عن النبي صلى الله عليه وسلم والأظهرُ أنه تهديد بأهوال القيامة فتنوين «طبق» في الموضعين للتعظيم والتهويل و { عن } بمعنى ( بعد ) والبعدية اعتبارية ، وهي بعدية ارتقاء ، أي لَتُلاقُنَّ هَوْلاً أعظم من هول ، كقوله تعالى : { زدناهم عذاباً فوق العذاب } [ النحل : 88 ] . وإطلاق الطبق على الحالة على هذا التأويل لأن الحالة مطابقة لعمل صاحبها .وروى أبو نعيم عن جابر بن عبد الله تفسير الأحوال بأنها أحوال موت وإحياء ، وحشر ، وسعادة أو شقاوة ، ونعيم أو جحيم ، كما كتب الله لكل أحد عند تكوينه رواه جابر عن النبي صلى الله عليه وسلم وقال ابن كثير هو حديث مُنْكَر وفي إسناده ضعفاء ، أو حالاً بعد حال من شدائد القيامة وروي هذا عن ابن عباس وعكرمة والحسن مع اختلاف في تعيين الحال .وقيل : { لتركبن } منزلة بعد منزلة على أن طبقاً اسم للمنزلة ، وروي عن ابن زيد وسعيد بن جبير أي لتَصِيرُنَّ من طبق الدنيا إلى طبق الآخرة ، أو إن قوماً كانوا في الدنيا متضعين فارتفعوا في الآخرة ، فالتنوين فيهما للتنويع .وقيل : من كان على صلاح دعاه إلى صلاح آخر ومن كان على فساد دعاه إلى فساد فَوقه ، لأن كل شيء يجرُّ إلى شكله ، أي فتكون الجملة اعتراضاً بالموعظة وتكون { عن } على هذا على حقيقتها للمجاوزة ، والتنوين للتعظيم .ويحتمل أن يكون الركوب مجازاً في السير بعلاقة الإِطلاق ، أي لتحضُرن للحساب جماعات بعد جماعات على معنى قوله تعالى : { إلى ربك يومئذ المساق } [ القيامة : 30 ] وهذا تهديد لمنكريه ، وأن يكون الركوب مستعملاً في المتابعة ، أي لتَتَّبِعُنَّ . وحذف مفعول : «تركبن» بتقدير : ليَتبعن بعضُكم بعضاً ، أي في تصميمكم على إنكار البعث . ودليل المحذوف هو قوله : { طبقاً عن طبق } ويَكون { طبقاً } مفعولاً به وانتصاب { طبقاً } إما على الحال من ضمير { تركبُنّ } . وإما على المفعولية به على حسب ما يليق بمعاني ألفاظ الآية .وموقع { عن طبق } موقع النعت ل { طبقاً } .ومعنى { عن } إما المجاوزة ، وإما مرادفة معنى ( بعد ) وهو مجاز ناشىء عن معنى المجاوزة ، ولذلك لما ضمَّن النابغة معنى قولهم : «ورثوا المجد كابراً عن كابر» غيَّر حرف ( عن ) إلى كلمة ( بعد ) فقال: ... لآللِ الجُلاَححِ كَابِراً بعدَ كابِروقرأ نافع وابن عامر وعاصم وأبو جعفر { لتركبن } بضم الموحدة على خطاب الناس . وقرأه الباقون بفتح الموحدة على أنه خطاب للإنسان من قوله تعالى : { يا أيها الإنسان إنك كادح } [ الانشقاق : 6 ] . وحُمل أيضاً على أن التاء الفوقية تاء المؤنثة الغائبة وأن الضمير عائد إلى السماء ، أي تعتريها أحوال متعاقبة من الانشقاق والطيّ وكونها مرة كالدِّهان ومرة كالمُهل . وقيل : خطاب للنبيء صلى الله عليه وسلم قال ابن عطية : قيل : هي عِدة بالنَّصر ، أي لتركبن أمر العرب قبيلاً بعد قبيل وفتحاً بعد فتح كما وجد بعد ذلك ( أي بعد نزول الآية حين قويَ جانبُ المسلمين ) فيكون بشارة للمسلمين ، وتكون الجملة معترضة بالفاء بين جملة : { إنه ظن أن لن يحور } [ الانشقاق : 14 ] وجملة : { فما لهم لا يؤمنون } [ الانشقاق : 20 ] . وهذا الوجه يجري على كلتا القراءتين ."
      },
      { "resource_id": 381, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 157,
        "text": "<p>لترکبن ........................ طبق (19:84) ” تم کو ضرور درجہ بدرجہ ایک مشکل حالت سے دوسری حالت کی طرف گزرتے چلے جانا ہے “۔ یعنی ایک صورت حال کے بعد دوسری صورت حال سے تمہیں دوچارہونا پڑے گا۔ جس طرح اللہ نے تمہارے مقدر میں لکھا ہوا ہے۔ یہاں ایک حال سے دوسرے حال کی تبدیلی کے لئے ” سواری “ کا لفظ استعمال کیا گیا۔ عربی میں مشکلات سے دوچارہونے کے لئے معاملات ، خطرات ، حالات اور مشکلات پر سوار ہونے کا محاورہ عام ہے۔ کیا جاتا ہے۔</p><p>ان المضطر یر کب الصعب من الامور وھو عالم برکوبہ ” مشکلات میں گھرا ہوا شخص مشکلات پر سوار ہوجاتا ہے اور وہ اس بات کو جانتا ہے کہ وہ ان پر کس طرح سوار ہو یعنی قابو پائے “ تحریک اسلامی کو پیش آنے والے حالات ومشکلات ایک کے بعد ایک سخت ترین مراحل کی شکل میں آئیں گے۔ اور یہ حالات اللہ کی تقدیر اور مشیت کے مطابق آئیں گے جو اس راہ میں لوگوں کو چلاتی ہے ، اور دست قدرت ان کو ایک انتہا تک پہنچاتا ہے۔ جہاں سے دوسرا مرحلہ شروع ہوتا ہے۔ جس طرح شفق نمودار ہوتا ہے ، رات آتی ہے اور چھا جاتی ہے ، چاند نمودار ہوتا ہے اور ماہ کامل بن جاتا ہے یہاں تک انسان اس سفر کو طے کرکے اللہ تک پہنچ جائیں جیسا کہ سابقہ پیراگراف میں تصریح کی گئی۔ پے درپے ہم آہنگ پیراگراف اور فقرات کا آنا ، ایک مفہوم اور فکر سے دوسری سوچ اور معنی اخذ کرنے چلے جانا ، اور ایک نظارے سے دوسرے نظارے تک پہنچنا ، یہ قرآن کریم کا پر اعجاز اور انوکھا انداز ہے جس کی نقل اتارنا ممکن نہیں ہے۔</p><p>ان مناظر اور اشارات اور ان مشاہدات اور خوشگوار لمحات کی فضا ، جو اس پوری سورت میں یکے بعد دیگرے آئے۔ ان کے ذکر کے بعد اب ایک عقلمند انسان پر تعجب کیا جاتا ہے کہ ان دلائل ایمان کے باوجود وہ ایمان نہیں لاتا حالانکہ اس کائنات میں اور خودان کے نفوس میں وافر مقدار میں واضح دلائل موجود ہیں۔</p>"
      },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - ( لَتَرْكَبُنَّ طَبَقاً عَن طَبقٍ ) جواب القسم - كما سبق أن أشرنا - .والمراد بالركوب : الملاقاة والمعاناة ، والخطاب للناس ، والطبق جمع طبقة ، وهى الشئ المساوى لشئ آخر ، والمراد بها هنا : الحالة أو المرتبة ، وعن بمعنى بعد .أى : وحق الشفق ، والمراد بها هنا : الحالة أو المرتبة ، وعن بمعنى بعد .أى : وحق الشفق ، والليل وما وسق ، والقمر إذا اتسق . . لتلاقن - أيها الناس - أحوالا بعد أحوال ، هى طبقات ومراتب فى الشدة ، بعضها أصعب من بعض ، وهى الموت ، وما يكون بعده من حساب وجزاء يوم القيامة .قال الآلوسى ما ملخصه : قوله : ( لَتَرْكَبُنَّ طَبَقاً عَن طَبقٍ ) خطاب لجنس الإِنسان المنادى أولا ، باعتبار شموله لأفراده ، والمراد بالركوب : الملاقاة ، والطبق فى الأصل ما طابق غيره مطلقا .وخص فى العرف بالحال المطابقة لغيرها . . و \" عن \" للمجاوزة ، أو بمعنى \" بعد \" والجار والمجرور متعلق بمحذوف صفة أو حالا من فاعل لتركبن ، والظاهر أن \" طبقا \" منصوب على المفعولية ، أى : لتلاقن حالا كائنة بعد حال ، كل واحدة مطابقة لأختها فى الشدة والهول . . منها ما هو فى الدنيا ، ومنها ما هو فى الآخرة .وقرأ الأخوان - حمزة الكسوائى - وابن كثير ( لتركبن ) بفتح الباء - على أنه خطاب للإِنسان - أيضا - ، ولكن باعتبار اللفظ ، لا باعتبار الشمول .وأخرج البخارى عن ابن عباس أنه خطاب للنبى صلى الله عليه وسلم ، أى : لتركبن - أيها الرسول الكريم - أحوال شريفة بعد أخرى من مراتب القرب . أو مراتب من الشدة بعد مراتب من الشدة ، ثم تكون العاقبة لك . ."
      },
      {
        "resource_id": 16,
        "text": "أقسم الله تعالى باحمرار الأفق عند الغروب، وبالليل وما جمع من الدواب والحشرات والهوام وغير ذلك، وبالقمر إذا تكامل نوره، لتركبُنَّ- أيها الناس- أطوارا متعددة وأحوالا متباينة: من النطفة إلى العلقة إلى المضغة إلى نفخ الروح إلى الموت إلى البعث والنشور. ولا يجوز للمخلوق أن يقسم بغير الله، ولو فعل ذلك لأشرك."
      },
      {
        "resource_id": 90,
        "text": "لتركبن طبقا عن طبق قرأ أبو عمر وابن مسعود وابن عباس وأبو العالية ومسروق وأبو وائل ومجاهد والنخعي وابن كثير وحمزة والكسائي ( لتركبن ) بفتح الباء خطابا للنبي - صلى الله عليه وسلم - ، أي لتركبن يا محمد حالا بعد حال ، قاله ابن عباس . الشعبي : لتركبن يا محمد سماء بعد سماء ، ودرجة بعد درجة ، ورتبة بعد رتبة ، في القربة من الله تعالى .ابن مسعود : لتركبن السماء حالا بعد حال ، يعني حالاتها التي وصفها الله تعالى بها من الانشقاق والطي وكونها مرة كالمهل ومرة كالدهان . وعن إبراهيم عن عبد الأعلى : طبقا عن طبق قال : السماء تقلب حالا بعد حال . قال : تكون وردة كالدهان ، وتكون كالمهل ; وقيل : أي لتركبن أيها الإنسان حالا بعد حال ، من كونك نطفة ثم علقة ثم مضغة ثم حيا وميتا وغنيا وفقيرا . فالخطاب للإنسان المذكور في قوله : يا أيها الإنسان إنك كادح هو اسم للجنس ، ومعناه الناس . وقرأ الباقون لتركبن بضم الباء ، خطابا للناس ، واختاره أبو عبيد وأبو حاتم ، قال : لأن المعنى بالناس أشبه منه بالنبي - صلى الله عليه وسلم - ، لما ذكر قبل هذه الآية فمن أوتي كتابه بيمينه ومن أوتي كتابه بشماله . أي لتركبن حالا بعد حال من شدائد القيامة ، أو لتركبن سنة من كان قبلكم في التكذيب واختلاق على الأنبياء .قلت : وكله مراد ، وقد جاءت بذلك أحاديث ، فروى أبو نعيم الحافظ عن جعفر بن [ ص: 240 ] محمد بن علي عن جابر - رضي الله عنه - ، قال سمعت رسول - صلى الله عليه وسلم - يقول : إن ابن آدم لفي غفلة عما خلقه الله - عز وجل - ; إن الله لا إله غيره إذا أراد خلقه قال للملك اكتب رزقه وأثره وأجله ، واكتب شقيا أو سعيدا ، ثم يرتفع ذلك الملك ، ويبعث الله ملكا آخر فيحفظه حتى يدرك ، ثم يبعث الله ملكين يكتبان حسناته وسيئاته ، فإذا جاءه الموت ارتفع ذانك الملكان ، ثم جاءه ملك الموت - عليه السلام - فيقبض روحه ، فإذا أدخل حفرته رد الروح في جسده ، ثم يرتفع ملك الموت ، ثم جاءه ملكا القبر فامتحناه ، ثم يرتفعان ، فإذا قامت الساعة انحط عليه ملك الحسنات وملك السيئات ، فأنشطا كتابا معقودا في عنقه ، ثم حضرا معه ، واحد سائق والآخر شهيد ثم قال الله - عز وجل - لقد كنت في غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد . قال رسول الله - صلى الله عليه وسلم - : لتركبن طبقا عن طبق قال : \" حالا بعد حال \" ثم قال النبي - صلى الله عليه وسلم - : \" إن قدامكم أمرا عظيما فاستعينوا بالله العظيم \" فقد اشتمل هذا الحديث على أحوال تعتري الإنسان ، من حين يخلق إلى حين يبعث ، وكله شدة بعد شدة ، حياة ثم موت ، ثم بعث ثم جزاء ، وفي كل حال من هذه شدائد . وقال - صلى الله عليه وسلم - : لتركبن سنن من قبلكم شبرا بشبر ، وذراعا بذراع ، حتى لو دخلوا جحر ضب لدخلتموه ، قالوا : يا رسول الله ،اليهود والنصارى ؟ قال : فمن ؟ خرجه البخاري : وأما أقوال المفسرين ، فقال عكرمة : حالا بعد حال ، فطيما بعد رضيع ، وشيخا بعد شباب ، قال الشاعر :كذلك المرء إن ينسأ له أجل     يركب على طبق من بعده طبقوعن مكحول : كل عشرين عاما تجدون أمرا لم تكونوا عليه : وقال الحسن : أمرا بعد أمر ، رخاء بعد شدة ، وشدة بعد رخاء ، وغنى بعد فقر ، وفقرا بعد غنى ، وصحة بعد سقم ، وسقما بعد صحة : سعيد بن جبير : منزلة بعد منزلة ، قوم كانوا في الدنيا متضعين فارتفعوا في الآخرة ، وقوم كانوا في الدنيا مرتفعين فاتضعوا في الآخرة : وقيل : منزلة عن منزلة ، وطبقا عن طبق ، وذلك أن من كان على صلاح دعاه إلى صلاح فوقه ، ومن كان على فساد دعاه إلى [ ص: 241 ] فساد فوقه ; لأن كل شيء يجري إلى شكله : ابن زيد : ولتصيرن من طبق الدنيا إلى طبق الآخرة : وقال ابن عباس : الشدائد والأهوال : الموت ، ثم البعث ، ثم العرض ، والعرب تقول لمن وقع في أمر شديد : وقع في بنات طبق ، وإحدى بنات طبق ، ومنه قيل للداهية الشديدة : أم طبق ، وإحدى بنات طبق : وأصلها من الحيات ، إذ يقال : للحية أم طبق لتحويها : والطبق في اللغة : الحال كما وصفنا ، قال الأقرع بن حابس التميمي :إني امرؤ قد حلبت الدهر أشطره     وساقني طبق منه إلى طبقوهذا أدل دليل على حدوث العالم ، وإثبات الصانع ، قالت الحكماء : من كان اليوم على حالة ، وغدا على حالة أخرى فليعلم أن تدبيره إلى سواه : وقيل لأبي بكر الوراق : ما الدليل على أن لهذا العالم صانعا ؟ فقال : تحويل الحالات ، وعجز القوة ، وضعف الأركان ، وقهر النية ، ونسخ العزيمة : ويقال : أتانا طبق من الناس وطبق من الجراد : أي جماعة : وقول العباس في مدح النبي - صلى الله عليه وسلم - :تنقل من صالب إلى رحم     إذا مضى عالم بدا طبقأي قرن من الناس . يكون طباق الأرض أي ملأها . والطبق أيضا : عظم رقيق يفصل بين الفقارين ويقال : مضى طبق من الليل ، وطبق من النهار : أي معظم منه . والطبق : واحد الأطباق ، فهو مشترك . وقرئ ( لتركبن ) بكسر الباء ، على خطاب النفس و ( ليركبن ) بالياء على ليركبن الإنسان . و ( عن طبق ) في محل نصب على أنه صفة ل \" طبقا \" أي طبقا مجاوزا لطبق . أو حال من الضمير في لتركبن أي لتركبن طبقا مجاوزين لطبق ، أو مجاوزا أو مجاوزة على حسب القراءة ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 19{ لَتَرْکَبُنَّ طَبَقًا عَنْ طَبَقٍ۔ } ”اسی طرح تم لازماً چڑھو گے درجہ بدرجہ۔“ یعنی جس طرح چاند درجہ بدرجہ بڑا ہو کر مرحلہ وار رات کو روشن کرتا ہے بالکل اسی طرح تم مرحلہ وار کوششوں سے غلبہ دین کی منزل تک پہنچو گے۔ واضح رہے کہ لَتَرْکَبُنَّ کے صیغے میں زور اور تاکید بھی ہے کہ تم لوگ اس منزل تک ضرور پہنچو گے۔ ظاہر ہے ہمیں یہ خبر محمد رسول اللہ ﷺ نے دی ہے وَھُوَ الصَّادِقُ وَالْمَصْدُوْق ! آپ ﷺ کی دی ہوئی خبر غلط نہیں ہوسکتی۔ لہٰذا دنیا پر اسلام کا مکمل غلبہ ہو کر رہے گا۔ البتہ اسلام کے پہلے غلبے کی شان اور تھی اور دوسرے غلبے کا انداز اور ہوگا۔ یہ فرق سورة المدثر کی آیت 34 اور زیر مطالعہ سورت کی آیت 18 پر غور کرنے سے خود بخود واضح ہوجاتا ہے۔ یعنی اسلام کے پہلے غلبے کا ظہور صبح کے اجالے کی طرح ہوا تھا : { وَالصُّبْحِ اِذَآ اَسْفَرَ۔ } المدثر۔ اس اجالے کی شان یہ تھی کہ ادھر آفتابِ نبوت ﷺ طلوع ہوا اور ادھر دیکھتے ہی دیکھتے پورا ماحول منورہو گیا۔ یعنی حضور ﷺ کی دعوت کے آغاز کے بعد صرف تیئیس 23 برس کے مختصر عرصے میں تاریخ انسانی کا عظیم ترین انقلاب برپا ہوگیا اور جزیرہ نمائے عرب میں اسلام پوری طرح غالب آگیا۔ ظاہر ہے سورج کے طلوع ہونے کے بعد روشنی ہونے میں زیادہ دیر تو نہیں لگتی۔ البتہ اسلام کے دوسرے غلبہ کی روشنی چاند کی چاندنی کی طرح مرحلہ وار اور تدریجاً پھیلے گی۔ یعنی اب اقامت دین اور خلافت علیٰ منہاج النبوۃ کا نظام کسی ایک داعی یا کسی ایک تحریک کی کوششوں اور کسی ایک نسل کے زمانے میں نہیں بلکہ نسل در نسل جدوجہد سے قائم ہوگا۔ جیسے برعظیم پاک و ہند میں علامہ اقبال نے ایک فکر کو واضح کیا کہ اسلام مذہب نہیں بلکہ دین ہے اور ایک مکمل ضابطہ حیات ہے اور یہ کہ ”جدا ہو دیں سیاست سے تو رہ جاتی ہے چنگیزی“ یعنی مسلمان اس ضابطہ حیات کو ایک ”وحدت“ کے طور پر زندگی کے تمام شعبوں میں نافذ کرنے کے لیے جدوجہد کریں۔ پھر مولانا ابوالکلام آزاد نے ”حزب اللہ“ اور مولانا مودودی نے ”جماعت اسلامی“ کے پلیٹ فارم سے اقامت دین کے لیے جدوجہد کی۔ اسی طرح آئندہ ادوار میں بھی اللہ کی توفیق سے اس کے بندے اس جدوجہد کا علم سنبھالے رہیں گے۔ مختلف تحریکیں اس مشن کی ترویج و ترقی کے لیے مختلف انداز میں کردار ادا کرتی رہیں گی اور بالآخران اجتماعی اور مرحلہ وار کوششوں کے نتیجے میں جب اللہ کو منظور ہوگا اسلام بطور دین پوری دنیا میں غالب ہوجائے گا۔</p>"
      },
      {
        "resource_id": 170,
        "text": "Аллах поклялся знамениями, наступающими с приходом ночи. Он поклялся вечерней зарей, то есть последними лучами солнца, с которыми наступает ночь. Он также поклялся различными животными, которые собираются под покровом ночи, и луной, наполненной светом во время полнолуния, когда она наиболее прекрасна и приносит больше всего пользы. Господь принес эти клятвы в подтверждение того, что человеческий организм во время развития минует многочисленные фазы и стадии. Вначале он представляет собой каплю, которая превращается в сгусток крови и кусочек мяса. Затем в человеческий зародыш вдыхают душу, а через некоторое время появляется на свет младенец. Он вырастает в ребенка, а затем достигает зрелого возраста, и тогда перо ангела начинает записывать, насколько точно он придерживается повелений и запретов Господа. Затем человек умирает, после чего Аллах воскресит его и воздаст ему за совершенные деяния. Эти различные стадии, через которые проходит раб Божий, свидетельствуют о том, что только Аллах достоин поклонения. Ведь только Всемогущий и Милостивый Аллах правит Своими рабами, правит мудро и милосердно, и все бедные и беспомощные рабы находятся в Его власти."
      },
      {
        "resource_id": 166,
        "text": "<p>অবশ্যই তোমরা এক স্তর থেকে অন্য স্তরে আরোহণ করবে [১]।</p><p>[১] اتسق শব্দটি وسق থেকে উদ্ভূত, যার অর্থ একত্রিত করা, পূর্ণ করা। চন্দ্রের একত্রিত করার অর্থ তার আলোকে একত্রিত করা। এটা চৌদ্দ তারিখের রাত্রিতে হয়, যখন চন্দ্র পূর্ণ হয়ে যায়। [ইবন কাসীর] এখানে চন্দ্রের বিভিন্ন অবস্থার দিকে ইঙ্গিত রয়েছে। চন্দ্ৰ প্ৰথমে খুবই সরু ধনুকের মতো দেখা যায়। এরপর প্রত্যহ এর আলো বৃদ্ধি পেতে পেতে পূর্ণিমার চাঁদ হয়ে যায়। অবিরাম ও উপর্যুপরি পরিবর্তনের সাক্ষ্যদাতা উপরোক্ত বস্তুগুলোর শপথ করে আল্লাহ্ তা'আলা বলেছেন, “অবশ্যই তোমরা ধাপে ধাপে আরোহণ করবে” । طبق এর অর্থ অবস্থা, স্তর, পর্যায় ইত্যাদি [ইবন কাসীর] تَرْكَبُنَّ শব্দটি ركوب থেকে। এর অর্থ আরোহণ করা। অর্থ এই যে, হে মানুষ, তোমরা সর্বদাই এক স্তর থেকে অন্য স্তরে আরোহণ করতে থাকবে। উদ্দেশ্য এই যে, সৃষ্টির আদি থেকে অন্ত পর্যন্ত মানুষ কোন সময় এক অবস্থায় স্থির থাকে না, বরং তার ওপর পর্যায়ক্রমে পরিবর্তন আসতে থাকে। স্বাভাবিকভাবে যে সমস্ত পরিবর্তন হয় তা তো লক্ষণীয়। তাছাড়া মানুষ নিজেও আল্লাহ্র দেয়া সহজ-সরল দ্বীন থেকে বিমুখ হয়ে অন্যান্য বাতিল দ্বীনের অনুসরণে প্রবৃত্ত হয়। রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেন, “তোমরা তোমাদের পূর্বের লোকদের হাতে হাতে বিঘাতে বিঘাতে অনুসরণ করতে থাকবে, এমনকি তারা যদি ষাণ্ডার গর্তে ঢুকে থাকে তোমরাও তাদের অনুসরণ করে তাতে ঢুকবে” সাহাবায়ে কিরাম বললেন, আমরা বললাম, হে আল্লাহ্র রাসূল! ইয়াহূদ ও নাসারা? তিনি বললেন, “তারা নয়তো কারা?” [বুখারী: ৭৩২০, মুসলিম: ২৬৬৯] [ইবন কাসীর] এখানে ইবন জারীর আত-তাবারীর মত হচ্ছে, মানুষকে অবশ্যই কঠিন থেকে কঠিন পর্যায় অতিক্রম করতে হবে। আখেরাতের পর্যায়গুলোও উদ্দেশ্য হতে পারে। [তাবারী; ইবন কাসীর]</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>নিশ্চয়ই তোমরা এক পর্যায় হতে অন্য পর্যায়ে আরোহণ করবে। [১]</p><p>[১] طبق শব্দের মূল অর্থ হল কঠিনতা। এখানে সেই কঠিনতাকে বোঝানো হয়েছে যা কিয়ামতের দিন দেখা দেবে। সেদিন এক থেকে আর এক গুরুতর ভীষণ অবস্থা সৃষ্টি হবে। <em>(ফাতহুল বারী, সূরা ইনশিক্বাক তাফসীর পরিচ্ছেদ)</em> আর এটা হল কসমের জওয়াব।</p>"
      },
      {
        "resource_id": 94,
        "text": "( لتركبن ) قرأ أهل مكة وحمزة والكسائي : \" لتركبن \" بفتح الباء يعني لتركبن يا محمد ( طبقا عن طبق ) قال الشعبي ومجاهد : سماء بعد سماء . قال الكلبي : يعني تصعد فيها . ويجوز أن يكون درجة بعد درجة ورتبة بعد رتبة في القرب من الله تعالى والرفعة .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا سعيد بن النضر ، أخبرنا هشيم ، أخبرنا أبو بشر عن مجاهد قال قال ابن عباس : \" لتركبن طبقا عن طبق \" حالا بعد حال ، قال هذا نبيكم - صلى الله عليه وسلم - .وقيل : أراد به السماء تتغير لونا بعد لون ، فتصير تارة كالدهان وتارة كالمهل ، وتنشق بالغمام مرة وتطوى أخرى . وقرأ الآخرون بضم الباء ، لأن المعنى بالناس أشبه ، لأنه ذكر من قبل : \" فأما من أوتي كتابه بيمينه \" \" وشماله \" وذكر من بعد : \" فما لهم لا يؤمنون \" وأراد : لتركبن حالا بعد حال ، وأمرا بعد أمر في موقف القيامة ، يعني : الأحوال تنقلب بهم ، فيصيرون في الآخرة على غير الحال التي كانوا عليها في الدنيا . و \" عن \" بمعنى بعد .وقال مقاتل : يعني الموت ثم الحياة [ ثم الموت ثم الحياة ] .وقال عطاء : مرة فقيرا ومرة غنيا . وقال عمرو بن دينار عن ابن عباس : يعني الشدائد وأهوال الموت ، ثم البعث ثم العرض . وقال عكرمة : حالا بعد حال ، رضيع ثم فطيم ثم غلام ثم شاب ثم شيخ . وقال أبو عبيدة : لتركبن سنن من كان قبلكم وأحوالهم .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا محمد بن عبد العزيز ، أخبرنا أبو عمرو الصنعاني من اليمن عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري عن النبي - صلى الله عليه وسلم - : \" لتتبعن سنن من [ كان ] قبلكم شبرا شبرا وذراعا ذراعا ، حتى لو دخلوا جحر ضب لتبعتموهم \" قلنا : يا رسول الله آليهود والنصارى ؟ قال : فمن ؟ ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 20,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      { "resource_id": 168, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 14,
        "text": "أي فماذا يمنعهم من الإيمان بالله ورسوله واليوم."
      },
      {
        "resource_id": 92,
        "text": "فَمَا لَهُمْ لَا يُؤْمِنُونَ (20) يجوز أن يكون التفريع على ما ذكر من أحوال مَن أوتي كتابه وراء ظهره ، وأعيد عليه ضمير الجماعة لأن المراد ب ( من ) الموصولة كل من تحق فيه الصلة فجرى الضمير على مدلول ( مَن ) وهو الجماعة . والمعنى : فما لهم لا يخافون أهوال يوم لقاء الله فيؤمنوا .ويجوز أن يكون مفرعاً على قوله : { يا أيها الإنسان إنك كادح إلى ربك كدحاً فملاقيه } [ الانشقاق : 6 ] ، أي إذا تحققت ذلك فكيف لا يؤمن بالبعث الذين أنكروه . وجيء بضمير الغيبة لأن المقصود من الإِنكار والتعجيب خصوص المشركين من الذين شملهم لفظ الإِنسان في قوله : { يا أيها الإنسان إنك كادح } لأن العناية بموعظتهم أهم فالضمير التفات .ويجوز أن يكون تفريعاً على قوله : { لتركبن طبقاً عن طبق } [ الانشقاق : 19 ] فيكون مخصوصاً بالمشركين باعتبار أنهم أهم في هذه المواعظ . والضمير أيضاً التفات .ويجوز تفريعه على ما تضمنه القسم من الأحوال المقسم بها باعتبار تضمن القَسَم بها أنها دلائل على عظيم قدرة الله تعالى وتفرده بالإلهية ففي ذكرها تذكرة بدلالتها على الوحدانية . والالتفات هو هو .وتركيب «ما لهم لا يؤمنون» يشتمل على ( مَا ) الاستفهامية مُخبر عنها بالجار والمجرور . والجملةُ بعد { لهم } حال من ( ما ) الاستفهامية .وهذا الاستفهام مستعمل في التعجيب من عدم إيمانهم وفي إنكار انتفاء إيمانهم لأن شأن الشيء العجيب المنكَر أن يُسأل عنه فاستعمال الاستفهام في معنى التعجيب والإِنكار مجاز بعلاقة اللزوم ، واللام للاختصاص .وجملة : { لا يؤمنون } في موضع الحال فإنها لو وقع في مكانها اسمٌ لَكان منصوباً كما في قوله تعالى : { فما لكم في المنافقين فئتين } [ النساء : 88 ] والحال هي مناط التعجيب ، وقد تقدم تفصيل القول في تركيبه وفي الصّيغ التي ورد عليها أمثال هذا التركيب عند قوله تعالى : { قالوا وما لنا ألاَّ نقاتل في سبيل الله } في سورة البقرة ( 246 ) .ومتعلق يؤمنون } محذوف يدل عليه السّياق ، أي بالبعث والجزاء .ويجوز تنزيل فعل { يؤمنون } منزلة اللازم ، أي لا يتصفون بالإِيمان ، أي ما سبب أن لا يكونوا مؤمنين ، لظهور الدلائل على انفراد الله تعالى بالإلهية فكيف يستمرون على الإِشراك به .والمعنى : التعجيب والإِنكار من عدم إيمانهم مع ظهور دلائل صدق ما دُعوا إليه وأُنذروا به ."
      },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "قوله عز وجل: \"فما لهم لا يؤمنون\"؟ استفهام إنكار."
      },
      { "resource_id": 159, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "قوله تعالى : فما لهم لا يؤمنون يعني : أي شيء يمنعهم من الإيمان بعدما وضحت لهم الآيات وقامت الدلالات . وهذا استفهام إنكار . وقيل : تعجب أي اعجبوا منهم في ترك الإيمان مع هذه الآيات ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( فَمَا لَهُمْ لا يُؤْمِنُونَ ) يقول تعالى ذكره: فما لهؤلاء المشركين لا يصدّقون بتوحيد الله، ولا يقرّون بالبعث بعد الموت، وقد أقسم لهم ربهم بأنهم راكبون طبقًا عن طبق مع ما قد عاينوا من حججه بحقيقة توحيده.وقد حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله: ( فَمَا لَهُمْ لا يُؤْمِنُونَ ) قال: بهذا الحديث، وبهذا الأمر ."
      },
      { "resource_id": 91, "text": "ومع هذا، فكثير من الناس لا يؤمنون.  " },
      {
        "resource_id": 165,
        "text": "<p>সুতরাং তাদের কি হল যে, তারা বিশ্বাস স্থাপন করে না?</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>অতঃপর তাদের কি হল যে, তারা ঈমান আনে না?</p>"
      },
      {
        "resource_id": 16,
        "text": "فأيُّ شيء يمنعهم من الإيمان بالله واليوم الآخر بعد ما وُضِّحت لهم الآيات؟ وما لهم إذا قرئ عليهم القرآن لا يسجدون لله، ولا يسلِّمُون بما جاء فيه؟ إنما سجية الذين كفروا التكذيب ومخالفة الحق. والله أعلم بما يكتمون في صدورهم من العناد مع علمهم بأن ما جاء به القرآن حق، فبشرهم -أيها الرسول- بأن الله- عز وجل- قد أعدَّ لهم عذابًا موجعًا، لكن الذين آمنوا بالله ورسوله وأدَّوْا ما فرضه الله عليهم، لهم أجر في الآخرة غير مقطوع ولا منقوص."
      },
      {
        "resource_id": 93,
        "text": "والفاء فى قوله - تعالى - بعد ذلك : ( فَمَا لَهُمْ لاَ يُؤْمِنُونَ . وَإِذَا قُرِىءَ عَلَيْهِمُ القرآن لاَ يَسْجُدُونَ ) . لترتيب ما بعدها من الإِنكار والتعجيب على ما قبلها ، و \" ما \" للاستفهام ومن أن المستحق للعبادة هو الله - تعالى - وحده . . فأى شئ يمنع هؤلاء الكافرين من الإِيمان ، مع أن كل الدلائل والبراهين تدعوهم إلى الإِيمان .فالمقصود من الآيتين الكريمتين تعجيب الناس من حال هؤلاء الكافرين الذين قامت أمامهم جميع الأدلة على صدق اللرسول صلى الله عليه وسلم فيما يبلغه عن ربه ، ومع ذلك فهم مصرون على كفرهم وجحودهم وعنادهم .قال الآلوسى : وقد صح عنه صلى الله عليه وسلم أنه سجد عند قراءة هذه الآية ، فقد أخرج مسلم وأبو داود والترمذى . . عن أبى هريرة قال : سجدنا مع رسول الله صلى الله عليه وسلم فى ( إِذَا السمآء انشقت ) وفى ( اقرأ باسم رَبِّكَ . . ) وهى سنة عند الشافعى ، وواجبة عند أبى حنيفة . .أما الإِمام مالك فالرواية الراجحة فى مذهبه ، أن هذه الآية ليست من آيات سجود التلاوة ."
      },
      {
        "resource_id": 157,
        "text": "<p>ہاں اس بات کے لئے ان کے پاس کوئی وجہ جواز نہیں ہے ، اس کائنات کے مناظر میں ، اور خود انسانوں کے نفوس میں اس قدر شواہد اور آثار ہیں کہ قلب انسانی جدھر بھی متوجہ ہو ، وہ اسے دعوت نظارہ دیتے ہیں جہاں بھی زندہ فکرہو ، یہ شواہد بڑھ چڑھ کر سامنے آتے ہیں۔ یہ آثار و شواہد اس قدر کثرت سے ہیں ، اس قدر قوی ہیں اور اس قدر گہرے ہیں کہ اگر کسی بشر کا دل ان کی طرف ذرا بھی ملتفت ہو ، متوجہ ہو تو وہ اسے گھیر لیتے ہیں۔ اگر وہ ان کی طرف کان دھرے ، متوجہ ہو اور ان کی بات سنے تو یہ شواہد ہر جگہ اس کے ساتھ سرگوشیاں کرتے ہیں اور بآواز بلند بھی بات کرتے ہیں۔</p><p>فمالھم .................... یسجدون (21:84) السجدة ” پھر ان کو کیا ہوگیا ہے کہ وہ ایمان نہیں لاتے اور جب قرآن ان کے سامنے پڑھا جائے تو سجدہ نہیں کرتے “۔ قرآن ان کے ساتھ فطری زبان میں بات کرتا ہے ، اور انفس وآفاق میں جو دلائل فطرت اور اشارات ایمان پائے جاتے ہیں ان کے لئے ان کے دلوں کو کھولتا اور دلوں میں تقویٰ ، اطاعت اور خضوع وخشوع کے جذبات ابھارتا ہے اور یہی انسانی قلوب کے لئے سجدہ ہے۔</p><p>حقیقت یہ ہے کہ یہ کائنات بہت ہی خوبصورت ہے ، اس کے اندر ہر طرف اشارات قدرت ہیں ، اس کے اندر ایسی تجلیات اور ایسے انوار اور ایسے مناظر موجود ہیں جو قلب انسانی کو خضوع وخشوع کے جذبات سے بھردیتے ہیں۔</p><p>پھر یہ قرآن بھی خوبصورت اور اشاراتی ہے اور اس کے اندر بھی ایسے اشارات ، ایسے مناظر اور شواہد ہیں جو قلب ، بشری کا تعارف اس کائنات اور رب کائنات سے کراتے ہیں۔ اور انسان کے دل و دماغ میں اس عظیم کائنات کے عظیم حقائق ڈال کر اسے اس کائنات کے بزرگ و برتر خالق کی طرف متوجہ کرتے ہیں۔ کیا ہی شان ہے۔</p><p>فمالھم .................... یسجدون (21:84) السجدة ” پھر ان کو کیا ہوگیا ہے کہ وہ ایمان نہیں لاتے اور جب قرآن ان کے سامنے پڑھا جائے تو سجدہ نہیں کرتے “۔</p><p>یہ حقیقت ہے کہ یہ ایک عجیب طرز عمل ہے۔ اور اس طرز عمل کے ذریعہ اب بات کا رخ اس عجیب مخلوق کی طرف مڑجاتا ہے ، یعنی کفار کی طرف اور بتایا جاتا رہے کہ کیا ہی برا انجام ان کے انتظار میں ہے۔</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 21,
    "tafsirs": [
      { "resource_id": 169, "text": "" },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لا يَسْجُدُونَ ) يقول تعالى ذكره: وإذا قُرئ عليهم كتاب ربهم لا يخضعون ولا يستكينون، وقد بيَّنا معنى السجود قبلُ بشواهده، فأغنى ذلك عن إعادته."
      },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      {
        "resource_id": 166,
        "text": "<p>আর যখন তাদের কাছে কুরআন পাঠ করা হলে তখন তারা সিজ্দা করে না [১] ?</p><p>[১] অর্থাৎ যখন তাদের সামনে সুস্পষ্ট হেদায়েত পরিপূর্ণ কুরআন পাঠ করা হয়, তখনও তারা আল্লাহ্র দিকে নত হয় না। سجود এর আভিধানিক অর্থ নত হওয়া, আনুগত্য করা। বলাবাহুল্য, এখানে পারিভাষিক সাজদার পাশাপাশি আল্লাহ্র সামনে আনুগত্য সহকারে নত হওয়া তথা বিনীত হওয়াও উদ্দেশ্য। আবু হুরায়রা রাদিয়াল্লাহু ‘আনহু এ সূরা পরে সাজদাহ করলেন, তারপর লোকদের দিকে ফিরে জানালেন যে, রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম স্বয়ং এ সূরা পড়ার পরে সাজদাহ করেছেন। [মুসলিম: ৫৭৮] অন্য বর্ণনায় এসেছে, তিনি এশার সালাতে এ সূরা পাঠের পর সাজদাহ করলেন, এ ব্যাপারে জিজ্ঞাসিত হওয়ার পর বললেন, আমি আবুল কাসেম (মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম) এর পিছনে সাজদাহ করেছি, সুতরাং তার সাথে মিলিত হওয়ার আগ পর্যন্ত সাজদাহ করবই।” [বুখারী: ১০৭৮, মুসলিম: ৫৭৮]</p>"
      },
      {
        "resource_id": 90,
        "text": "قوله تعالى : وإذا قرئ عليهم القرآن لا يسجدون أي لا يصلون . وفي الصحيح : أن أبا هريرة قرأ إذا السماء انشقت فسجد فيها ، فلما انصرف أخبرهم أن رسول الله - صلى الله عليه وسلم - سجد فيها . وقد قال مالك : إنها ليست من عزائم السجود ; لأن المعنى لا يذعنون ولا يطيعون في العمل بواجباته .ابن العربي : والصحيح أنها منه ، وهي رواية المدنيين عنه ، وقد اعتضد فيها القرآن والسنة . قال ابن العربي : لما أممت بالناس تركت قراءتها ; لأني إن سجدت أنكروه ، وإن تركتها كان تقصيرا مني ، فاجتنبتها إلا إذا صليت وحدي . وهذا تحقيق وعد [ ص: 242 ] الصادق بأن يكون المعروف منكرا ، والمنكر معروفا ; وقد قال - صلى الله عليه وسلم - لعائشة : لولا حدثان قومك بالكفر لهدمت البيت ، ولرددته على قواعد إبراهيم .ولقد كان شيخنا أبو بكر الفهري يرفع يديه عند الركوع ، وعند الرفع منه ، وهو مذهب مالك والشافعي ويفعله الشيعة ، فحضر عندي يوما في محرس ابن الشواء بالثغر - موضع تدريسي - عند صلاة الظهر ، ودخل المسجد من المحرس المذكور ، فتقدم إلى الصف وأنا في مؤخره قاعدا على طاقات البحر ، أتنسم الريح من شدة الحر ، ومعي في صف واحد أبو ثمنة رئيس البحر وقائده ، مع نفر من أصحابه ينتظر الصلاة ، ويتطلع على مراكب تخت الميناء ، فلما رفع الشيخ يديه في الركوع وفي رفع الرأس منه قال أبو ثمنة وأصحابه : ألا ترون إلى هذا المشرقي كيف دخل مسجدنا ؟ فقوموا إليه فاقتلوه وارموا به إلى البحر ، فلا يراكم أحد . فطار قلبي من بين جوانحي وقلت : سبحان الله هذا الطرطوشي فقيه الوقت . فقالوا لي : ولم يرفع يديه ؟ فقلت : كذلك كان النبي - صلى الله عليه وسلم - يفعل ، وهذا مذهبمالك ، في رواية أهل المدينة عنه . وجعلت أسكنهم وأسكتهم حتى فرغ من صلاته ، وقمت معه إلى المسكن من المحرس ، ورأى تغير وجهي ، فأنكره ، وسألني فأعلمته ، فضحك وقال : ومن أين لي أن أقتل على سنة ؟ فقلت له : ولا يحل لك هذا ، فإنك بين قوم إن قمت بها قاموا عليك وربما ذهب دمك . فقال : دع هذا الكلام ، وخذ في غيره ."
      },
      { "resource_id": 159, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 92,
        "text": "وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآَنُ لَا يَسْجُدُونَ (21)و { لا يسجدون } عطف على { لا يؤمنون } { وإذا قرىء عليهم القرآن } ظرف قدم على عامله للاهتمام به وتنويه شأن القرآن .وقراءة القرآن عليهم قراءته قراءةَ تبليغ ودعوة . وقد كان النبي صلى الله عليه وسلم يعرض عليهم القرآن جماعات وأفراداً وقد قال له عبد الله بن أبيّ بن سلول : «لا تَغْشَنا به في مجالسنا» وقرأ النبي صلى الله عليه وسلم القرآن على الوليد بن المغيرة كما ذكرناه في سورة عبس .والسجود مستعمل بمعنى الخضوع والخشوع كقوله تعالى :{ والنجم والشجر يسجدان } [ الرحمن : 6 ] وقوله : { يتفيؤا ظلاله عن اليمين والشمائل سجداً للَّه } [ النحل : 48 ] ، أي إذا قرىء عليهم القرآن لا يخضعون لله ولمعاني القرآن وحجته ، ولا يؤمنون بحقيته ودليل هذا المعنى مقابلته بقوله : { بل الذين كفروا يكذبون } [ الانشقاق : 22 ] .وليس في هذه الآية ما يقتضي أنَّ عند هذه الآية سجدةً من سجود القرآن والأصحّ من قول مالك وأصحابه أنها ليست من سجود القرآن خلافاً لابن وَهب من أصحاب مالك فإنه جعل سجودات القرآن أربع عشرة . وقال الشافعي : هي سُنة . وقال أبو حنيفة : واجبة . والأرجح أن عزائم السجود المسنونة إحدى عشرة سجدة وهي التي رويت بالأسانيد الصحيحة عن الصّحابة . وإن ثلاث آيات غير الإِحدى عشرة آية رويت فيها أخبار أنها سجد النبي صلى الله عليه وسلم عند قراءتها منها هذه وعارضتها روايات أخرى فهي : إمّا قد تُرك سجودها ، وإمّا لم يؤكد ومنها قوله تعالى هنا : { وإذا قرىء عليهم القرآن لا يسجدون } . وقال ابن العربي السجود في سورة الانشقاق قول المدنيين من أصحاب مالك ا ه .قلت : وهو قول ابن وهب ولا خصوصية لهذه الآية بل ذلك في السجدات الثلاث الزائدة على الإِحدى عشرة وقد قال مالك في «الموطأ» بعد أن رَوى حديث أبي هريرة : \" الأمر عندنا أن عزائم السجود إحدى عشرة سجدة ليس في المفصل منها شيء \" وقال أبو حنيفة والشافعي : سجدات التلاوة أربع عشرة بزيادة سجدة سورة النجم وسجدة سورة الانشقاق وسجدة سورة العلق . وقال أحمد : هن خمس عشرة سجدة بزيادة السجدة في آخر الآية من سورة الحجّ ففيها سجدتان عنده ."
      },
      {
        "resource_id": 94,
        "text": "( وإذا قرئ عليهم القرآن لا يسجدون ) قال الكلبي ومقاتل : لا يصلون .أخبرنا أبو عثمان سعيد بن إسماعيل الضبي ، أخبرنا أبو محمد عبد الجبار بن محمد الجراحي ، حدثنا أبو العباس محمد بن أحمد المحبوبي ، حدثنا أبو عيسى الترمذي ، حدثنا قتيبة حدثنا سفيان بن عيينة عن أيوب بن موسى عن عطاء بن مينا عن أبي هريرة قال : سجدنا مع رسول الله - صلى الله عليه وسلم - في \" اقرأ باسم ربك \" \" وإذا السماء انشقت \" .أخبرنا عبد الواحد المليحي ، أخبرنا أحمد بن عبد الله النعيمي ، أخبرنا محمد بن يوسف ، حدثنا محمد بن إسماعيل ، حدثنا مسدد ، أخبرنا معمر قال : سمعت أبي قال حدثني بكر ، عن أبي رافع قال : صليت مع أبي هريرة العتمة فقرأ إذا السماء انشقت ، فسجد فقلت : ما هذا ؟ قال : سجدت بها خلف أبي القاسم - صلى الله عليه وسلم - فلا أزال أسجد فيها حتى ألقاه ."
      },
      {
        "resource_id": 14,
        "text": "وما لهم إذا قرئت عليهم آيات الله وكلامه وهو هذا القرآن لا يسجدون إعظاما وإكراما واحتراما؟."
      },
      {
        "resource_id": 16,
        "text": "فأيُّ شيء يمنعهم من الإيمان بالله واليوم الآخر بعد ما وُضِّحت لهم الآيات؟ وما لهم إذا قرئ عليهم القرآن لا يسجدون لله، ولا يسلِّمُون بما جاء فيه؟ إنما سجية الذين كفروا التكذيب ومخالفة الحق. والله أعلم بما يكتمون في صدورهم من العناد مع علمهم بأن ما جاء به القرآن حق، فبشرهم -أيها الرسول- بأن الله- عز وجل- قد أعدَّ لهم عذابًا موجعًا، لكن الذين آمنوا بالله ورسوله وأدَّوْا ما فرضه الله عليهم، لهم أجر في الآخرة غير مقطوع ولا منقوص."
      },
      {
        "resource_id": 91,
        "text": "{ وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ } أي: لا يخضعون للقرآن، ولا ينقادون لأوامره ونواهيه،  "
      },
      {
        "resource_id": 165,
        "text": "<p>এবং তাদের নিকট কুরআন পঠিত হলে তারা সিজদাহ করে না? [১] সাজদাহ</p><p>[১] হাদীসসমূহ থেকে এখানে নবী (সাঃ) এবং সাহাবীগণের সিজদা করার কথা প্রমাণিত আছে। (অতএব এ আয়াত পাঠ করার পর সিজদা করা মুস্তাহাব। সিজদার আহকাম জানতে সূরা আ'রাফের শেষ আয়াতের ৭:২০৬ টীকা দেখুন।)</p>"
      },
      {
        "resource_id": 170,
        "text": "Но, несмотря на это, многие люди не веруют и не падают ниц, когда им читают Коран. Они не покоряются велениям Корана и не подчиняются его приказам и запретам."
      },
      {
        "resource_id": 168,
        "text": "<p>Therefore, the verse concludes:</p><p>فَمَا لَهُمْ لَا يُؤْمِنُونَ ﴿20﴾ وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ ۩</p><p>So, what has happened to them that they do not believe, and when the Qur'an is recited to them, they do not offer sajdah [ prostration ] ۩? (84:20-21)</p><p>It means that when the Qur'an, replete with clear guidelines, is recited to them, they do not bow in submission.</p><p>The word sajdah /sujud literally denotes 'to bow' and it connotes 'obedience'. Obviously, the word here is not used in its technical sense. It is used in the sense of bowing in submission with respect, humbleness and humility. The reason [ for this interpretation ] is quite clear. This verse does not command to prostrate at the time of recitation of a particular verse. It is related to the entire Qur'an. If the word sajdah had referred to the technical prostration, it would necessarily entail that prostration be offered at every verse of the entire Qur'an, which by unanimous agreement of the Ummah is not the case. Neither salaf nor khalaf subscribe to this view. Now remains the question whether or not a sajdah is obligatory when this verse is recited. (There is a disagreement among the jurists on this point) By a long stretch of imagination, it is possible to use this verse in evidence or support of arguing in favour of prostration being obligatory on recitation of this verse, as some of the Hanafi jurists have done. According to them, the definite article ال al- 'the' in the word al-Qur'an stands for the article that is used to indicate previous knowledge, and thus the word al-Qur'an here refers to this particular verse under comment, not to the entire al-Qur'an or the Holy Book. However, this interpretation is after all merely a possibility, but the clear context of the verse indicates that it seems to be far-fetched to take the verse in this sense. And Allah knows best! The true interpretation can be determined by prophetic narratives, the practice of the Holy Prophet ﷺ \" and that of the noble Companions ؓ . The narratives pertaining to sajdah of tilawah differ. Some indicate that it is an obligatory duty to make sajdah on this verse, and others indicate that it is not. As a result, there is a difference of opinion among jurists. Imam Abu Hanifah رحمۃ علیہ holds the view that prostration at this verse is an obligatory duty as is obligatory at other verses of mufassal. Imam A` zam رحمۃ علیہ adduces the following Ahadith in favour of his opinion:</p><p>Bukhari recorded from Abu Rafi` ؓ that he prayed the ` Isha' [ Night ] prayer behind Sayyidna Abu Hurairah ؓ ، and the latter recited: إِذَا السَّمَاءُ انشَقَّتْ (When the sky will split apart) and at the relevant verse, he prostrated. So, Sayyidna Abu Rafi` ؓ asked him what type of prostration it was. Sayyidna Abu Hurairah ؓ replied: \"I prostrated at this verse behind Abul Qasim in a salah, and I will never cease prostrating during its recitation until I meet him on the Plain of Gathering.\" Muslim transmitted a narrative from Sayyidna Abu Hurairah ؓ that they prostrated with the Holy Prophet ﷺ at relevant verses of this Surah, and of اقْرَأْ بِاسْمِ رَبِّكَ.</p><p>Qurtubi reports from Ibn-ul-` Arabi that the veritable view is that this verse is one of the verses at which it is an obligatory duty to prostrate when read or recited or heard being recited. However, the people among whom Ibn-ul-` Arabi lived' it was not customary among them to prostrate at this verse. They probably followed an Imam, according to whom the prostration was not obligatory. As a result, Ibn-ul-` Arabi says that whenever he led the congregational prayer, he would avoid reciting Surah Al-Inshiqaq, because in his view prostration at the relevant verse is obligatory. If he does not perform the prostration, he would be sinning. If he does perform the prostration, the entire congregation would regard it an unnecessary act. Therefore, he felt he should not unnecessarily split the community. And Allah knows best!</p><p>Alhamdulillah</p><p>The Commentary on</p><p>Surah Al-Inshiqaq</p><p>Ends here</p>"
      },
      {
        "resource_id": 93,
        "text": "وأى : مانع منعهم من السجود والخضوع لله - عند ما يقرأ عليهم القرآن الكريم ، الذى أنزلناه عليك لإِخراجهم من الظلمات إلى النور .فالمقصود من الآيتين الكريمتين تعجيب الناس من حال هؤلاء الكافرين الذين قامت أمامهم جميع الأدلة على صدق اللرسول صلى الله عليه وسلم فيما يبلغه عن ربه ، ومع ذلك فهم مصرون على كفرهم وجحودهم وعنادهم .قال الآلوسى : وقد صح عنه صلى الله عليه وسلم أنه سجد عند قراءة هذه الآية ، فقد أخرج مسلم وأبو داود والترمذى . . عن أبى هريرة قال : سجدنا مع رسول الله صلى الله عليه وسلم فى ( إِذَا السمآء انشقت ) وفى ( اقرأ باسم رَبِّكَ . . ) وهى سنة عند الشافعى ، وواجبة عند أبى حنيفة . .أما الإِمام مالك فالرواية الراجحة فى مذهبه ، أن هذه الآية ليست من آيات سجود التلاوة ."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 22,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 14,
        "text": "أي من سجيتهم التكذيب والعناد والمخالفة للحق."
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 94,
        "text": "\"بل الذين كفروا يكذبون\"، بالقرآن والبعث."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "قوله تعالى : بل الذين كفروا يكذبون محمدا - صلى الله عليه وسلم - وما جاء به . وقال مقاتل : نزلت في بني عمرو بن عمير وكانوا أربعة ، فأسلم اثنان منهم . وقيل : هي في جميع الكفار ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - : ( بَلِ الذين كَفَرُواْ يُكَذِّبُونَ ) إضرب انتقالى ، من التعجيب من عدم إيمانهم مع ظهور كل الأدلة على وجوب الإِيمان ، إلى الإِخبار عنهم بأنهم مستمرون على كفرهم ، أى : ليس هناك أى مانع الكافرين من الإِيمان ، بعد أن قامت جميع الشواهد على صدق الرسول صلى الله عليه وسلم ، بل الحق أن هؤلاء الكافرين إنما استمروا على كفرهم بسبب عنادهم وحسدهم للرسول صلى الله عليه وسلم على ما آتاه الله - تعالى - من فضله ، وتكذيبهم للحق عناداً وجحوداً ."
      },
      {
        "resource_id": 15,
        "text": "القول في تأويل قوله تعالى :  بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ (22)قوله: ( بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ ) يقول تعالى ذكره: بل الذين كفروا يكذبون بآيات الله وتنـزيله."
      },
      {
        "resource_id": 92,
        "text": "بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ (22)يجوز إنه إضراب انتقالي من التعجيب من عدم إيمانهم وإنكاره عليهم إلى الإِخبار عنهم بأنهم مستمرون على الكفر والطعن في القرآن ، فالكلام ارتقاء في التعجيب والإِنكار .فالإِخبار عنهم بأنهم يكذبون مستعمل في التعجيب والإِنكار فلذلك عبر عنه بالفعل المضارع الذي يستروح منه استحضار الحالة مثل قوله : { يجادلنا في قوم لوط } [ هود : 74 ] .ويجوز أن يكون { بل } إضراباً إبطالياً ، أي لا يوجد ما لأجله لا يؤمنون ولا يصدقون بالقرآن بل الواقع بضد ذلك فإن بواعث الإِيمان من الدلائل متوفرة ودواعي الاعتراف بصدق القرآن والخضوع لدعوته متظاهرة ولكنهم يكذبون ، أي يستمرون على التكذيب عناداً وكبرياء ويومىء إلى ذلك قوله : { واللَّه أعلم بما يوعون } [ الانشقاق : 23 ] .وهذان المعنيان نظيرُ الوجهين في قوله تعالى في سورة الانفطار ( 9 10 ) { بل تكذبون بالدين وإن عليكم لحافظين . } وفي اجتلاب الفعل المضارع دلالة على حدوث التكذيب منهم وتجدده ، أي بل هم مستمرون على التكذيب عناداً وليس ذلك اعتقاداً فكما نُفي عنهم تجدُّد الإِيمان وتجدد الخضوع عند قراءة القرآن أُثبت لهم تجدد التكذيب .وقوله : الذين كفروا } إظهار في مقام الإِضمار لأن مقتضى الظاهر أن يقال : بل هم يكذبون ، فعدل إلى الموصول والصلة لما تؤذن به الصلة من ذمهم بالكفر للإِيماء إلى علة الخبر ، أي أنهم استمروا على التكذيب لتأصل الكفر فيهم وكونهم ينعتون به ."
      },
      {
        "resource_id": 91,
        "text": "{ بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ } أي: يعاندون الحق بعدما تبين، فلا يستغرب عدم إيمانهم وعدم انقيادهم للقرآن، فإن المكذب بالحق عنادًا، لا حيلة فيه. "
      },
      {
        "resource_id": 157,
        "text": "<p>اصل بات یہ ہے کہ جن لوگوں نے کفر کیا ہے وہ تکذیب کرنے پر تل گئے ہیں ، جھٹلانا ان کا مزاج ثانی بن گیا ہے۔ تکذیب ان کی علامت ہے لیکن ان کے دلوں کے اندر جو بیماریاں ہیں اور جن کی وجہ سے انہوں نے تکذیب کو اپنا اوڑھنا بچھونا بنایا ہے۔ اللہ انہیں خوب جانتا ہے۔ یہ محض شرارت ہے اور برے مقاصد ہیں جو تکذیب کا سبب بن رہے ہیں۔</p><p>اب ان کی بات یہاں ختم ہوتی ہے اور روئے سخن براہ راست حضور اکرم ﷺ کی طرف پھرجاتا ہے۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>বরং কাফেররা মিথ্যা মনে করে। [১]</p><p>[১] অর্থাৎ, ঈমান আনার (বিশ্বাস করার) পরিবর্তে মিথ্যা মনে করে।</p>"
      },
      { "resource_id": 166, "text": "<p>বরং কাফিররা মিথ্যারোপ করে।</p>" },
      {
        "resource_id": 16,
        "text": "فأيُّ شيء يمنعهم من الإيمان بالله واليوم الآخر بعد ما وُضِّحت لهم الآيات؟ وما لهم إذا قرئ عليهم القرآن لا يسجدون لله، ولا يسلِّمُون بما جاء فيه؟ إنما سجية الذين كفروا التكذيب ومخالفة الحق. والله أعلم بما يكتمون في صدورهم من العناد مع علمهم بأن ما جاء به القرآن حق، فبشرهم -أيها الرسول- بأن الله- عز وجل- قد أعدَّ لهم عذابًا موجعًا، لكن الذين آمنوا بالله ورسوله وأدَّوْا ما فرضه الله عليهم، لهم أجر في الآخرة غير مقطوع ولا منقوص."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 22{ بَلِ الَّذِیْنَ کَفَرُوْا یُـکَذِّبُوْنَ۔ } ”بلکہ یہ کافر تو جھٹلا رہے ہیں۔“ اس آیت کے الفاظ سے یہ اہم نکتہ بھی واضح ہوتا ہے کہ کفر اور تکذیب باہم مترادفات نہیں بلکہ الگ الگ معنی کے حامل دو الفاظ ہیں۔ کفر کے لغوی معنی چھپانے کے ہیں۔ اس مفہوم میں کسی انسان کا ”کفر“ یہ ہے کہ اس کی فطرت کے اندر اللہ تعالیٰ نے اپنی ذات کی معرفت سے متعلق جو گواہیاں رکھی ہیں ‘ وہ جانتے بوجھتے ان گواہیوں کو چھپا دے اور لوگوں کے سامنے ان کا اقرار و اظہار نہ کرے۔ جبکہ تکذیب سے مراد اللہ تعالیٰ کی ان آیات کو جھٹلانا ہے جو انسانی فطرت میں موجود گواہیوں کو اجاگر activate کرنے کے لیے اس کی طرف سے نازل ہوئیں۔ اس لحاظ سے کفر اور تکذیب دو الگ الگ جرائم ہیں۔ بلکہ اس وضاحت کے اعتبار سے دیکھا جائے تو کفر کے مقابلے میں تکذیب بڑا جرم ہے۔ حضرت آدم علیہ السلام کو زمین پر بھیجتے وقت اللہ تعالیٰ کی طرف سے آپ علیہ السلام کو جو چارٹر عطا کیا گیا تھا اس میں بھی ان دونوں جرائم کا ذکر الگ الگ ہوا ہے۔ ملاحظہ ہو اس چارٹر کی عبارت : { قُلْنَا اھْبِطُوْا مِنْھَا جَمِیْعًاج فَاِمَّا یَاْتِیَنَّـکُمْ مِّنِّیْ ھُدًی فَمَنْ تَبِعَ ھُدَایَ فَلَا خَوْفٌ عَلَیْھِمْ وَلَا ھُمْ یَحْزَنُوْنَ - وَالَّذِیْنَ کَفَرُوْا وَکَذَّبُوْا بِاٰیٰتِنَـآ اُولٰٓـئِکَ اَصْحٰبُ النَّارِج ھُمْ فِیْھَا خٰلِدُوْنَ۔ }  ”ہم نے کہا : تم سب کے سب یہاں سے اتر جائو۔ تو جب بھی آئے تمہارے پاس میری جانب سے کوئی ہدایت ‘ تو جو لوگ میری اس ہدایت کی پیروی کریں گے ان کے لیے نہ کوئی خوف ہوگا اور نہ وہ حزن سے دوچار ہوں گے۔ اور جو کفر کریں گے اور ہماری آیات کو جھٹلائیں گے وہ آگ والے جہنمی ہوں گے ‘ اس میں وہ ہمیشہ ہمیش رہیں گے۔“  ان دونوں جرائم میں سے پہلے جرم یعنی کفر کے بارے میں تو شاید کوئی عذر بھی قبول ہوجائے۔ مثلاً یہ عذر کہ ماحول کے منفی اثرات کی وجہ سے کسی انسان کی روح یا فطرت پر غفلت یا جہالت کے پردے پڑگئے تھے ‘ اور اس وجہ سے اس کی فطرت کے آئینے میں اللہ تعالیٰ کی معرفت پوری طرح سے منعکس نہ ہوسکی۔ مگر جب اللہ تعالیٰ کی واضح آیات کی صورت میں انسان کے سامنے باقاعدہ روشنی آگئی اور اس روشنی سے بھی اس کو وہی پیغام ملا جو عین اس کی اپنی فطرت کی پکار تھی تو اس کا جانتے بوجھتے ان آیات کو جھٹلا دینا یقینا بہت بڑی ڈھٹائی اور بہت بڑا جرم ہے جس کے خلاف کوئی عذر قابل قبول نہیں ہوسکتا۔</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 23,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 94,
        "text": "\"والله أعلم بما يوعون\". في صدورهم من التكذيب. قال مجاهد: يكتمون."
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 157, "text": "" },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "والله أعلم بما يوعون أي بما يضمرونه في أنفسهم من التكذيب . كذا روى الضحاك عن ابن عباس . وقال مجاهد : يكتمون من أفعالهم . ابن زيد : يجمعون من الأعمال الصالحة [ ص: 243 ] والسيئة ; مأخوذ من الوعاء الذي يجمع ما فيه ; يقال : أوعيت الزاد والمتاع : إذا جعلته في الوعاء ; قال الشاعر :الخير أبقى وإن طال الزمان به والشر أخبث ما أوعيت من زادووعاه أي حفظه ; تقول : وعيت الحديث أعيه وعيا ، وأذن واعية . وقد تقدم ."
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      },
      {
        "resource_id": 170,
        "text": "Они противятся истине после того, как она стала ясна им. Поэтому нет ничего удивительного в том, что они не веруют и не подчиняются Корану. Однако всякий, кто упрямо отрицает истину, навсегда будет лишен благого конца. Воистину, Знающему Аллаху известно все, что они совершают и замышляют втайне. Аллаху ведомы все, что они совершают скрытно и всенародно, и Он воздаст им за их деяния. Поэтому далее Он сказал:"
      },
      { "resource_id": 14, "text": "قال مجاهد وقتادة يكتمون في صدورهم." },
      {
        "resource_id": 92,
        "text": "وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ (23)اعتراض بين جملة { بل الذين كفروا يكذبون } [ الانشقاق : 22 ] ، وجملة : { فبشرهم بعذاب أليم } [ الانشقاق : 24 ] وهو كناية عن الإِنذار والتهديد بأن الله يجازيهم بسوء طويتهم .ومعنى { بما يوعون } بما يُضمرون في قلوبهم من العناد مع علمهم بأنَّ ما جاء به القرآن حق ولكنهم يظهرون التّكذيب به ليكون صدودهم عنه مقبولاً عند أتباعهم وبين مجاوريهم .وأصل معنى الإِيعاء : جعل الشيء وعاء والوعاء بكسر الواو الظرف لأنه يُجمع فيه ، ثم شاع إطلاقه على جمع الأشياء لئلا تفوت فصار مشعراً بالتقتير ، ومنه قوله تعالى : { وجَمَع فأوعى } [ المعارج : 18 ] وفي الحديث : « لا تُوعي فيُوعي الله عليكِ » واستعمل في هذه الآية في الإِخفاء لأنّ الإِيعاء يستلزم الإِخفاء فهو هنا مجاز مرسل ."
      },
      {
        "resource_id": 16,
        "text": "فأيُّ شيء يمنعهم من الإيمان بالله واليوم الآخر بعد ما وُضِّحت لهم الآيات؟ وما لهم إذا قرئ عليهم القرآن لا يسجدون لله، ولا يسلِّمُون بما جاء فيه؟ إنما سجية الذين كفروا التكذيب ومخالفة الحق. والله أعلم بما يكتمون في صدورهم من العناد مع علمهم بأن ما جاء به القرآن حق، فبشرهم -أيها الرسول- بأن الله- عز وجل- قد أعدَّ لهم عذابًا موجعًا، لكن الذين آمنوا بالله ورسوله وأدَّوْا ما فرضه الله عليهم، لهم أجر في الآخرة غير مقطوع ولا منقوص."
      },
      {
        "resource_id": 91,
        "text": "{ وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ } أي: بما يعملونه وينوونه سرًا، فالله يعلم سرهم وجهرهم، وسيجازيهم بأعمالهم."
      },
      {
        "resource_id": 93,
        "text": "وقوله - سبحانه - : ( والله أَعْلَمُ بِمَا يُوعُونَ ) كلام معترض بين سابقه ولا حقه ، والمقصود به التهديد والوعيد .ومعنى \" يوعون \" يضمرون ويخفون ويسرون ، وأصل الإِيعاء حفظ الأمتعة فى الوعاء ، يقال : أوعى فلان الزاد والمتاع ، إذا جعله فى الوعاء ، والمراد به هنا : الإِضمار والإِخفاء ، كما فى قوله الشاعر :والشر أخبث ما أوعيت من زاد ... أى : والله - تعالى - أعلم من كل أحد ، بما يضمره هؤلاء الكافرون ، وبما يخفونه فى صدورهم من تكذيب للحق ، ومن جحود للقرآن الكريم ، ومن معاداة للمؤمنين ."
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 23{ وَاللّٰہُ اَعْلَمُ بِمَا یُوْعُوْنَ۔ } ”اور اللہ کو خوب معلوم ہے کہ یہ لوگ اپنے اندر کیا بھرے ہوئے ہیں۔“ عام طور پر اس آیت کے بارے میں یہی سمجھا گیا ہے کہ اس میں انسان کے مال و دولت جمع کرنے کی طرف اشارہ ہے ‘ لیکن دراصل اس سے دلوں اور سینوں کی گندگی مراد ہے۔ یعنی اللہ تعالیٰ خوب جانتا ہے کہ ان لوگوں کے سینے کفر ‘ عداوت ‘ بغض ‘ حسد ‘ تکبر وغیرہ کی غلاظتوں سے بھرے ہوئے ہیں اور اسی وجہ سے یہ اللہ کی آیات کو پہچان لینے کے بعد بھی ان کی تکذیب کر رہے ہیں۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>(অথচ) তারা (মনে মনে) যা পোষণ করে থাকে, আল্লাহ তা সবিশেষ পরিজ্ঞাত। [১]</p><p>[১] অর্থাৎ, তাদের মিথ্যা জানা অথবা যে সব কর্ম তারা গোপনে করে আল্লাহ তা ভালোভাবে জানেন।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>আর তারা যা পোষণ করে আল্লাহ্ তা সবিশেষ অবগত।</p>"
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ ) يقول تعالى ذكره: والله أعلم بما تُوعيه صدور هؤلاء المشركين من التكذيب بكتاب الله ورسوله.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني محمد بن عمرو، قال: ثنا أبو عاصم، قال: ثنا عيسى؛ وحدثني الحارث، قال: ثنا الحسن، قال: ثنا ورقاء، جميعا، عن ابن أبي نجيح، عن مجاهد، قوله: ( يُوعُونَ ) قال: يكتمون .حدثني يونس، قال: أخبرنا ابن وهب، قال: قال ابن زيد، في قوله: ( وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ ) قال: المرءُ يُوعِي متاعه وماله هذا في هذا، وهذا في هذا، هكذا يعرف الله ما يوعون من الأعمال، والأعمال السيئة مما تُوعيه قلوبهم، ويجتمع فيها من هذه الأعمال الخير والشر، فالقلوب وعاء هذه الأعمال كلها، الخير والشرّ، يعلم ما يسرّون وما يعلنون، ولقد وَعَى لكم ما لا يدري أحد ما هو من القرآن وغير ذلك، فاتقوا الله وإياكم أن تدخلوا على مكارم هذه الأعمال بعض هذه الخبث ما يفسدها .حدثنا ابن عبد الأعلى، قال: ثنا ابن ثور، عن معمر، عن قتادة، في قوله: ( يُوعُونَ ) قال في صدورهم."
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 24,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      { "resource_id": 159, "text": "" },
      {
        "resource_id": 16,
        "text": "فأيُّ شيء يمنعهم من الإيمان بالله واليوم الآخر بعد ما وُضِّحت لهم الآيات؟ وما لهم إذا قرئ عليهم القرآن لا يسجدون لله، ولا يسلِّمُون بما جاء فيه؟ إنما سجية الذين كفروا التكذيب ومخالفة الحق. والله أعلم بما يكتمون في صدورهم من العناد مع علمهم بأن ما جاء به القرآن حق، فبشرهم -أيها الرسول- بأن الله- عز وجل- قد أعدَّ لهم عذابًا موجعًا، لكن الذين آمنوا بالله ورسوله وأدَّوْا ما فرضه الله عليهم، لهم أجر في الآخرة غير مقطوع ولا منقوص."
      },
      { "resource_id": 94, "text": "\"فبشرهم بعذاب أليم\"." },
      {
        "resource_id": 14,
        "text": "أي فأخبرهم يا محمد بأن الله عز وجل قد أعد لهم عذابا أليما."
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      { "resource_id": 170, "text": "" },
      {
        "resource_id": 93,
        "text": "وقوله : ( فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ ) تفريع على قوله : ( بَلِ الذين كَفَرُواْ يُكَذِّبُونَ ) .والتبشير : الإِخبار بام يسر ، والمراد به هنا التهكم بهم ، بدليل توعدهم بالعذاب الأليم ."
      },
      { "resource_id": 381, "text": "" },
      {
        "resource_id": 90,
        "text": "أي موجع في جهنم على تكذيبهم .أي أجعل ذلك بمنزلة البشارة ."
      },
      {
        "resource_id": 91,
        "text": "{ فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ } وسميت البشارة بشارة، لأنها تؤثر في البشرة سرورًا أو غمًا. فهذه حال أكثر الناس، التكذيب بالقرآن، وعدم الإيمان [به]. "
      },
      {
        "resource_id": 15,
        "text": "وقوله: ( فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ ) يقول جلّ ثناؤه: فبشر يا محمد هؤلاء المكذّبين بآيات الله بعذاب أليم لهم عند الله موجع ."
      },
      {
        "resource_id": 92,
        "text": "فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ (24)تفريع على جملة { بل الذين كفروا يكذبون } [ الانشقاق : 22 ] .وفعل «بشِّرهم» مستعار للإِنذار والوعيد على طريقة التهكم لأن حقيقة التبشير : الإِخبار بما يَسرّ وينفع . فلما علق بالفعل عذاب أليم كانت قرينة التهكم كنَار على عَلم . وهو من قبيل قول عمرو بن كلثوم: ... قَرَيْنَاكُم فعجَّلْنا قِراكُمقُبَيْل الصبح مرْدَاةً طَحُونا ..."
      },
      {
        "resource_id": 157,
        "text": "<p>فبشرھم ............ الیم (24:84) ” لہٰذا ان کو درد ناک عذاب کی بشارت دے دو “۔ کیا ہی بری خوشخبری ہے جس میں کوئی مسرت نہیں ، جس کو پانے والا پسند ہی نہیں کرتا۔ نہ ایسی خوشخبری کا کوئی انتظار کرتا ہے۔ اور اہل ایمان جو تکذیب نہیں کرتے۔ ان کے لئے کیا کیا تیاریاں ہیں ؟ جو عمل صالح کے ذریعہ قیامت کی تیاریاں کرتے ہیں تو اسے تکذیب کرنے والوں کے انجام سے مستثنیٰ کرکے پیش کیا جاتا ہے۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>সুতরাং তাদেরকে যন্ত্রণাদায়ক শাস্তির সুসংবাদ দাও।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>কাজেই আপনি তাদেরকে যন্ত্রণাদায়ক শাস্তির সংবাদ দিন;</p>"
      },
      {
        "resource_id": 164,
        "text": "<p>Please check ayah 84:25 for complete tafsir.</p>"
      }
    ]
  },
  {
    "index": 84,
    "sura": 84,
    "verse": 25,
    "tafsirs": [
      { "resource_id": 168, "text": "" },
      {
        "resource_id": 16,
        "text": "فأيُّ شيء يمنعهم من الإيمان بالله واليوم الآخر بعد ما وُضِّحت لهم الآيات؟ وما لهم إذا قرئ عليهم القرآن لا يسجدون لله، ولا يسلِّمُون بما جاء فيه؟ إنما سجية الذين كفروا التكذيب ومخالفة الحق. والله أعلم بما يكتمون في صدورهم من العناد مع علمهم بأن ما جاء به القرآن حق، فبشرهم -أيها الرسول- بأن الله- عز وجل- قد أعدَّ لهم عذابًا موجعًا، لكن الذين آمنوا بالله ورسوله وأدَّوْا ما فرضه الله عليهم، لهم أجر في الآخرة غير مقطوع ولا منقوص."
      },
      { "resource_id": 169, "text": "" },
      { "resource_id": 160, "text": "" },
      {
        "resource_id": 170,
        "text": "Арабское слово бушра используется для обозначения как радостной вести, так и скорбного известия. Большинство людей считает Коран ложью и не верует в него, и лишь малую группу людей Аллах наставил на прямой путь. Они веруют в Аллаха и принимают все, что проповедовали посланники. Они веруют и вершат благие дела, и поэтому они будут удостоены неиссякаемой и бесконечной награды. Это будет то, чего не видывал взор, чего не слышали уши и о чем даже не помышляла человеческая душа."
      },
      {
        "resource_id": 90,
        "text": "إلا الذين آمنوا وعملوا الصالحات استثناء منقطع ، كأنه قال : لكن الذين صدقوا بشهادة أن لا إله إلا الله وأن محمدا رسول الله ، وعملوا الصالحات ، أي أدوا الفرائض المفروضة عليهم .لهم أجر أي ثواب غير ممنون أي غير منقوص ولا مقطوع ; يقال : مننت الحبل : إذا قطعته . وقد تقدم .وسأل نافع بن الأزرق ابن عباس عن قوله لهم أجر غير ممنون : فقال : غير مقطوع . فقال : هل تعرف ذلك العرب ؟ قال : نعم قد عرفه أخو يشكر حيث يقول :فترى خلفهن من سرعة الرج     ع منينا كأنه أهباءقال المبرد : المنين : الغبار ; لأنها تقطعه وراءها . وكل ضعيف منين وممنون . وقيل : غير ممنون لا يمن عليهم به . وذكر ناس من أهل العلم أن قوله : إلا الذين آمنوا وعملوا الصالحات ليس استئناء ، وإنما هو بمعنى الواو ، كأنه قال : والذين آمنوا . وقد مضى في ( البقرة ) القول فيه والحمد لله . تمت سورة الانشقاق ."
      },
      {
        "resource_id": 94,
        "text": "\"إلا الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون\"، غير مقطوع ولا منقوص."
      },
      {
        "resource_id": 14,
        "text": "هذا استثناء منقطع يعني لكن الذين آمنوا أي بقلوبهم وعملوا الصالحات أي بجوارحهم لهم أجر أي في الدار الآخرة غير ممنون قال ابن عباس غير منقوص وقال مجاهد والضحاك غير محسوب وحاصل قولهما أنه غير مقطوع كما قال تعالى \"عطاء غير مجذوذ\" وقال السدي قال بعضهم غير ممنون غير منقوص وقال بعضهم غير ممنون عليهم وهذا القول الأخير عن بعضهم قد أنكره غير واحد فإن الله عز وجل له المنة على أهل الجنة في كل حال وآن ولحظة وإنما دخلوها بفضله ورحمته لا بأعمالهم فله عليهم المنة دائما سرمدا والحمد لله وحده أبدا ولهذا يلهمون تسبيحه وتحميده كما يلهمون النفس وآخر دعواهم أن الحمد لله رب العالمين. آخر تفسير سورة الانشقاق ولله الحمد والمنة."
      },
      {
        "resource_id": 381,
        "text": "<p><b> ১৬-২৫ নম্বর আয়াতের তাফসীর: </b></p><p>الشَّفَق (অস্তরাগ) সেই লাল বর্ণের আভাকে বলা হয় যা সূর্যাস্তের পর পশ্চিম আকাশে প্রকাশ পায় এবং ইশার ওয়াক্ত শুরু হওয়া পর্যন্ত বাকী থাকে।</p><p>(وَمَا وَسَقَ) অর্থাৎ অন্ধকার নেমে আসার সাথে সাথে প্রতিটি জন্তু নিজ নিজ আবাসস্থলে সমাগত হয়। অর্থাৎ রাতের অন্ধকার যে সকল বস্তুকে নিজের আঁচল দ্বারা ঢেকে নেয়। কাতাদাহ (রহঃ) বলেন : অন্ধকারে যে সকল তারকা ও প্রাণী একত্রিত হয়। (ইবনু কাসীর)</p><p>(إِذَا اتَّسَقَ) এর অর্থ: যখন চাঁদ পূর্ণিমাতে পূর্ণতা লাভ করে। যেমন ১৩ তারিখের রাত থেকে নিয়ে ১৬ তারিখের রাত পর্যন্ত তার উক্ত অবস্থা বিদ্যমান থাকে।</p><p>এগুলোর শপথ করার পর আল্লাহ তা‘আলা এবার তার জবাবে বলছেন : নিশ্চয়ই তোমরা এক পর্যায় থেকে অন্য পর্যায়ে আরোহণ করবে। ইবনু আব্বাস (রাঃ) বলেন :</p><p class='arabic uthmani'>(لَتَرْكَبُنَّ طَبَقًا عَنْ طَبَقٍ)</p><p>অর্থাৎ حالا بعد حال বা এক অবস্থার পর অন্য অবস্থা। এটা তোমাদের নাবী (সাঃ) বলেছেন। (সহীহ বুখারী হা. ৪৯৪০) এর দ্বারা উদ্দেশ্য হলো: কিয়ামতের দিন মানুষ পর্যায়ক্রমে ভীষণ কঠিনের পর কঠিনতর পরিস্থিতির সম্মুখীন হবে।</p><p class='arabic uthmani'>(فَمَا لَهُمْ لَا يُؤْمِنُوْنَ)</p><p>অর্থাৎ তাদের নিকট এসব নিদর্শন সবিস্তারিত আলোচনা করার পরেও কোন্ জিনিস তাদেরকে আল্লাহ তা‘আলা ও আখিরাতে ঈমান আনতে বাধা দিল? আর কেন তাদের সামনে কুরআন তেলাওয়াত করলেও তারা আল্লাহ তা‘আলার জন্য সিজদা করে না এবং আগত সত্য মেনে নেয় না। (তাফসীর মুয়াসসার)</p><p class='arabic uthmani'>(وَإِذَا قُرِئَ عَلَيْهِمُ.....)</p><p>এ আয়াত পড়ে সিজদা দিতে হয়, যেমন অত্র সূরার শুরুতে আলোচনা করা হয়েছে। ইমাম মালেক (রহঃ) বলেন : এর অর্থ এই নয় যে, সিজদা দেয়া ফরয। কেননা এর তাৎপর্য হল কাফিররা মাথা নত করে না এবং কুরআনের ওয়াজিবসমূহ প্রতিপালনের মাধ্যমে আনুগত্য প্রদর্শন করে না। (তাফসীর কুরতুবী) সিজদার বিধান সম্পর্কে সূরা আ‘রাফের শেষ আয়াতে আলোচনা করা হয়েছে।</p><p>يُوْعُوْنَ কাতাদাহ ও মুজাহিদ (রহঃ) বলেন : তারা অন্তরে যা কিছু গোপন করে সব আল্লাহ তা‘আলা জানেন। অর্থাৎ কাফিররাই আখিরাতকে অস্বীকার করে, তাদের সকল কিছু আল্লাহ তা‘আলা অবগত আছেন, আখিরাতে তাদের জন্য রয়েছে জাহান্নামের শাস্তি। সুতরাং হে রাসূল! তুমি তাদেরকে জাহান্নামের শাস্তির সুসংবাদ দিয়ে দাও।</p><p>(غَيْرُ مَمْنُوْنٍ....)</p><p>অর্থাৎ غَيْرُ مَنْقُوْصٍ বা কম করে নয়, নিরবচ্ছিন্ন। মুজাহিদ ও যহহাক (রহঃ) বলেন:</p><p>غَيْرُ مَمحسوْنٍ</p><p>বা বেহিসাব প্রতিদান দেয়া হবে। অর্থাৎ যারা ঈমান এনেছে, সৎআমল করেছে তারা জাহান্নামের অধিবাসী নয়, বরং তাদের জন্য রয়েছে অফুরন্ত নেয়ামত।</p><p>সুতরাং মু’মিননের জন্য জান্নাতে যে অপরিমেয় নেয়ামত রয়েছে তার জন্য আমাদের প্রতিটি মু’মিনের আগ্রহ প্রকাশসহ যথাসম্ভব সৎ আমল করা উচিত।</p><p><b> আয়াত হতে শিক্ষণীয় বিষয়: </b></p><p>১. মানুষ কিয়ামতের দিন কঠিন থেকে কঠিনতর পরিস্থিতির সম্মুখীন হবে।</p><p>২. কোন প্রতিবন্ধক না থাকা সত্ত্বেও মানুষ আল্লাহ তা‘আলার প্রতি ঈমান আনে না, এটাই আশ্চর্যজনক বিষয়।</p><p>৩. সিজদার আয়াত তেলাওয়াত করে সিজদা করা মুস্তাহাব।</p><p>৪. মু’মিনদের জন্য রয়েছে অপরিমেয় প্রতিদান।</p>"
      },
      {
        "resource_id": 91,
        "text": "ومن الناس فريق هداهم الله، فآمنوا بالله، وقبلوا ما جاءتهم به الرسل، فآمنوا وعملوا الصالحات. فهؤلاء لهم أجر غير ممنون أي: غير مقطوع بل هو أجر دائم مما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.  تم تفسير السورة ولله الحمد.  "
      },
      {
        "resource_id": 164,
        "text": "<p><b>১৬-২৫ নং আয়াতের তাফসীর</b>সূর্যাস্তকালীন আকাশের লালিমাকে শফক বলা হয়। পশ্চিমাকাশের প্রান্তে এ লালিমার প্রকাশ লক্ষ্য করা যায়। হযরত আলী (রাঃ), হযরত ইবনে আব্বাস (রঃ), হযরত উবাদা ইবনে সামিত (রাঃ), হযরত আবু হুরাইরা (রাঃ), হযরত শাদদাদ ইবনে আউস (রাঃ) হযরত আবদুল্লাহ ইবনে উমার (রাঃ), হযরত মুহাম্মদ ইবনে আলী ইবনে হুসাইন (রঃ), হযরত মাকস্থূল (রঃ), হযরত বকর ইবনে আবদিল্লাহ মাযানী (রঃ), হযরত বুকায়ের ইবনে আশাজ (রঃ), হযরত মালিক (রঃ), হযরত ইবনে আবী যিব (রঃ) এবং হযরত আবদুল আযীম ইবনে আবী সালমা মা, জিশান (রঃ) বলেন ঐ লালিমাকেই শফক বলা হয়। হযরত আবু হুরাইরা (রাঃ) হতে এটাও বর্ণিত আছে যে, শফক হলো শুভ্রতা। তবে কিনারা বা প্রান্তের লালিমাকে শফক বলা হয় সেটা সূর্যোদয়ের পূর্বেই হোক বা সূর্যোদয়ের পরেই হোক। খলীল (রঃ) বলেন যে, ইশার সময় পর্যন্ত এ লালিমা অবশিষ্ট থাকে। জওহীর (রঃ) বলেন, যে সূর্য অস্তমিত হওয়ার পর যে লালিমা বা আলোক অবশিষ্ট থাকে ওটাকে শফক বলা হয়। এটা সন্ধ্যার পর থেকে নিয়ে ইশার নামাযের সময় পর্যন্ত অবশিষ্ট থাকে। ইকরামা (রঃ) বলেন যে, মাগরিবের সময় থেকে নিয়ে ইশার সময় পর্যন্ত এটা বাকী থাকে।সহীহ মুসলিমে হযরত আবদুল্লাহ ইবনে আমর (রাঃ) হতে বর্ণিত আছে যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ “মাগরিবের সময় শফক অদৃশ্য হওয়া পর্যন্ত বলবৎ থাকে।” অর্থাৎ এ সময় পর্যন্ত মাগরিবের নামায আদায় করা যেতে পারে।” মুজাহিদ (রঃ) বলেন যে, শফকের অর্থ হলো সারাদিন। অন্য এক রিওয়াইয়াতে আছে যে, শফকের অর্থ হলো সূর্য। মনে হয় আলো এবং অন্ধকারের কসম খেয়েছেন। ইমাম ইবনে জারীর (রঃ) বলেন যে, এর অর্থ হলোঃ দিনের প্রস্থান এবং রাত্রির আগমনের শপথ। অন্যরা বলেন যে, সাদা এবং লাল বর্ণের নাম শফক। এই শব্দটি (আরবি) এর অন্তর্ভুক্ত অর্থাৎ বিপরীত অর্থবোধক।(আরবি)  শব্দের অর্থ হলোঃ একত্রিত করেছে অর্থাৎ নক্ষত্ররাজি এবং যা কিছু রাত্রে বিচরণ করে | আর শপথ চন্দ্রের, যখন তা পূর্ণ হয়। অর্থাৎ চন্দ্র যখন পূর্ণতা প্রাপ্ত হয়ে পুর্ণ আলোকময় হয়ে যায় তার শপথ।(আরবি) এর তাফসীর সহীহ বুখারীতে মারফু হাদীসে বর্ণিত আছে যে, এক অবস্থা থেকে অন্য অবস্থার দিকে অগ্রসর হয়ে চলে যাবে। হযরত আনাস (রাঃ) বলেন যে, যে বছর আসবে সেই বছর পূর্বের বছরের চেয়ে খারাপ হবে। হযরত উমার (রাঃ), হযরত ইবনে মাসউদ (রাঃ), হযরত ইবনে আব্বাস (রাঃ) প্রমুখ গুরুজনও এটাই সমর্থন করেন এবং মক্কাবাসী ও কুফাবাসীর কিরআত দ্বারাও এরই সমর্থন পাওয়া যায়।শাবী (রঃ) বলেন যে, (আরবি) এর অর্থ হলোঃ হে নবী (সঃ)! তুমি এক আকাশের পর অন্য আকাশে আরোহণ করবে। এর দ্বারা মিরাজকে বুঝানো হয়েছে। অর্থাৎ এক মনযিলের পর অন্য মনযিলে আরোহণ করতে থাকবে। সুদ্দী (রঃ) বলেন যে, এর অর্থ হলোঃ নিজ নিজ আমল অনুযায়ী মনযিল অতিক্রম করবে। যেমন সহীহ হাদীসে রয়েছে যে, রাসূলুল্লাহ (সঃ) বলেছেনঃ “তোমরা তোমাদের পূর্ববর্তীদের নীতি বা পন্থার উপর চলবে। এমন কি তারা যদি গোসাপের গর্তে প্রবেশ করে থাকে তবে তোমরাও তাই করবে।” সাহাবীগণ জিজ্ঞেস করলেনঃ “হে আল্লাহ রাসূল (সঃ) পূর্ববর্তীদের দ্বারা কি ইয়াহূদী ও নাসারাদেরকে বুঝানো হয়েছে? তিনি উত্তরে বলেনঃ “তারা ছাড়া আর কারা হবে?”মাকহুল (রঃ) বলেন যে, এর ভাবার্থ হলোঃ প্রতি বিশ বছর পর পর তোমরা কোন না কোন এমন কাজ আবিষ্কার করবে যা পূর্বে ছিল না। আব্দুল্লাহ্ (রাঃ) বলেন যে, এর অর্থ হলোঃ আসমান ফেটে যাবে, তারপর ওটা লাল বর্ণ ধারণ করবে এবং এর পরেও রঙ বদলাতেই থাকবে। এক সময় আকাশ ধূম্র হয়ে যাবে, তারপর ফেটে যাবে। হযরত সাঈদ ইবনে জুবাইর (রঃ) বলেন যে, এর অর্থ হলোঃ পৃথিবীতে অবস্থানকারী হীন ও নিকৃষ্ট মর্যাদার বহু লোক আখেরাতে উচ্চ মর্যাদা লাভ করবে। পক্ষান্তরে পৃথিবীর উচ্চ মর্যাদাশীলও প্রভাবশালী বহু লোক আখেরাতে মর্যাদাহীন, অপমানিত ও বিফল মনোরথ হয়ে যাবে। ইকরামা (রঃ) এর অর্থ বর্ণনা করেন যে, প্রথমে দুধপানকারী, তারপর খাদ্য ভক্ষণকারী প্রথমে যুবক ছিল, তারপর বৃদ্ধ হয়েছে। হযরত হাসান বসরী (রঃ) বলেন যে, (আরবি) এর ভাবার্থ হচ্ছেঃ কোমলতার পর কঠোরতা, কঠোরতার পর কোমলতা, আমীরীর পর ফকীরী ও ফকীরীর পর আমীরী এবং সুস্থতার পর অসুস্থতা ও অসুস্থতার পর সুস্থতা।হযরত জাবির ইবনে আবদিল্লাহ্ (রাঃ) হতে বর্ণিত আছে যে, তিনি রাসূলুল্লাহ্ (সঃ)-কে বলতে শুনেছেনঃ “আদম সন্তান গাফলতী বা উদাসীনতার মধ্যে রয়েছে। তারা যে কি উদ্দেশ্যে সৃষ্ট হয়েছে তার পরোয়া তারা মোটেই করে না।আল্লাহ্ তা'আলা যখন কাউকে সৃষ্টি করার ইচ্ছা করেন তখন একজন ফেরেশতাকে বলেনঃ তার বিক, জন্ম-মৃত্যু ও পাপ-পুণ্য লিখে নাও।' আদিষ্ট কাজ সম্পন্ন করে সেই ফেরেশতা চলে যান এবং অন্য ফেরেশতাকে আল্লাহ তার কাছে পাঠিয়েদেন। তিনি এসে ঐ মানব-শিশুর রক্ষণাবেক্ষণ করেন। ঐ শিশু বুদ্ধি। বিবেকের অধিকারী হলে ঐ ফেরেশতাকে উঠিয়ে নেয়া হয় এবং তার পাপ-পুণ্য লিখবার জন্যে আল্লাহ্ তার উপর দু'জন ফেরেশতাকে নিযুক্ত করেন। তার মৃত্যুর সময় ঘনিয়ে আসলে এরা দুজন চলে যান এবং মালাকুল মাউত (মৃত্যুর ফেরেশতা) তার নিকট আগমন করেন এবং তার রূহ কবয করে নিয়ে চলে যান। তারপর ঐ রূহ্ তার কবরের মধ্যে তার দেহে ফিরিয়ে দেয়া হয়। তখন মালাকুল মাউত চলে যান এবং তাকে প্রশ্নোত্তর করার জন্যে কবরে দু’জন ফেরেশতা আসেন এবং নিজেদের কাজ শেষ করে তাঁরাও বিদায় গ্রহণ করেন। কিয়ামতের দিন পাপ-পুণ্যের ফেরেশতাদ্বয় আসবেন এবং তার কাঁধ হতে তার আমলনামা খুলে নিবেন। তারপর তারা তার সাথেই থাকবেন, একজন চালকরূপে এবং অপরজন সাক্ষীরূপে। তারপর আল্লাহ তা'আলা বলবেনঃ(আরবি)অর্থাৎ তুমি এই দিবস সম্বন্ধে উদাসীন ছিলে।” (৫০:২২) তারপর রাসূলুল্লাহ্ (সঃ) (আরবি) এ আয়াতটি পাঠ করলেন। অর্থাৎ এক অবস্থার পরে অন্য অবস্থা। তারপর নবী করীম (সঃ) বললেনঃ “(হে জনমণ্ডলী!) তোমাদের সামনে বিরাট ও গুরুত্বপূর্ণ বিষয় রয়েছে। যা পালন করার শক্তি তোমাদের নেই। সুতরাং তোমরা মহান ও সর্বশক্তিমান আল্লাহর নিকট সাহায্য প্রার্থনা কর।” (এ হাদীসটি ইমাম ইবনে আবী হাতিম (রঃ) বর্ণনা করেছেন। কিন্তু এটা মুনকার হাদীস এবং এর সনদের মধ্যে দুর্বল বর্ণনাকারী বেশ কয়েকজন রয়েছেন। তবে এর অর্থ বিশুদ্ধ। এসব ব্যাপার আল্লাহ্ তা'আলাই সবচেয়ে ভাল জানেন)ইমাম ইবনে জারীর (রঃ) এসব উক্তি উদ্ধৃত করে বলেন যে, এর প্রকৃত ভাবার্থ হলোঃ হে মুহাম্মদ (সঃ) তুমি একটার পর একটা কঠিন কঠিন কাজে জড়িয়ে পড়বে। যদিও এখানে রাসূলুল্লাহ্ (সঃ)-কে সম্বোধন করা হয়েছে, কিন্তু আসলে সব মানুষকেই সম্বোধন করে বলা হয়েছে যে, তারা কিয়ামতের দিন একটার পর একটা বিভীষিকা প্রত্যক্ষ করবে। এরপর আল্লাহ্ তা'আলা বলেনঃ তাদের কি হলো যে, তারা ঈমান আনে না? আর কুরআন শুনে সাজদায় অবনত হতে কে তাদেরকে বিরত রাখে? বরং এই কাফিররা তো উল্টো অবিশ্বাস করে মিথ্যা সাব্যস্ত করে এবং সত্য ও হকের বিরোধিতা করে। তারা হঠকারিতা এবং মন্দের মধ্যে ডুবে আছে। তারা মনের কথা গোপন রাখলেও আল্লাহ্ তা'আলা সেসব ভালভাবেই জানেন।এরপর আল্লাহ্ তা'আলা স্বীয় নবী (সঃ)-কে সম্বোধন করে বলেনঃ হে নবী (সঃ)! তুমি এই কাফিরদেরকে জানিয়ে দাও যে, আল্লাহ তাআলা তাদের জন্য যন্ত্রণাদায়ক শাস্তি প্রস্তুত করে রেখেছেন।তারপর বলেনঃ সেই শাস্তি থেকে রক্ষা পেয়ে উত্তম পুরস্কারের যোগ্য তারাই যারা ঈমান এনে সকাজ করেছে। তারা পুরোপুরি, অফুরন্ত ও বেহিসাব পুরস্কার লাভ করবে। যেমন অন্যত্র রয়েছেঃ (আরবি) অর্থাৎ “এমন দান যা শেষ হবার নয়।” (১১:১০৮) কেউ কেউ বলেছেন যে, (আরবি) এর অর্থ হলো অর্থাৎ হাসকৃত নয়। কিন্তু এর অর্থ ঠিক নয়। কেননা, প্রতি মুহূর্তে এবং সব সময়েই আল্লাহ্ রাব্বল আলামীন জান্নাতবাসীদের প্রতি ইহসান করবেন এবং তাদেরকে পুরস্কৃত করবেন। বলা যাবে যে, আল্লাহ্ পাকের মেহেরবানী এবং অনুগ্রহের কারণেই জান্নাতীরা জান্নাত লাভ করেছে, তাদের আমলের কারণে নয়। সেই মালিকের তো নিজের মাখলুকাতের প্রতি একটা চিরস্থায়ী অনুগ্রহ রয়েছে। তার পবিত্র সত্তা চিরদিনের ও সব সময়ের জন্যে প্রশংসার যোগ্য। এ কারণেই জান্নাতবাসীদের জন্যে আল্লাহর হামদ, তাসবীহ্ শ্বাস-প্রশ্বাসের মতই সহজ করা হবে। কুরআন কারীমে আল্লাহ্ পাক বলেনঃ (আরবি) অর্থাৎ “তাদের শেষ ধ্বনি হবেঃ প্রশংসা জগতসমূহের প্রতিপালক আল্লাহরই প্রাপ্য।”</p>"
      },
      {
        "resource_id": 157,
        "text": "<p>عربی زبان میں اسے استثنائے منقطع کیا جاتا ہے۔ اس لئے کہ کفار کو جو ناگوار اور سیاہ خوشخبری دی گئی ہے یا سیاہ وارنٹ دیا گیا ہے اس میں اہل ایمان کو شامل ہی نہ تھے ، لیکن اس استثنائی انداز سے مقصود یہ ہے کہ جن لوگوں کو مستثنیٰ کیا گیا وہ بہت ہی خوش قسمت ہیں۔</p><p>اور اجر غیر ممنون کیا ہے ، وہ جو ختم نہ ہو ہمیشہ باقی رہنے والا دائمی اجر۔ اس فیصلہ کن ضرت پر یہ سورت ختم ہوتی ہے۔ یہ ایک مختصر سورت ہے ، چند سطری لیکن وسیع اور فکر انگیز موضوعات بحث پیش کرتی ہے۔</p>"
      },
      {
        "resource_id": 159,
        "text": "<p>آیت 25{ اِلَّا الَّذِیْنَ اٰمَنُوْا وَعَمِلُوالصّٰلِحٰتِ لَہُمْ اَجْرٌ غَیْرُ مَمْنُوْنٍ۔ } ”البتہ جو لوگ ایمان لائے اور جنہوں نے نیک عمل کیے ‘ ان کے لیے کبھی نہ ختم ہونے والا اجر ہے۔“ مَنَّ یَمُنُّ مَنًّاکے لغوی معنی کسی چیز کو کاٹ دینے کے ہیں۔ ظاہر ہے جب کسی چیز کو کاٹ دیا جاتا ہے تو اس کی انتہا ہوجاتی ہے۔ چناچہ اَجْرٌ غَیْرُ مَمْنُوْن سے مراد ایسا اجر ہے جس کا سلسلہ کبھی منقطع نہیں ہوگا۔</p>"
      },
      {
        "resource_id": 165,
        "text": "<p>কিন্তু যারা ঈমান আনে ও সৎকর্ম করে তাদের জন্য রয়েছে নিরবচ্ছিন্ন পুরস্কার।</p>"
      },
      {
        "resource_id": 166,
        "text": "<p>কিন্তু যারা ঈমান আনে ও সৎকাজ করে তাদের জন্য রয়েছে নিরবচ্ছিন্ন পুরস্কার।</p>"
      },
      {
        "resource_id": 92,
        "text": "إِلَّا الَّذِينَ آَمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ (25)يجوز أن يكون الاستثناء متصلاً : إمَّا على أنه استثناء من الضمير في قوله : { لتركبن طبقاً عن طبق } [ الانشقاق : 19 ] جرياً على تأويله بركوب طباق الشدائد والأهوال يوم القيامة وما هو في معنى ذلك من التهديد .وإمّا على أنه استثناء من ضمير الجمع في { فبشرهم } [ الانشقاق : 24 ] والمعنى إلا الذين يؤمنون من الذين هم مشركون الآن كقوله تعالى : { إلا الذين تابوا وأصلحوا وبينوا } [ البقرة : 160 ] وقوله في سورة البروج ( 10 ) : { إن الذين فتنوا المؤمنين والمؤمنات ثم لم يتوبوا الآية وفعل آمنوا } على هذا الوجه مراد به المستقبل ، وعبّر عنه بالماضي للتنبيه على معنى : مَن تحقق إيمانهم ، وما بينهما من قوله : { فما لهم لا يؤمنون } [ الانشقاق : 20 ] إلى هنا تفريع معترض بين المستثنى والمستثنى منه خصّ به الأَهمَّ ممن شملهم عموم { لتركبن طبقاً عن طبق } [ الانشقاق : 19 ] .وقيل : هو استثناء منقطع من ضمير { فبشرهم } فهو داخل في التبشير المستعمل في التهكم زيادة في إدخال الحزن عليهم . فحرف { إلاّ } بمنزلة ( لكن ) والاستدراك فيه لمجرد المضادة لا لِدفع توهم إرادة ضد ذلك ومثل ذلك كثير في الاستدراك ، وأما تعريف بعضهم الاستدراك بأنه تعقيب الكلام برفع ما يُتوهم ثبوته أو نفيُه ، فهو تعريف تقريبي .وجملة { لهم أجر غير ممنون } استئناف بياني كأنَّ سائلاً سأل : كيف حالهم يوم يكون أولئك في عذاب أليم؟والأجر غير الممنون هو الذي يعطاه صاحبُه مع كرامة بحيث لا يعرَّض له بمنة كما أشار إليه قوله تعالى : { جزاء بما كانوا يعملون } [ الأحقاف : 14 ] ونحوه مما ذكر فيه مع الجزاء سببُه ، والمعنى : أن أجرهم سرور لهم لا تشوبه شائبة كدر فإن المنّ ينغّص الإِنعام قال تعالى : { يا أيها الذين آمنوا لا تبطلوا صدقاتكم بالمن والأذى } [ البقرة : 264 ] وقال النابغة: ... عليَّ لِعَمْرو نِعمةٌ بعدَ نعمةلوالده ليستْ بذات عقارب ... ومن نوابغ الكلم للعلامة الزمخشري : طعم الآلاءِ أحْلَى من المَنّ . وهو أمرّ من الآلاء مَعَ المَنّ .ويجوز أن يكون { غير ممنون } بمعنى غير مقطوع يُقال : مننت الحبل ، إذا قطعته ، قال تعالى : { وفاكهة كثيرة لا مقطوعة ولا ممنوعة } [ الواقعة : 32 ، 33 ] .سأل نافع بن الأزرق الخارجي عبدَ اللَّه بن عباس عن قوله : { غير ممنون } فقال : غير مقطوع ، فقال : هل تعرف العرب ذلك؟ قال : نعم قد عرفه أخو يَشكر ( يعني الحارث بن حلزة ) حيث يقول: ... فتَرى خَلفَهُنّ من سرعة الرَّجْع منيناً كأنه أهْباء ... المنين : الغبار لأنها تقطعه وراءها ."
      },
      {
        "resource_id": 15,
        "text": "( إِلا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ) يقول: إلا الذين تابوا منهم وصدّقوا، وأقرّوا بتوحيده، ونبوّة نبيه محمد صلى الله عليه وسلم، وبالبعث بعد الممات.( وعملوا الصالحات ) : يقول: وأدَّوا فرائض الله، واجتنبوا ركوب ما حرّم الله عليهم ركوبه.وقوله: ( لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ ) يقول تعالى ذكره لهؤلاء الذين آمنوا وعملوا الصالحات: ثواب غير محسوب ولا منقوص.وبنحو الذي قلنا في ذلك قال أهل التأويل.* ذكر من قال ذلك:حدثني عليّ، قال: ثنا أبو صالح، قال: ثني معاوية، عن عليّ، عن ابن عباس قوله: ( لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ ) يقول: غير منقوص .حدثنا ابن حميد، قال: ثنا مهران، عن سفيان عن ابن جريج، عن مجاهد، قوله: ( أَجْرٌ غَيْرُ مَمْنُونٍ ) يعني: غير محسوب .آخر تفسير سورة ( إِذَا السَّمَاءُ انْشَقَّتْ ) ."
      },
      {
        "resource_id": 93,
        "text": "والاستثناء فى قوله - تعالى - : ( إِلاَّ الذين آمَنُواْ وَعَمِلُواْ الصالحات لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ ) استثناء منقطع . أى : هذا هو حال الكافرين ، لكن الذين آمنوا إيمانا حقا ، وقدموا فى دنياهم الأعمال الصالحة ، فلهم فى الآخرة أجر غير مقطوع ، فقوله ( ممنون ) مِنْ مَنَّ : إذا قطع يقال : مننت الحبل إذا قطعته ، أو لهم أجر خالص من شوائب الامتنان ، وهو أن يعطى الإِنسان غيره عطاء ، ثم يتباهى عليه به .نسأ الله - تعالى - أن يجعلنا من عباده المؤمنين الصادقين .وصلى الله على سيدنا محمد وعلى آله وصحبه وسلم ."
      }
    ]
  }
]
